embetech-official/embenet-demo-nucleo-wl33cc1/Drivers/CMSIS/Device/ST/STM32WL3X/Include/stm32wl33.h
typedef struct {                              /*!< COMP Structure                                                              */
  __IO  uint32_t  CSR;                       /*!< (@ 0x00000000) Control and status register                                  */
} COMP_TypeDef;                               /*!< Size = 4 (0x04)                                                             */



/* =========================================================================================================================== */
/* ================                                     DAC                                                   ================ */
/* =========================================================================================================================== */


/**
  * @brief Digital to Analog Converter (DAC)
  */

typedef struct {                                /*!< DAC Structure                                                 */
  __IO uint32_t  CR;                           /*!< (@ 0x00000000) Control register                               */
  __IO  uint32_t  SWTRIGR;                      /*!< (@ 0x00000004) Software trigger register                      */
  __IO  uint32_t  RESERVED[2];
  __IO uint32_t  DHR;                          /*!< (@ 0x00000010) Channel data holding register                  */
  __IO  uint32_t  RESERVED1[6];
  __IO  uint32_t  DOR;                          /*!< (@ 0x0000002C) Channel data output register                   */
  __IO  uint32_t  RESERVED2;
  __IO uint32_t  SR;                           /*!< (@ 0x00000034) Status register                                */
} DAC_TypeDef;                                  /*!< Size = 56 (0x38)                                              */



/* =========================================================================================================================== */
/* ================                                     LCSC                                                  ================ */
/* =========================================================================================================================== */


/**
  * @brief LC Sensor Controller (LCSC)
  */

typedef struct{ /*!< LCSC Structure  */
  __IO uint32_t CR0;       /*!< (@ 0x00000000) LCSC_CR0 register               */
  __IO uint32_t CR1;       /*!< (@ 0x00000004) LCSC_CR1 register               */
  __IO uint32_t CR2;       /*!< (@ 0x00000008) LCSC_CR2 register               */
  __IO uint32_t PULSE_CR;  /*!< (@ 0x0000000C) LCSC_PULSE_CR register          */
  __IO uint32_t ENR;       /*!< (@ 0x00000010) LCSC_ENR register               */
  __IO  uint32_t WHEEL_SR;  /*!< (@ 0x00000014) LCSC_WHEEL_SR register          */
  __IO uint32_t CONFR;     /*!< (@ 0x00000018) LCSC_CONFR register             */
  __IO  uint32_t COMP_CTN;  /*!< (@ 0x0000001C) LCSC_COMP_CTN register          */
  __IO  uint32_t SR;        /*!< (@ 0x00000020) LCSC_SR register                */
  __IO uint32_t STAT;      /*!< (@ 0x00000024) LCSC_STAT register              */
  __IO  uint32_t RESERVED[6];
  __IO  uint32_t VER;       /*!< (@ 0x00000040) LCSC_VER register               */
  __IO uint32_t ISR;       /*!< (@ 0x00000044) LCSC_ISR register               */
} LCSC_TypeDef;              /*!< Size = 72 (0x48) */



/* =========================================================================================================================== */
/* ================                                     DBGMCU                                                ================ */
/* =========================================================================================================================== */


/**
  * @brief MCU debug component (DBGMCU)
  */

typedef struct{ /*!< DBGMCU Structure  */
  __IO uint32_t CR;                /*!< (@ 0x00000000) CR register                   */
  __IO uint32_t DBG_APB0_FZ;       /*!< (@ 0x00000004) DBG_APB0_FZ register          */
  __IO uint32_t DBG_APB1_FZ;       /*!< (@ 0x00000008) DBG_APB1_FZ register          */
} DBGMCU_TypeDef;                      /*!< Size = 12 (0x0C) */



/* =========================================================================================================================== */
/* ================                                     LCD                                                   ================ */
/* =========================================================================================================================== */


/**
  * @brief Liquid crystal display controller (LCD)
  */

typedef struct {                                /*!< LCD Structure                                                             */
  __IO  uint32_t  CR;                          /*!< (@ 0x00000000) Control register                                           */
  __IO  uint32_t  FCR;                         /*!< (@ 0x00000004) Frame control register                                     */
  __IO  uint32_t  SR;                          /*!< (@ 0x00000008) Status register                                            */
  __IO   uint32_t  CLR;                         /*!< (@ 0x0000000C) Clear register                                             */
  __IO   uint32_t  RESERVED;
  __IO  uint32_t  RAM_COM0;                    /*!< (@ 0x00000014) Disaplay Memory COM 0                                      */
  __IO   uint32_t  RESERVED1;
  __IO  uint32_t  RAM_COM1;                    /*!< (@ 0x0000001C) Disaplay Memory COM 1                                      */
  __IO   uint32_t  RESERVED2;
  __IO  uint32_t  RAM_COM2;                    /*!< (@ 0x00000024) Disaplay Memory COM 2                                      */
  __IO   uint32_t  RESERVED3;
  __IO  uint32_t  RAM_COM3;                    /*!< (@ 0x0000002C) Disaplay Memory COM 3                                      */
  __IO   uint32_t  RESERVED4;
  __IO  uint32_t  RAM_COM4;                    /*!< (@ 0x00000034) Disaplay Memory COM 4                                      */
  __IO   uint32_t  RESERVED5;
  __IO  uint32_t  RAM_COM5;                    /*!< (@ 0x0000003C) Disaplay Memory COM 5                                      */
  __IO   uint32_t  RESERVED6;
  __IO  uint32_t  RAM_COM6;                    /*!< (@ 0x00000044) Disaplay Memory COM 6                                      */
  __IO   uint32_t  RESERVED7;
  __IO  uint32_t  RAM_COM7;                    /*!< (@ 0x0000004C) Disaplay Memory COM 7                                      */
} LCD_TypeDef;                                  /*!< Size = 80 (0x50)                                                          */



/* =========================================================================================================================== */
/* ================                                   MR_SUBG_RADIO                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief MR_SUBG Radio
  */

typedef struct{ /*!< MR_SUBG_RADIO Structure  */
  __IO uint32_t RF_FSM0_TIMEOUT;       /*!< (@ 0x00000000) RF_FSM0_TIMEOUT register                */
  __IO uint32_t RF_FSM1_TIMEOUT;       /*!< (@ 0x00000004) RF_FSM1_TIMEOUT register                */
  __IO uint32_t RF_FSM2_TIMEOUT;       /*!< (@ 0x00000008) RF_FSM2_TIMEOUT register                */
  __IO uint32_t RF_FSM3_TIMEOUT;       /*!< (@ 0x0000000C) RF_FSM3_TIMEOUT register                */
  __IO uint32_t RF_FSM4_TIMEOUT;       /*!< (@ 0x00000010) RF_FSM4_TIMEOUT register                */
  __IO uint32_t RF_FSM5_TIMEOUT;       /*!< (@ 0x00000014) RF_FSM5_TIMEOUT register                */
  __IO uint32_t RF_FSM6_TIMEOUT;       /*!< (@ 0x00000018) RF_FSM6_TIMEOUT register                */
  __IO uint32_t RF_FSM7_TIMEOUT;       /*!< (@ 0x0000001C) RF_FSM7_TIMEOUT register                */
  __IO uint32_t AFC0_CONFIG;           /*!< (@ 0x00000020) AFC0_CONFIG register                    */
  __IO uint32_t AFC1_CONFIG;           /*!< (@ 0x00000024) AFC1_CONFIG register                    */
  __IO uint32_t AFC2_CONFIG;           /*!< (@ 0x00000028) AFC2_CONFIG register                    */
  __IO uint32_t AFC3_CONFIG;           /*!< (@ 0x0000002C) AFC3_CONFIG register                    */
  __IO uint32_t CLKREC_CTRL0;          /*!< (@ 0x00000030) CLKREC_CTRL0 register                   */
  __IO uint32_t CLKREC_CTRL1;          /*!< (@ 0x00000034) CLKREC_CTRL1 register                   */
  __IO uint32_t DCREM_CTRL0;           /*!< (@ 0x00000038) DCREM_CTRL0 register                    */
  __IO uint32_t DCREM_CTRL1;           /*!< (@ 0x0000003C) DCREM_CTRL1 register                    */
  __IO uint32_t IQC_CTRL0;             /*!< (@ 0x00000040) IQC_CTRL0 register                      */
  __IO uint32_t IQC_CTRL1;             /*!< (@ 0x00000044) IQC_CTRL1 register                      */
  __IO uint32_t IQC_CTRL2;             /*!< (@ 0x00000048) IQC_CTRL2 register                      */
  __IO uint32_t IQC_CTRL3;             /*!< (@ 0x0000004C) IQC_CTRL3 register                      */
  __IO  uint32_t RESERVED;
  __IO uint32_t AGC0_CTRL;             /*!< (@ 0x00000054) AGC0_CTRL register                      */
  __IO uint32_t AGC1_CTRL;             /*!< (@ 0x00000058) AGC1_CTRL register                      */
  __IO uint32_t AGC2_CTRL;             /*!< (@ 0x0000005C) AGC2_CTRL register                      */
  __IO uint32_t AGC3_CTRL;             /*!< (@ 0x00000060) AGC3_CTRL register                      */
  __IO uint32_t AGC4_CTRL;             /*!< (@ 0x00000064) AGC4_CTRL register                      */
  __IO uint32_t AGC_ATTEN0;            /*!< (@ 0x00000068) AGC_ATTEN0 register                     */
  __IO uint32_t AGC_ATTEN1;            /*!< (@ 0x0000006C) AGC_ATTEN1 register                     */
  __IO uint32_t AGC_ATTEN2;            /*!< (@ 0x00000070) AGC_ATTEN2 register                     */
  __IO uint32_t AGC_ATTEN3;            /*!< (@ 0x00000074) AGC_ATTEN3 register                     */
  __IO uint32_t AGC_ATTEN4;            /*!< (@ 0x00000078) AGC_ATTEN4 register                     */
  __IO uint32_t AGC_ATTEN5;            /*!< (@ 0x0000007C) AGC_ATTEN5 register                     */
  __IO uint32_t AGC_ATTEN6;            /*!< (@ 0x00000080) AGC_ATTEN6 register                     */
  __IO uint32_t AGC_ATTEN7;            /*!< (@ 0x00000084) AGC_ATTEN7 register                     */
  __IO uint32_t AGC_ATTEN8;            /*!< (@ 0x00000088) AGC_ATTEN8 register                     */
  __IO uint32_t AGC_ATTEN9;            /*!< (@ 0x0000008C) AGC_ATTEN9 register                     */
  __IO uint32_t AGC1_ATTEN_TRIM;       /*!< (@ 0x00000090) AGC1_ATTEN_TRIM register                */
  __IO uint32_t AGC2_ATTEN_TRIM;       /*!< (@ 0x00000094) AGC2_ATTEN_TRIM register                */
  __IO uint32_t AGC3_ATTEN_TRIM;       /*!< (@ 0x00000098) AGC3_ATTEN_TRIM register                */
  __IO uint32_t AGC4_ATTEN_TRIM;       /*!< (@ 0x0000009C) AGC4_ATTEN_TRIM register                */
  __IO  uint32_t AGC_PGA_HWTRIM_OUT;    /*!< (@ 0x000000A0) AGC_PGA_HWTRIM_OUT register             */
  __IO  uint32_t RESERVED1;
  __IO uint32_t PA_REG;                /*!< (@ 0x000000A8) PA_REG register                         */
  __IO  uint32_t PA_HWTRIM_OUT;         /*!< (@ 0x000000AC) PA_HWTRIM_OUT register                  */
  __IO  uint32_t RESERVED2[3];
  __IO uint32_t RSSI_FLT;              /*!< (@ 0x000000BC) RSSI_FLT register                       */
  __IO  uint32_t RESERVED3[2];
  __IO uint32_t SYNTH2_ANA_ENG;        /*!< (@ 0x000000C8) SYNTH2_ANA_ENG register                 */
  __IO  uint32_t RESERVED4[7];
  __IO  uint32_t RXADC_HWDELAYTRIM_OUT; /*!< (@ 0x000000E8) RXADC_HWDELAYTRIM_OUT register          */
  __IO  uint32_t RESERVED5[2];
  __IO  uint32_t RX_AAF_HWTRIM_OUT;     /*!< (@ 0x000000F4) RX_AAF_HWTRIM_OUT register              */
  __IO  uint32_t RESERVED6[2];
  __IO uint32_t SINGEN_ANA_ENG;        /*!< (@ 0x00000100) SINGEN_ANA_ENG register                 */
  __IO  uint32_t RESERVED7;
  __IO  uint32_t RF_INFO_OUT;          /*!< (@ 0x00000108) RF_INFO_OUT register                */
  __IO  uint32_t RESERVED8[6];
  __IO uint32_t RF_FSM8_TIMEOUT;       /*!< (@ 0x00000124) RF_FSM8_TIMEOUT register                */
  __IO uint32_t RF_FSM9_TIMEOUT;       /*!< (@ 0x00000128) RF_FSM9_TIMEOUT register                */
  __IO uint32_t RF_FSM10_TIMEOUT;      /*!< (@ 0x0000012C) RF_FSM10_TIMEOUT register               */
  __IO  uint32_t RESERVED9[5];
  __IO uint32_t SUBG_DIG_CTRL0;        /*!< (@ 0x00000144) SUBG_DIG_CTRL0 register                 */
} MR_SUBG_RADIO_TypeDef;                          /*!< Size = 328 (0x148) */



/* =========================================================================================================================== */
/* ================                                   MR_SUBG_GLOB_STATIC                                     ================ */
/* =========================================================================================================================== */


/**
  * @brief MR_SUBG Global Static
  */

typedef struct{ /*!< MR_SUBG_GLOB_STATIC Structure  */
  __IO uint32_t PCKT_CONFIG;       /*!< (@ 0x00000000) PCKT_CONFIG register              */
  __IO uint32_t SYNC;              /*!< (@ 0x00000004) SYNC register                     */
  __IO uint32_t SEC_SYNC;          /*!< (@ 0x00000008) SEC_SYNC register                 */
  __IO uint32_t CRC_INIT;          /*!< (@ 0x0000000C) CRC_INIT register                 */
  __IO uint32_t PCKT_CTRL;         /*!< (@ 0x00000010) PCKT_CTRL register                */
  __IO uint32_t DATABUFFER0_PTR;   /*!< (@ 0x00000014) DATABUFFER0_PTR register          */
  __IO uint32_t DATABUFFER1_PTR;   /*!< (@ 0x00000018) DATABUFFER1_PTR register          */
  __IO uint32_t DATABUFFER_SIZE;   /*!< (@ 0x0000001C) DATABUFFER_SIZE register          */
  __IO uint32_t PA_LEVEL_3_0;      /*!< (@ 0x00000020) PA_LEVEL_3_0 register             */
  __IO uint32_t PA_LEVEL_7_4;      /*!< (@ 0x00000024) PA_LEVEL_7_4 register             */
  __IO uint32_t PA_CONFIG;         /*!< (@ 0x00000028) PA_CONFIG register                */
  __IO uint32_t IF_CTRL;           /*!< (@ 0x0000002C) IF_CTRL register                  */
  __IO uint32_t AS_QI_CTRL;        /*!< (@ 0x00000030) AS_QI_CTRL register               */
  __IO uint32_t IQC_CONFIG;        /*!< (@ 0x00000034) IQC_CONFIG register               */
  __IO uint32_t DSSS_CTRL;         /*!< (@ 0x00000038) DSSS_CTRL register                */
} MR_SUBG_GLOB_STATIC_TypeDef;                      /*!< Size = 60 (0x3C) */


/* =========================================================================================================================== */
/* ================                                   MR_SUBG_GLOB_DYNAMIC                                    ================ */
/* =========================================================================================================================== */


/**
  * @brief MR_SUBG Global Dynamic
  */

