embetech-official/embenet-demo-nucleo-wl33cc1/Drivers/CMSIS/Device/ST/STM32WL3X/Include/stm32wl33.h
/* =====================================================    IO_IBER    =====================================================*/ 
#define SYSCFG_IO_IBER_PB15_IBE_Pos                                        (31UL)		/*!<SYSCFG IO_IBER: PB15_IBE (Bit 31) */
#define SYSCFG_IO_IBER_PB15_IBE_Msk                                        (0x80000000UL)		/*!< SYSCFG IO_IBER: PB15_IBE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IBER_PB15_IBE                                            SYSCFG_IO_IBER_PB15_IBE_Msk
#define SYSCFG_IO_IBER_PB14_IBE_Pos                                        (30UL)		/*!<SYSCFG IO_IBER: PB14_IBE (Bit 30) */
#define SYSCFG_IO_IBER_PB14_IBE_Msk                                        (0x40000000UL)		/*!< SYSCFG IO_IBER: PB14_IBE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IBER_PB14_IBE                                            SYSCFG_IO_IBER_PB14_IBE_Msk
#define SYSCFG_IO_IBER_PB13_IBE_Pos                                        (29UL)		/*!<SYSCFG IO_IBER: PB13_IBE (Bit 29) */
#define SYSCFG_IO_IBER_PB13_IBE_Msk                                        (0x20000000UL)		/*!< SYSCFG IO_IBER: PB13_IBE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IBER_PB13_IBE                                            SYSCFG_IO_IBER_PB13_IBE_Msk
#define SYSCFG_IO_IBER_PB12_IBE_Pos                                        (28UL)		/*!<SYSCFG IO_IBER: PB12_IBE (Bit 28) */
#define SYSCFG_IO_IBER_PB12_IBE_Msk                                        (0x10000000UL)		/*!< SYSCFG IO_IBER: PB12_IBE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IBER_PB12_IBE                                            SYSCFG_IO_IBER_PB12_IBE_Msk
#define SYSCFG_IO_IBER_PB11_IBE_Pos                                        (27UL)		/*!<SYSCFG IO_IBER: PB11_IBE (Bit 27) */
#define SYSCFG_IO_IBER_PB11_IBE_Msk                                        (0x8000000UL)		/*!< SYSCFG IO_IBER: PB11_IBE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IBER_PB11_IBE                                            SYSCFG_IO_IBER_PB11_IBE_Msk
#define SYSCFG_IO_IBER_PB10_IBE_Pos                                        (26UL)		/*!<SYSCFG IO_IBER: PB10_IBE (Bit 26) */
#define SYSCFG_IO_IBER_PB10_IBE_Msk                                        (0x4000000UL)		/*!< SYSCFG IO_IBER: PB10_IBE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IBER_PB10_IBE                                            SYSCFG_IO_IBER_PB10_IBE_Msk
#define SYSCFG_IO_IBER_PB9_IBE_Pos                                         (25UL)		/*!<SYSCFG IO_IBER: PB9_IBE (Bit 25) */
#define SYSCFG_IO_IBER_PB9_IBE_Msk                                         (0x2000000UL)		/*!< SYSCFG IO_IBER: PB9_IBE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IBER_PB9_IBE                                             SYSCFG_IO_IBER_PB9_IBE_Msk
#define SYSCFG_IO_IBER_PB8_IBE_Pos                                         (24UL)		/*!<SYSCFG IO_IBER: PB8_IBE (Bit 24) */
#define SYSCFG_IO_IBER_PB8_IBE_Msk                                         (0x1000000UL)		/*!< SYSCFG IO_IBER: PB8_IBE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IBER_PB8_IBE                                             SYSCFG_IO_IBER_PB8_IBE_Msk
#define SYSCFG_IO_IBER_PB7_IBE_Pos                                         (23UL)		/*!<SYSCFG IO_IBER: PB7_IBE (Bit 23) */
#define SYSCFG_IO_IBER_PB7_IBE_Msk                                         (0x800000UL)		/*!< SYSCFG IO_IBER: PB7_IBE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IBER_PB7_IBE                                             SYSCFG_IO_IBER_PB7_IBE_Msk
#define SYSCFG_IO_IBER_PB6_IBE_Pos                                         (22UL)		/*!<SYSCFG IO_IBER: PB6_IBE (Bit 22) */
#define SYSCFG_IO_IBER_PB6_IBE_Msk                                         (0x400000UL)		/*!< SYSCFG IO_IBER: PB6_IBE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IBER_PB6_IBE                                             SYSCFG_IO_IBER_PB6_IBE_Msk
#define SYSCFG_IO_IBER_PB5_IBE_Pos                                         (21UL)		/*!<SYSCFG IO_IBER: PB5_IBE (Bit 21) */
#define SYSCFG_IO_IBER_PB5_IBE_Msk                                         (0x200000UL)		/*!< SYSCFG IO_IBER: PB5_IBE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IBER_PB5_IBE                                             SYSCFG_IO_IBER_PB5_IBE_Msk
#define SYSCFG_IO_IBER_PB4_IBE_Pos                                         (20UL)		/*!<SYSCFG IO_IBER: PB4_IBE (Bit 20) */
#define SYSCFG_IO_IBER_PB4_IBE_Msk                                         (0x100000UL)		/*!< SYSCFG IO_IBER: PB4_IBE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IBER_PB4_IBE                                             SYSCFG_IO_IBER_PB4_IBE_Msk
#define SYSCFG_IO_IBER_PB3_IBE_Pos                                         (19UL)		/*!<SYSCFG IO_IBER: PB3_IBE (Bit 19) */
#define SYSCFG_IO_IBER_PB3_IBE_Msk                                         (0x80000UL)		/*!< SYSCFG IO_IBER: PB3_IBE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IBER_PB3_IBE                                             SYSCFG_IO_IBER_PB3_IBE_Msk
#define SYSCFG_IO_IBER_PB2_IBE_Pos                                         (18UL)		/*!<SYSCFG IO_IBER: PB2_IBE (Bit 18) */
#define SYSCFG_IO_IBER_PB2_IBE_Msk                                         (0x40000UL)		/*!< SYSCFG IO_IBER: PB2_IBE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IBER_PB2_IBE                                             SYSCFG_IO_IBER_PB2_IBE_Msk
#define SYSCFG_IO_IBER_PB1_IBE_Pos                                         (17UL)		/*!<SYSCFG IO_IBER: PB1_IBE (Bit 17) */
#define SYSCFG_IO_IBER_PB1_IBE_Msk                                         (0x20000UL)		/*!< SYSCFG IO_IBER: PB1_IBE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IBER_PB1_IBE                                             SYSCFG_IO_IBER_PB1_IBE_Msk
#define SYSCFG_IO_IBER_PB0_IBE_Pos                                         (16UL)		/*!<SYSCFG IO_IBER: PB0_IBE (Bit 16) */
#define SYSCFG_IO_IBER_PB0_IBE_Msk                                         (0x10000UL)		/*!< SYSCFG IO_IBER: PB0_IBE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IBER_PB0_IBE                                             SYSCFG_IO_IBER_PB0_IBE_Msk
#define SYSCFG_IO_IBER_PA15_IBE_Pos                                        (15UL)		/*!<SYSCFG IO_IBER: PA15_IBE (Bit 15) */
#define SYSCFG_IO_IBER_PA15_IBE_Msk                                        (0x8000UL)		/*!< SYSCFG IO_IBER: PA15_IBE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IBER_PA15_IBE                                            SYSCFG_IO_IBER_PA15_IBE_Msk
#define SYSCFG_IO_IBER_PA14_IBE_Pos                                        (14UL)		/*!<SYSCFG IO_IBER: PA14_IBE (Bit 14) */
#define SYSCFG_IO_IBER_PA14_IBE_Msk                                        (0x4000UL)		/*!< SYSCFG IO_IBER: PA14_IBE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IBER_PA14_IBE                                            SYSCFG_IO_IBER_PA14_IBE_Msk
#define SYSCFG_IO_IBER_PA13_IBE_Pos                                        (13UL)		/*!<SYSCFG IO_IBER: PA13_IBE (Bit 13) */
#define SYSCFG_IO_IBER_PA13_IBE_Msk                                        (0x2000UL)		/*!< SYSCFG IO_IBER: PA13_IBE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IBER_PA13_IBE                                            SYSCFG_IO_IBER_PA13_IBE_Msk
#define SYSCFG_IO_IBER_PA12_IBE_Pos                                        (12UL)		/*!<SYSCFG IO_IBER: PA12_IBE (Bit 12) */
#define SYSCFG_IO_IBER_PA12_IBE_Msk                                        (0x1000UL)		/*!< SYSCFG IO_IBER: PA12_IBE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IBER_PA12_IBE                                            SYSCFG_IO_IBER_PA12_IBE_Msk
#define SYSCFG_IO_IBER_PA11_IBE_Pos                                        (11UL)		/*!<SYSCFG IO_IBER: PA11_IBE (Bit 11) */
#define SYSCFG_IO_IBER_PA11_IBE_Msk                                        (0x800UL)		/*!< SYSCFG IO_IBER: PA11_IBE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IBER_PA11_IBE                                            SYSCFG_IO_IBER_PA11_IBE_Msk
#define SYSCFG_IO_IBER_PA10_IBE_Pos                                        (10UL)		/*!<SYSCFG IO_IBER: PA10_IBE (Bit 10) */
#define SYSCFG_IO_IBER_PA10_IBE_Msk                                        (0x400UL)		/*!< SYSCFG IO_IBER: PA10_IBE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IBER_PA10_IBE                                            SYSCFG_IO_IBER_PA10_IBE_Msk
#define SYSCFG_IO_IBER_PA9_IBE_Pos                                         (9UL)		/*!<SYSCFG IO_IBER: PA9_IBE (Bit 9) */
#define SYSCFG_IO_IBER_PA9_IBE_Msk                                         (0x200UL)		/*!< SYSCFG IO_IBER: PA9_IBE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IBER_PA9_IBE                                             SYSCFG_IO_IBER_PA9_IBE_Msk
#define SYSCFG_IO_IBER_PA8_IBE_Pos                                         (8UL)		/*!<SYSCFG IO_IBER: PA8_IBE (Bit 8) */
#define SYSCFG_IO_IBER_PA8_IBE_Msk                                         (0x100UL)		/*!< SYSCFG IO_IBER: PA8_IBE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IBER_PA8_IBE                                             SYSCFG_IO_IBER_PA8_IBE_Msk
#define SYSCFG_IO_IBER_PA7_IBE_Pos                                         (7UL)		/*!<SYSCFG IO_IBER: PA7_IBE (Bit 7) */
#define SYSCFG_IO_IBER_PA7_IBE_Msk                                         (0x80UL)		/*!< SYSCFG IO_IBER: PA7_IBE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IBER_PA7_IBE                                             SYSCFG_IO_IBER_PA7_IBE_Msk
#define SYSCFG_IO_IBER_PA6_IBE_Pos                                         (6UL)		/*!<SYSCFG IO_IBER: PA6_IBE (Bit 6) */
#define SYSCFG_IO_IBER_PA6_IBE_Msk                                         (0x40UL)		/*!< SYSCFG IO_IBER: PA6_IBE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IBER_PA6_IBE                                             SYSCFG_IO_IBER_PA6_IBE_Msk
#define SYSCFG_IO_IBER_PA5_IBE_Pos                                         (5UL)		/*!<SYSCFG IO_IBER: PA5_IBE (Bit 5) */
#define SYSCFG_IO_IBER_PA5_IBE_Msk                                         (0x20UL)		/*!< SYSCFG IO_IBER: PA5_IBE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IBER_PA5_IBE                                             SYSCFG_IO_IBER_PA5_IBE_Msk
#define SYSCFG_IO_IBER_PA4_IBE_Pos                                         (4UL)		/*!<SYSCFG IO_IBER: PA4_IBE (Bit 4) */
#define SYSCFG_IO_IBER_PA4_IBE_Msk                                         (0x10UL)		/*!< SYSCFG IO_IBER: PA4_IBE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IBER_PA4_IBE                                             SYSCFG_IO_IBER_PA4_IBE_Msk
#define SYSCFG_IO_IBER_PA3_IBE_Pos                                         (3UL)		/*!<SYSCFG IO_IBER: PA3_IBE (Bit 3) */
#define SYSCFG_IO_IBER_PA3_IBE_Msk                                         (0x8UL)		/*!< SYSCFG IO_IBER: PA3_IBE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IBER_PA3_IBE                                             SYSCFG_IO_IBER_PA3_IBE_Msk
#define SYSCFG_IO_IBER_PA2_IBE_Pos                                         (2UL)		/*!<SYSCFG IO_IBER: PA2_IBE (Bit 2) */
#define SYSCFG_IO_IBER_PA2_IBE_Msk                                         (0x4UL)		/*!< SYSCFG IO_IBER: PA2_IBE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IBER_PA2_IBE                                             SYSCFG_IO_IBER_PA2_IBE_Msk
#define SYSCFG_IO_IBER_PA1_IBE_Pos                                         (1UL)		/*!<SYSCFG IO_IBER: PA1_IBE (Bit 1) */
#define SYSCFG_IO_IBER_PA1_IBE_Msk                                         (0x2UL)		/*!< SYSCFG IO_IBER: PA1_IBE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IBER_PA1_IBE                                             SYSCFG_IO_IBER_PA1_IBE_Msk
#define SYSCFG_IO_IBER_PA0_IBE_Pos                                         (0UL)		/*!<SYSCFG IO_IBER: PA0_IBE (Bit 0) */
#define SYSCFG_IO_IBER_PA0_IBE_Msk                                         (0x1UL)		/*!< SYSCFG IO_IBER: PA0_IBE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IBER_PA0_IBE                                             SYSCFG_IO_IBER_PA0_IBE_Msk

/* =====================================================    IO_IEVR    =====================================================*/ 
#define SYSCFG_IO_IEVR_PB15_IEV_Pos                                        (31UL)		/*!<SYSCFG IO_IEVR: PB15_IEV (Bit 31) */
#define SYSCFG_IO_IEVR_PB15_IEV_Msk                                        (0x80000000UL)		/*!< SYSCFG IO_IEVR: PB15_IEV (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IEVR_PB15_IEV                                            SYSCFG_IO_IEVR_PB15_IEV_Msk
#define SYSCFG_IO_IEVR_PB14_IEV_Pos                                        (30UL)		/*!<SYSCFG IO_IEVR: PB14_IEV (Bit 30) */
#define SYSCFG_IO_IEVR_PB14_IEV_Msk                                        (0x40000000UL)		/*!< SYSCFG IO_IEVR: PB14_IEV (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IEVR_PB14_IEV                                            SYSCFG_IO_IEVR_PB14_IEV_Msk
#define SYSCFG_IO_IEVR_PB13_IEV_Pos                                        (29UL)		/*!<SYSCFG IO_IEVR: PB13_IEV (Bit 29) */
#define SYSCFG_IO_IEVR_PB13_IEV_Msk                                        (0x20000000UL)		/*!< SYSCFG IO_IEVR: PB13_IEV (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IEVR_PB13_IEV                                            SYSCFG_IO_IEVR_PB13_IEV_Msk
#define SYSCFG_IO_IEVR_PB12_IEV_Pos                                        (28UL)		/*!<SYSCFG IO_IEVR: PB12_IEV (Bit 28) */
#define SYSCFG_IO_IEVR_PB12_IEV_Msk                                        (0x10000000UL)		/*!< SYSCFG IO_IEVR: PB12_IEV (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IEVR_PB12_IEV                                            SYSCFG_IO_IEVR_PB12_IEV_Msk
#define SYSCFG_IO_IEVR_PB11_IEV_Pos                                        (27UL)		/*!<SYSCFG IO_IEVR: PB11_IEV (Bit 27) */
#define SYSCFG_IO_IEVR_PB11_IEV_Msk                                        (0x8000000UL)		/*!< SYSCFG IO_IEVR: PB11_IEV (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IEVR_PB11_IEV                                            SYSCFG_IO_IEVR_PB11_IEV_Msk
#define SYSCFG_IO_IEVR_PB10_IEV_Pos                                        (26UL)		/*!<SYSCFG IO_IEVR: PB10_IEV (Bit 26) */
#define SYSCFG_IO_IEVR_PB10_IEV_Msk                                        (0x4000000UL)		/*!< SYSCFG IO_IEVR: PB10_IEV (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IEVR_PB10_IEV                                            SYSCFG_IO_IEVR_PB10_IEV_Msk
#define SYSCFG_IO_IEVR_PB9_IEV_Pos                                         (25UL)		/*!<SYSCFG IO_IEVR: PB9_IEV (Bit 25) */
#define SYSCFG_IO_IEVR_PB9_IEV_Msk                                         (0x2000000UL)		/*!< SYSCFG IO_IEVR: PB9_IEV (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IEVR_PB9_IEV                                             SYSCFG_IO_IEVR_PB9_IEV_Msk
#define SYSCFG_IO_IEVR_PB8_IEV_Pos                                         (24UL)		/*!<SYSCFG IO_IEVR: PB8_IEV (Bit 24) */
#define SYSCFG_IO_IEVR_PB8_IEV_Msk                                         (0x1000000UL)		/*!< SYSCFG IO_IEVR: PB8_IEV (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IEVR_PB8_IEV                                             SYSCFG_IO_IEVR_PB8_IEV_Msk
#define SYSCFG_IO_IEVR_PB7_IEV_Pos                                         (23UL)		/*!<SYSCFG IO_IEVR: PB7_IEV (Bit 23) */
#define SYSCFG_IO_IEVR_PB7_IEV_Msk                                         (0x800000UL)		/*!< SYSCFG IO_IEVR: PB7_IEV (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IEVR_PB7_IEV                                             SYSCFG_IO_IEVR_PB7_IEV_Msk
#define SYSCFG_IO_IEVR_PB6_IEV_Pos                                         (22UL)		/*!<SYSCFG IO_IEVR: PB6_IEV (Bit 22) */
#define SYSCFG_IO_IEVR_PB6_IEV_Msk                                         (0x400000UL)		/*!< SYSCFG IO_IEVR: PB6_IEV (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IEVR_PB6_IEV                                             SYSCFG_IO_IEVR_PB6_IEV_Msk
#define SYSCFG_IO_IEVR_PB5_IEV_Pos                                         (21UL)		/*!<SYSCFG IO_IEVR: PB5_IEV (Bit 21) */
#define SYSCFG_IO_IEVR_PB5_IEV_Msk                                         (0x200000UL)		/*!< SYSCFG IO_IEVR: PB5_IEV (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IEVR_PB5_IEV                                             SYSCFG_IO_IEVR_PB5_IEV_Msk
#define SYSCFG_IO_IEVR_PB4_IEV_Pos                                         (20UL)		/*!<SYSCFG IO_IEVR: PB4_IEV (Bit 20) */
#define SYSCFG_IO_IEVR_PB4_IEV_Msk                                         (0x100000UL)		/*!< SYSCFG IO_IEVR: PB4_IEV (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IEVR_PB4_IEV                                             SYSCFG_IO_IEVR_PB4_IEV_Msk
#define SYSCFG_IO_IEVR_PB3_IEV_Pos                                         (19UL)		/*!<SYSCFG IO_IEVR: PB3_IEV (Bit 19) */
#define SYSCFG_IO_IEVR_PB3_IEV_Msk                                         (0x80000UL)		/*!< SYSCFG IO_IEVR: PB3_IEV (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IEVR_PB3_IEV                                             SYSCFG_IO_IEVR_PB3_IEV_Msk
#define SYSCFG_IO_IEVR_PB2_IEV_Pos                                         (18UL)		/*!<SYSCFG IO_IEVR: PB2_IEV (Bit 18) */
#define SYSCFG_IO_IEVR_PB2_IEV_Msk                                         (0x40000UL)		/*!< SYSCFG IO_IEVR: PB2_IEV (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IEVR_PB2_IEV                                             SYSCFG_IO_IEVR_PB2_IEV_Msk
#define SYSCFG_IO_IEVR_PB1_IEV_Pos                                         (17UL)		/*!<SYSCFG IO_IEVR: PB1_IEV (Bit 17) */
#define SYSCFG_IO_IEVR_PB1_IEV_Msk                                         (0x20000UL)		/*!< SYSCFG IO_IEVR: PB1_IEV (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IEVR_PB1_IEV                                             SYSCFG_IO_IEVR_PB1_IEV_Msk
#define SYSCFG_IO_IEVR_PB0_IEV_Pos                                         (16UL)		/*!<SYSCFG IO_IEVR: PB0_IEV (Bit 16) */
#define SYSCFG_IO_IEVR_PB0_IEV_Msk                                         (0x10000UL)		/*!< SYSCFG IO_IEVR: PB0_IEV (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IEVR_PB0_IEV                                             SYSCFG_IO_IEVR_PB0_IEV_Msk
#define SYSCFG_IO_IEVR_PA15_IEV_Pos                                        (15UL)		/*!<SYSCFG IO_IEVR: PA15_IEV (Bit 15) */
#define SYSCFG_IO_IEVR_PA15_IEV_Msk                                        (0x8000UL)		/*!< SYSCFG IO_IEVR: PA15_IEV (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IEVR_PA15_IEV                                            SYSCFG_IO_IEVR_PA15_IEV_Msk
#define SYSCFG_IO_IEVR_PA14_IEV_Pos                                        (14UL)		/*!<SYSCFG IO_IEVR: PA14_IEV (Bit 14) */
#define SYSCFG_IO_IEVR_PA14_IEV_Msk                                        (0x4000UL)		/*!< SYSCFG IO_IEVR: PA14_IEV (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IEVR_PA14_IEV                                            SYSCFG_IO_IEVR_PA14_IEV_Msk
#define SYSCFG_IO_IEVR_PA13_IEV_Pos                                        (13UL)		/*!<SYSCFG IO_IEVR: PA13_IEV (Bit 13) */
#define SYSCFG_IO_IEVR_PA13_IEV_Msk                                        (0x2000UL)		/*!< SYSCFG IO_IEVR: PA13_IEV (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IEVR_PA13_IEV                                            SYSCFG_IO_IEVR_PA13_IEV_Msk
#define SYSCFG_IO_IEVR_PA12_IEV_Pos                                        (12UL)		/*!<SYSCFG IO_IEVR: PA12_IEV (Bit 12) */
#define SYSCFG_IO_IEVR_PA12_IEV_Msk                                        (0x1000UL)		/*!< SYSCFG IO_IEVR: PA12_IEV (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IEVR_PA12_IEV                                            SYSCFG_IO_IEVR_PA12_IEV_Msk
#define SYSCFG_IO_IEVR_PA11_IEV_Pos                                        (11UL)		/*!<SYSCFG IO_IEVR: PA11_IEV (Bit 11) */
#define SYSCFG_IO_IEVR_PA11_IEV_Msk                                        (0x800UL)		/*!< SYSCFG IO_IEVR: PA11_IEV (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IEVR_PA11_IEV                                            SYSCFG_IO_IEVR_PA11_IEV_Msk
#define SYSCFG_IO_IEVR_PA10_IEV_Pos                                        (10UL)		/*!<SYSCFG IO_IEVR: PA10_IEV (Bit 10) */
#define SYSCFG_IO_IEVR_PA10_IEV_Msk                                        (0x400UL)		/*!< SYSCFG IO_IEVR: PA10_IEV (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IEVR_PA10_IEV                                            SYSCFG_IO_IEVR_PA10_IEV_Msk
#define SYSCFG_IO_IEVR_PA9_IEV_Pos                                         (9UL)		/*!<SYSCFG IO_IEVR: PA9_IEV (Bit 9) */
#define SYSCFG_IO_IEVR_PA9_IEV_Msk                                         (0x200UL)		/*!< SYSCFG IO_IEVR: PA9_IEV (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IEVR_PA9_IEV                                             SYSCFG_IO_IEVR_PA9_IEV_Msk
#define SYSCFG_IO_IEVR_PA8_IEV_Pos                                         (8UL)		/*!<SYSCFG IO_IEVR: PA8_IEV (Bit 8) */
#define SYSCFG_IO_IEVR_PA8_IEV_Msk                                         (0x100UL)		/*!< SYSCFG IO_IEVR: PA8_IEV (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IEVR_PA8_IEV                                             SYSCFG_IO_IEVR_PA8_IEV_Msk
#define SYSCFG_IO_IEVR_PA7_IEV_Pos                                         (7UL)		/*!<SYSCFG IO_IEVR: PA7_IEV (Bit 7) */
#define SYSCFG_IO_IEVR_PA7_IEV_Msk                                         (0x80UL)		/*!< SYSCFG IO_IEVR: PA7_IEV (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IEVR_PA7_IEV                                             SYSCFG_IO_IEVR_PA7_IEV_Msk
#define SYSCFG_IO_IEVR_PA6_IEV_Pos                                         (6UL)		/*!<SYSCFG IO_IEVR: PA6_IEV (Bit 6) */
#define SYSCFG_IO_IEVR_PA6_IEV_Msk                                         (0x40UL)		/*!< SYSCFG IO_IEVR: PA6_IEV (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IEVR_PA6_IEV                                             SYSCFG_IO_IEVR_PA6_IEV_Msk
#define SYSCFG_IO_IEVR_PA5_IEV_Pos                                         (5UL)		/*!<SYSCFG IO_IEVR: PA5_IEV (Bit 5) */
#define SYSCFG_IO_IEVR_PA5_IEV_Msk                                         (0x20UL)		/*!< SYSCFG IO_IEVR: PA5_IEV (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IEVR_PA5_IEV                                             SYSCFG_IO_IEVR_PA5_IEV_Msk
#define SYSCFG_IO_IEVR_PA4_IEV_Pos                                         (4UL)		/*!<SYSCFG IO_IEVR: PA4_IEV (Bit 4) */
#define SYSCFG_IO_IEVR_PA4_IEV_Msk                                         (0x10UL)		/*!< SYSCFG IO_IEVR: PA4_IEV (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IEVR_PA4_IEV                                             SYSCFG_IO_IEVR_PA4_IEV_Msk
#define SYSCFG_IO_IEVR_PA3_IEV_Pos                                         (3UL)		/*!<SYSCFG IO_IEVR: PA3_IEV (Bit 3) */
#define SYSCFG_IO_IEVR_PA3_IEV_Msk                                         (0x8UL)		/*!< SYSCFG IO_IEVR: PA3_IEV (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IEVR_PA3_IEV                                             SYSCFG_IO_IEVR_PA3_IEV_Msk
#define SYSCFG_IO_IEVR_PA2_IEV_Pos                                         (2UL)		/*!<SYSCFG IO_IEVR: PA2_IEV (Bit 2) */
#define SYSCFG_IO_IEVR_PA2_IEV_Msk                                         (0x4UL)		/*!< SYSCFG IO_IEVR: PA2_IEV (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IEVR_PA2_IEV                                             SYSCFG_IO_IEVR_PA2_IEV_Msk
#define SYSCFG_IO_IEVR_PA1_IEV_Pos                                         (1UL)		/*!<SYSCFG IO_IEVR: PA1_IEV (Bit 1) */
#define SYSCFG_IO_IEVR_PA1_IEV_Msk                                         (0x2UL)		/*!< SYSCFG IO_IEVR: PA1_IEV (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IEVR_PA1_IEV                                             SYSCFG_IO_IEVR_PA1_IEV_Msk
#define SYSCFG_IO_IEVR_PA0_IEV_Pos                                         (0UL)		/*!<SYSCFG IO_IEVR: PA0_IEV (Bit 0) */
#define SYSCFG_IO_IEVR_PA0_IEV_Msk                                         (0x1UL)		/*!< SYSCFG IO_IEVR: PA0_IEV (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IEVR_PA0_IEV                                             SYSCFG_IO_IEVR_PA0_IEV_Msk

