embetech-official/embenet-demo-nucleo-wl33cc1/Drivers/CMSIS/Device/ST/STM32WL3X/Include/stm32wl33.h
/* =====================================================    INTAI_IEVR    =====================================================*/ 
#define SYSCFG_INTAI_IEVR_LC_ACTIVITY_IEV_Pos                              (6UL)		/*!<SYSCFG INTAI_IEVR: LC_ACTIVITY_IEV (Bit 6) */
#define SYSCFG_INTAI_IEVR_LC_ACTIVITY_IEV_Msk                              (0x40UL)		/*!< SYSCFG INTAI_IEVR: LC_ACTIVITY_IEV (Bitfield-Mask: 0x01) */
#define SYSCFG_INTAI_IEVR_LC_ACTIVITY_IEV                                  SYSCFG_INTAI_IEVR_LC_ACTIVITY_IEV_Msk
#define SYSCFG_INTAI_IEVR_RFIP_BUSY_STATUS_IEV_Pos                         (5UL)		/*!<SYSCFG INTAI_IEVR: RFIP_BUSY_STATUS_IEV (Bit 5) */
#define SYSCFG_INTAI_IEVR_RFIP_BUSY_STATUS_IEV_Msk                         (0x20UL)		/*!< SYSCFG INTAI_IEVR: RFIP_BUSY_STATUS_IEV (Bitfield-Mask: 0x01) */
#define SYSCFG_INTAI_IEVR_RFIP_BUSY_STATUS_IEV                             SYSCFG_INTAI_IEVR_RFIP_BUSY_STATUS_IEV_Msk
#define SYSCFG_INTAI_IEVR_COMP_IEV_Pos                                     (4UL)		/*!<SYSCFG INTAI_IEVR: COMP_IEV (Bit 4) */
#define SYSCFG_INTAI_IEVR_COMP_IEV_Msk                                     (0x10UL)		/*!< SYSCFG INTAI_IEVR: COMP_IEV (Bitfield-Mask: 0x01) */
#define SYSCFG_INTAI_IEVR_COMP_IEV                                         SYSCFG_INTAI_IEVR_COMP_IEV_Msk
#define SYSCFG_INTAI_IEVR_RX_IEV_Pos                                       (1UL)		/*!<SYSCFG INTAI_IEVR: RX_IEV (Bit 1) */
#define SYSCFG_INTAI_IEVR_RX_IEV_Msk                                       (0x2UL)		/*!< SYSCFG INTAI_IEVR: RX_IEV (Bitfield-Mask: 0x01) */
#define SYSCFG_INTAI_IEVR_RX_IEV                                           SYSCFG_INTAI_IEVR_RX_IEV_Msk
#define SYSCFG_INTAI_IEVR_TX_IEV_Pos                                       (0UL)		/*!<SYSCFG INTAI_IEVR: TX_IEV (Bit 0) */
#define SYSCFG_INTAI_IEVR_TX_IEV_Msk                                       (0x1UL)		/*!< SYSCFG INTAI_IEVR: TX_IEV (Bitfield-Mask: 0x01) */
#define SYSCFG_INTAI_IEVR_TX_IEV                                           SYSCFG_INTAI_IEVR_TX_IEV_Msk

/* =====================================================    INTAI_IER    =====================================================*/ 
#define SYSCFG_INTAI_IER_LC_ACTIVITY_IE_Pos                                (6UL)		/*!<SYSCFG INTAI_IER: LC_ACTIVITY_IE (Bit 6) */
#define SYSCFG_INTAI_IER_LC_ACTIVITY_IE_Msk                                (0x40UL)		/*!< SYSCFG INTAI_IER: LC_ACTIVITY_IE (Bitfield-Mask: 0x01) */
#define SYSCFG_INTAI_IER_LC_ACTIVITY_IE                                    SYSCFG_INTAI_IER_LC_ACTIVITY_IE_Msk
#define SYSCFG_INTAI_IER_RFIP_BUSY_STATUS_IE_Pos                           (5UL)		/*!<SYSCFG INTAI_IER: RFIP_BUSY_STATUS_IE (Bit 5) */
#define SYSCFG_INTAI_IER_RFIP_BUSY_STATUS_IE_Msk                           (0x20UL)		/*!< SYSCFG INTAI_IER: RFIP_BUSY_STATUS_IE (Bitfield-Mask: 0x01) */
#define SYSCFG_INTAI_IER_RFIP_BUSY_STATUS_IE                               SYSCFG_INTAI_IER_RFIP_BUSY_STATUS_IE_Msk
#define SYSCFG_INTAI_IER_COMP_IE_Pos                                       (4UL)		/*!<SYSCFG INTAI_IER: COMP_IE (Bit 4) */
#define SYSCFG_INTAI_IER_COMP_IE_Msk                                       (0x10UL)		/*!< SYSCFG INTAI_IER: COMP_IE (Bitfield-Mask: 0x01) */
#define SYSCFG_INTAI_IER_COMP_IE                                           SYSCFG_INTAI_IER_COMP_IE_Msk
#define SYSCFG_INTAI_IER_RX_IE_Pos                                         (1UL)		/*!<SYSCFG INTAI_IER: RX_IE (Bit 1) */
#define SYSCFG_INTAI_IER_RX_IE_Msk                                         (0x2UL)		/*!< SYSCFG INTAI_IER: RX_IE (Bitfield-Mask: 0x01) */
#define SYSCFG_INTAI_IER_RX_IE                                             SYSCFG_INTAI_IER_RX_IE_Msk
#define SYSCFG_INTAI_IER_TX_IE_Pos                                         (0UL)		/*!<SYSCFG INTAI_IER: TX_IE (Bit 0) */
#define SYSCFG_INTAI_IER_TX_IE_Msk                                         (0x1UL)		/*!< SYSCFG INTAI_IER: TX_IE (Bitfield-Mask: 0x01) */
#define SYSCFG_INTAI_IER_TX_IE                                             SYSCFG_INTAI_IER_TX_IE_Msk

/* =====================================================    INTAI_ISCR    =====================================================*/ 
#define SYSCFG_INTAI_ISCR_LC_ACTIVITY_ISEDGE_Pos                           (7UL)		/*!<SYSCFG INTAI_ISCR: LC_ACTIVITY_ISEDGE (Bit 7) */
#define SYSCFG_INTAI_ISCR_LC_ACTIVITY_ISEDGE_Msk                           (0x80UL)		/*!< SYSCFG INTAI_ISCR: LC_ACTIVITY_ISEDGE (Bitfield-Mask: 0x01) */
#define SYSCFG_INTAI_ISCR_LC_ACTIVITY_ISEDGE                               SYSCFG_INTAI_ISCR_LC_ACTIVITY_ISEDGE_Msk
#define SYSCFG_INTAI_ISCR_LC_ACTIVITY_ISC_Pos                              (6UL)		/*!<SYSCFG INTAI_ISCR: LC_ACTIVITY_ISC (Bit 6) */
#define SYSCFG_INTAI_ISCR_LC_ACTIVITY_ISC_Msk                              (0x40UL)		/*!< SYSCFG INTAI_ISCR: LC_ACTIVITY_ISC (Bitfield-Mask: 0x01) */
#define SYSCFG_INTAI_ISCR_LC_ACTIVITY_ISC                                  SYSCFG_INTAI_ISCR_LC_ACTIVITY_ISC_Msk
#define SYSCFG_INTAI_ISCR_RFIP_BUSY_STATUS_ISC_Pos                         (5UL)		/*!<SYSCFG INTAI_ISCR: RFIP_BUSY_STATUS_ISC (Bit 5) */
#define SYSCFG_INTAI_ISCR_RFIP_BUSY_STATUS_ISC_Msk                         (0x20UL)		/*!< SYSCFG INTAI_ISCR: RFIP_BUSY_STATUS_ISC (Bitfield-Mask: 0x01) */
#define SYSCFG_INTAI_ISCR_RFIP_BUSY_STATUS_ISC                             SYSCFG_INTAI_ISCR_RFIP_BUSY_STATUS_ISC_Msk
#define SYSCFG_INTAI_ISCR_COMP_ISC_Pos                                     (4UL)		/*!<SYSCFG INTAI_ISCR: COMP_ISC (Bit 4) */
#define SYSCFG_INTAI_ISCR_COMP_ISC_Msk                                     (0x10UL)		/*!< SYSCFG INTAI_ISCR: COMP_ISC (Bitfield-Mask: 0x01) */
#define SYSCFG_INTAI_ISCR_COMP_ISC                                         SYSCFG_INTAI_ISCR_COMP_ISC_Msk
#define SYSCFG_INTAI_ISCR_RX_ISEDGE_Pos                                    (3UL)		/*!<SYSCFG INTAI_ISCR: RX_ISEDGE (Bit 3) */
#define SYSCFG_INTAI_ISCR_RX_ISEDGE_Msk                                    (0x8UL)		/*!< SYSCFG INTAI_ISCR: RX_ISEDGE (Bitfield-Mask: 0x01) */
#define SYSCFG_INTAI_ISCR_RX_ISEDGE                                        SYSCFG_INTAI_ISCR_RX_ISEDGE_Msk
#define SYSCFG_INTAI_ISCR_TX_ISEDGE_Pos                                    (2UL)		/*!<SYSCFG INTAI_ISCR: TX_ISEDGE (Bit 2) */
#define SYSCFG_INTAI_ISCR_TX_ISEDGE_Msk                                    (0x4UL)		/*!< SYSCFG INTAI_ISCR: TX_ISEDGE (Bitfield-Mask: 0x01) */
#define SYSCFG_INTAI_ISCR_TX_ISEDGE                                        SYSCFG_INTAI_ISCR_TX_ISEDGE_Msk
#define SYSCFG_INTAI_ISCR_RX_ISC_Pos                                       (1UL)		/*!<SYSCFG INTAI_ISCR: RX_ISC (Bit 1) */
#define SYSCFG_INTAI_ISCR_RX_ISC_Msk                                       (0x2UL)		/*!< SYSCFG INTAI_ISCR: RX_ISC (Bitfield-Mask: 0x01) */
#define SYSCFG_INTAI_ISCR_RX_ISC                                           SYSCFG_INTAI_ISCR_RX_ISC_Msk
#define SYSCFG_INTAI_ISCR_TX_ISC_Pos                                       (0UL)		/*!<SYSCFG INTAI_ISCR: TX_ISC (Bit 0) */
#define SYSCFG_INTAI_ISCR_TX_ISC_Msk                                       (0x1UL)		/*!< SYSCFG INTAI_ISCR: TX_ISC (Bitfield-Mask: 0x01) */
#define SYSCFG_INTAI_ISCR_TX_ISC                                           SYSCFG_INTAI_ISCR_TX_ISC_Msk

