embetech-official/embenet-demo-nucleo-wl33cc1/Drivers/CMSIS/Device/ST/STM32WL3X/Include/stm32wl33.h
/* ============================================================================================================================*/ 
/*=====================                                       IWDG                                       =====================*/ 
/* ============================================================================================================================*/ 

/* =====================================================    KR    =====================================================*/ 
#define IWDG_KR_KEY_Pos                                                    (0UL)		/*!<IWDG KR: KEY (Bit 0) */
#define IWDG_KR_KEY_Msk                                                    (0xffffUL)		/*!< IWDG KR: KEY (Bitfield-Mask: 0xffff) */
#define IWDG_KR_KEY                                                        IWDG_KR_KEY_Msk
#define IWDG_KR_KEY_0                                                      (0x1U << IWDG_KR_KEY_Pos)
#define IWDG_KR_KEY_1                                                      (0x2U << IWDG_KR_KEY_Pos)
#define IWDG_KR_KEY_2                                                      (0x4U << IWDG_KR_KEY_Pos)
#define IWDG_KR_KEY_3                                                      (0x8U << IWDG_KR_KEY_Pos)
#define IWDG_KR_KEY_4                                                      (0x10U << IWDG_KR_KEY_Pos)
#define IWDG_KR_KEY_5                                                      (0x20U << IWDG_KR_KEY_Pos)
#define IWDG_KR_KEY_6                                                      (0x40U << IWDG_KR_KEY_Pos)
#define IWDG_KR_KEY_7                                                      (0x80U << IWDG_KR_KEY_Pos)
#define IWDG_KR_KEY_8                                                      (0x100U << IWDG_KR_KEY_Pos)
#define IWDG_KR_KEY_9                                                      (0x200U << IWDG_KR_KEY_Pos)
#define IWDG_KR_KEY_10                                                     (0x400U << IWDG_KR_KEY_Pos)
#define IWDG_KR_KEY_11                                                     (0x800U << IWDG_KR_KEY_Pos)
#define IWDG_KR_KEY_12                                                     (0x1000U << IWDG_KR_KEY_Pos)
#define IWDG_KR_KEY_13                                                     (0x2000U << IWDG_KR_KEY_Pos)
#define IWDG_KR_KEY_14                                                     (0x4000U << IWDG_KR_KEY_Pos)
#define IWDG_KR_KEY_15                                                     (0x8000U << IWDG_KR_KEY_Pos)

/* =====================================================    PR    =====================================================*/ 
#define IWDG_PR_PR_Pos                                                     (0UL)		/*!<IWDG PR: PR (Bit 0) */
#define IWDG_PR_PR_Msk                                                     (0x7UL)		/*!< IWDG PR: PR (Bitfield-Mask: 0x07) */
#define IWDG_PR_PR                                                         IWDG_PR_PR_Msk
#define IWDG_PR_PR_0                                                       (0x1U << IWDG_PR_PR_Pos)
#define IWDG_PR_PR_1                                                       (0x2U << IWDG_PR_PR_Pos)
#define IWDG_PR_PR_2                                                       (0x4U << IWDG_PR_PR_Pos)

/* =====================================================    RLR    =====================================================*/ 
#define IWDG_RLR_RL_Pos                                                    (0UL)		/*!<IWDG RLR: RL (Bit 0) */
#define IWDG_RLR_RL_Msk                                                    (0xfffUL)		/*!< IWDG RLR: RL (Bitfield-Mask: 0xfff) */
#define IWDG_RLR_RL                                                        IWDG_RLR_RL_Msk
#define IWDG_RLR_RL_0                                                      (0x1U << IWDG_RLR_RL_Pos)
#define IWDG_RLR_RL_1                                                      (0x2U << IWDG_RLR_RL_Pos)
#define IWDG_RLR_RL_2                                                      (0x4U << IWDG_RLR_RL_Pos)
#define IWDG_RLR_RL_3                                                      (0x8U << IWDG_RLR_RL_Pos)
#define IWDG_RLR_RL_4                                                      (0x10U << IWDG_RLR_RL_Pos)
#define IWDG_RLR_RL_5                                                      (0x20U << IWDG_RLR_RL_Pos)
#define IWDG_RLR_RL_6                                                      (0x40U << IWDG_RLR_RL_Pos)
#define IWDG_RLR_RL_7                                                      (0x80U << IWDG_RLR_RL_Pos)
#define IWDG_RLR_RL_8                                                      (0x100U << IWDG_RLR_RL_Pos)
#define IWDG_RLR_RL_9                                                      (0x200U << IWDG_RLR_RL_Pos)
#define IWDG_RLR_RL_10                                                     (0x400U << IWDG_RLR_RL_Pos)
#define IWDG_RLR_RL_11                                                     (0x800U << IWDG_RLR_RL_Pos)

/* =====================================================    SR    =====================================================*/ 
#define IWDG_SR_WVU_Pos                                                    (2UL)		/*!<IWDG SR: WVU (Bit 2) */
#define IWDG_SR_WVU_Msk                                                    (0x4UL)		/*!< IWDG SR: WVU (Bitfield-Mask: 0x01) */
#define IWDG_SR_WVU                                                        IWDG_SR_WVU_Msk
#define IWDG_SR_RVU_Pos                                                    (1UL)		/*!<IWDG SR: RVU (Bit 1) */
#define IWDG_SR_RVU_Msk                                                    (0x2UL)		/*!< IWDG SR: RVU (Bitfield-Mask: 0x01) */
#define IWDG_SR_RVU                                                        IWDG_SR_RVU_Msk
#define IWDG_SR_PVU_Pos                                                    (0UL)		/*!<IWDG SR: PVU (Bit 0) */
#define IWDG_SR_PVU_Msk                                                    (0x1UL)		/*!< IWDG SR: PVU (Bitfield-Mask: 0x01) */
#define IWDG_SR_PVU                                                        IWDG_SR_PVU_Msk

/* =====================================================    WINR    =====================================================*/ 
#define IWDG_WINR_WIN_Pos                                                  (0UL)		/*!<IWDG WINR: WIN (Bit 0) */
#define IWDG_WINR_WIN_Msk                                                  (0xfffUL)		/*!< IWDG WINR: WIN (Bitfield-Mask: 0xfff) */
#define IWDG_WINR_WIN                                                      IWDG_WINR_WIN_Msk
#define IWDG_WINR_WIN_0                                                    (0x1U << IWDG_WINR_WIN_Pos)
#define IWDG_WINR_WIN_1                                                    (0x2U << IWDG_WINR_WIN_Pos)
#define IWDG_WINR_WIN_2                                                    (0x4U << IWDG_WINR_WIN_Pos)
#define IWDG_WINR_WIN_3                                                    (0x8U << IWDG_WINR_WIN_Pos)
#define IWDG_WINR_WIN_4                                                    (0x10U << IWDG_WINR_WIN_Pos)
#define IWDG_WINR_WIN_5                                                    (0x20U << IWDG_WINR_WIN_Pos)
#define IWDG_WINR_WIN_6                                                    (0x40U << IWDG_WINR_WIN_Pos)
#define IWDG_WINR_WIN_7                                                    (0x80U << IWDG_WINR_WIN_Pos)
#define IWDG_WINR_WIN_8                                                    (0x100U << IWDG_WINR_WIN_Pos)
#define IWDG_WINR_WIN_9                                                    (0x200U << IWDG_WINR_WIN_Pos)
#define IWDG_WINR_WIN_10                                                   (0x400U << IWDG_WINR_WIN_Pos)
#define IWDG_WINR_WIN_11                                                   (0x800U << IWDG_WINR_WIN_Pos)


