embetech-official/embenet-demo-nucleo-wl33cc1/Drivers/CMSIS/Device/ST/STM32WL3X/Include/stm32wl33.h
/* =====================================================    RAM_COM3    =====================================================*/ 
#define LCD_RAM_COM3_SEGMENT_DATA_Pos                                      (0UL)		/*!<LCD RAM_COM3: SEGMENT_DATA (Bit 0) */
#define LCD_RAM_COM3_SEGMENT_DATA_Msk                                      (0xffffUL)		/*!< LCD RAM_COM3: SEGMENT_DATA (Bitfield-Mask: 0xffff) */
#define LCD_RAM_COM3_SEGMENT_DATA                                          LCD_RAM_COM3_SEGMENT_DATA_Msk
#define LCD_RAM_COM3_SEGMENT_DATA_0                                        (0x1U << LCD_RAM_COM3_SEGMENT_DATA_Pos)
#define LCD_RAM_COM3_SEGMENT_DATA_1                                        (0x2U << LCD_RAM_COM3_SEGMENT_DATA_Pos)
#define LCD_RAM_COM3_SEGMENT_DATA_2                                        (0x4U << LCD_RAM_COM3_SEGMENT_DATA_Pos)
#define LCD_RAM_COM3_SEGMENT_DATA_3                                        (0x8U << LCD_RAM_COM3_SEGMENT_DATA_Pos)
#define LCD_RAM_COM3_SEGMENT_DATA_4                                        (0x10U << LCD_RAM_COM3_SEGMENT_DATA_Pos)
#define LCD_RAM_COM3_SEGMENT_DATA_5                                        (0x20U << LCD_RAM_COM3_SEGMENT_DATA_Pos)
#define LCD_RAM_COM3_SEGMENT_DATA_6                                        (0x40U << LCD_RAM_COM3_SEGMENT_DATA_Pos)
#define LCD_RAM_COM3_SEGMENT_DATA_7                                        (0x80U << LCD_RAM_COM3_SEGMENT_DATA_Pos)
#define LCD_RAM_COM3_SEGMENT_DATA_8                                        (0x100U << LCD_RAM_COM3_SEGMENT_DATA_Pos)
#define LCD_RAM_COM3_SEGMENT_DATA_9                                        (0x200U << LCD_RAM_COM3_SEGMENT_DATA_Pos)
#define LCD_RAM_COM3_SEGMENT_DATA_10                                       (0x400U << LCD_RAM_COM3_SEGMENT_DATA_Pos)
#define LCD_RAM_COM3_SEGMENT_DATA_11                                       (0x800U << LCD_RAM_COM3_SEGMENT_DATA_Pos)
#define LCD_RAM_COM3_SEGMENT_DATA_12                                       (0x1000U << LCD_RAM_COM3_SEGMENT_DATA_Pos)
#define LCD_RAM_COM3_SEGMENT_DATA_13                                       (0x2000U << LCD_RAM_COM3_SEGMENT_DATA_Pos)
#define LCD_RAM_COM3_SEGMENT_DATA_14                                       (0x4000U << LCD_RAM_COM3_SEGMENT_DATA_Pos)
#define LCD_RAM_COM3_SEGMENT_DATA_15                                       (0x8000U << LCD_RAM_COM3_SEGMENT_DATA_Pos)

/* =====================================================    RAM_COM4    =====================================================*/ 
#define LCD_RAM_COM4_SEGMENT_DATA_Pos                                      (0UL)		/*!<LCD RAM_COM4: SEGMENT_DATA (Bit 0) */
#define LCD_RAM_COM4_SEGMENT_DATA_Msk                                      (0xffffUL)		/*!< LCD RAM_COM4: SEGMENT_DATA (Bitfield-Mask: 0xffff) */
#define LCD_RAM_COM4_SEGMENT_DATA                                          LCD_RAM_COM4_SEGMENT_DATA_Msk
#define LCD_RAM_COM4_SEGMENT_DATA_0                                        (0x1U << LCD_RAM_COM4_SEGMENT_DATA_Pos)
#define LCD_RAM_COM4_SEGMENT_DATA_1                                        (0x2U << LCD_RAM_COM4_SEGMENT_DATA_Pos)
#define LCD_RAM_COM4_SEGMENT_DATA_2                                        (0x4U << LCD_RAM_COM4_SEGMENT_DATA_Pos)
#define LCD_RAM_COM4_SEGMENT_DATA_3                                        (0x8U << LCD_RAM_COM4_SEGMENT_DATA_Pos)
#define LCD_RAM_COM4_SEGMENT_DATA_4                                        (0x10U << LCD_RAM_COM4_SEGMENT_DATA_Pos)
#define LCD_RAM_COM4_SEGMENT_DATA_5                                        (0x20U << LCD_RAM_COM4_SEGMENT_DATA_Pos)
#define LCD_RAM_COM4_SEGMENT_DATA_6                                        (0x40U << LCD_RAM_COM4_SEGMENT_DATA_Pos)
#define LCD_RAM_COM4_SEGMENT_DATA_7                                        (0x80U << LCD_RAM_COM4_SEGMENT_DATA_Pos)
#define LCD_RAM_COM4_SEGMENT_DATA_8                                        (0x100U << LCD_RAM_COM4_SEGMENT_DATA_Pos)
#define LCD_RAM_COM4_SEGMENT_DATA_9                                        (0x200U << LCD_RAM_COM4_SEGMENT_DATA_Pos)
#define LCD_RAM_COM4_SEGMENT_DATA_10                                       (0x400U << LCD_RAM_COM4_SEGMENT_DATA_Pos)
#define LCD_RAM_COM4_SEGMENT_DATA_11                                       (0x800U << LCD_RAM_COM4_SEGMENT_DATA_Pos)

/* =====================================================    RAM_COM5    =====================================================*/ 
#define LCD_RAM_COM5_SEGMENT_DATA_Pos                                      (0UL)		/*!<LCD RAM_COM5: SEGMENT_DATA (Bit 0) */
#define LCD_RAM_COM5_SEGMENT_DATA_Msk                                      (0xffffUL)		/*!< LCD RAM_COM5: SEGMENT_DATA (Bitfield-Mask: 0xffff) */
#define LCD_RAM_COM5_SEGMENT_DATA                                          LCD_RAM_COM5_SEGMENT_DATA_Msk
#define LCD_RAM_COM5_SEGMENT_DATA_0                                        (0x1U << LCD_RAM_COM5_SEGMENT_DATA_Pos)
#define LCD_RAM_COM5_SEGMENT_DATA_1                                        (0x2U << LCD_RAM_COM5_SEGMENT_DATA_Pos)
#define LCD_RAM_COM5_SEGMENT_DATA_2                                        (0x4U << LCD_RAM_COM5_SEGMENT_DATA_Pos)
#define LCD_RAM_COM5_SEGMENT_DATA_3                                        (0x8U << LCD_RAM_COM5_SEGMENT_DATA_Pos)
#define LCD_RAM_COM5_SEGMENT_DATA_4                                        (0x10U << LCD_RAM_COM5_SEGMENT_DATA_Pos)
#define LCD_RAM_COM5_SEGMENT_DATA_5                                        (0x20U << LCD_RAM_COM5_SEGMENT_DATA_Pos)
#define LCD_RAM_COM5_SEGMENT_DATA_6                                        (0x40U << LCD_RAM_COM5_SEGMENT_DATA_Pos)
#define LCD_RAM_COM5_SEGMENT_DATA_7                                        (0x80U << LCD_RAM_COM5_SEGMENT_DATA_Pos)
#define LCD_RAM_COM5_SEGMENT_DATA_8                                        (0x100U << LCD_RAM_COM5_SEGMENT_DATA_Pos)
#define LCD_RAM_COM5_SEGMENT_DATA_9                                        (0x200U << LCD_RAM_COM5_SEGMENT_DATA_Pos)
#define LCD_RAM_COM5_SEGMENT_DATA_10                                       (0x400U << LCD_RAM_COM5_SEGMENT_DATA_Pos)
#define LCD_RAM_COM5_SEGMENT_DATA_11                                       (0x800U << LCD_RAM_COM5_SEGMENT_DATA_Pos)

/* =====================================================    RAM_COM6    =====================================================*/ 
#define LCD_RAM_COM6_SEGMENT_DATA_Pos                                      (0UL)		/*!<LCD RAM_COM6: SEGMENT_DATA (Bit 0) */
#define LCD_RAM_COM6_SEGMENT_DATA_Msk                                      (0xffffUL)		/*!< LCD RAM_COM6: SEGMENT_DATA (Bitfield-Mask: 0xffff) */
#define LCD_RAM_COM6_SEGMENT_DATA                                          LCD_RAM_COM6_SEGMENT_DATA_Msk
#define LCD_RAM_COM6_SEGMENT_DATA_0                                        (0x1U << LCD_RAM_COM6_SEGMENT_DATA_Pos)
#define LCD_RAM_COM6_SEGMENT_DATA_1                                        (0x2U << LCD_RAM_COM6_SEGMENT_DATA_Pos)
#define LCD_RAM_COM6_SEGMENT_DATA_2                                        (0x4U << LCD_RAM_COM6_SEGMENT_DATA_Pos)
#define LCD_RAM_COM6_SEGMENT_DATA_3                                        (0x8U << LCD_RAM_COM6_SEGMENT_DATA_Pos)
#define LCD_RAM_COM6_SEGMENT_DATA_4                                        (0x10U << LCD_RAM_COM6_SEGMENT_DATA_Pos)
#define LCD_RAM_COM6_SEGMENT_DATA_5                                        (0x20U << LCD_RAM_COM6_SEGMENT_DATA_Pos)
#define LCD_RAM_COM6_SEGMENT_DATA_6                                        (0x40U << LCD_RAM_COM6_SEGMENT_DATA_Pos)
#define LCD_RAM_COM6_SEGMENT_DATA_7                                        (0x80U << LCD_RAM_COM6_SEGMENT_DATA_Pos)
#define LCD_RAM_COM6_SEGMENT_DATA_8                                        (0x100U << LCD_RAM_COM6_SEGMENT_DATA_Pos)
#define LCD_RAM_COM6_SEGMENT_DATA_9                                        (0x200U << LCD_RAM_COM6_SEGMENT_DATA_Pos)
#define LCD_RAM_COM6_SEGMENT_DATA_10                                       (0x400U << LCD_RAM_COM6_SEGMENT_DATA_Pos)
#define LCD_RAM_COM6_SEGMENT_DATA_11                                       (0x800U << LCD_RAM_COM6_SEGMENT_DATA_Pos)

/* =====================================================    RAM_COM7    =====================================================*/ 
#define LCD_RAM_COM7_SEGMENT_DATA_Pos                                      (0UL)		/*!<LCD RAM_COM7: SEGMENT_DATA (Bit 0) */
#define LCD_RAM_COM7_SEGMENT_DATA_Msk                                      (0xffffUL)		/*!< LCD RAM_COM7: SEGMENT_DATA (Bitfield-Mask: 0xffff) */
#define LCD_RAM_COM7_SEGMENT_DATA                                          LCD_RAM_COM7_SEGMENT_DATA_Msk
#define LCD_RAM_COM7_SEGMENT_DATA_0                                        (0x1U << LCD_RAM_COM7_SEGMENT_DATA_Pos)
#define LCD_RAM_COM7_SEGMENT_DATA_1                                        (0x2U << LCD_RAM_COM7_SEGMENT_DATA_Pos)
#define LCD_RAM_COM7_SEGMENT_DATA_2                                        (0x4U << LCD_RAM_COM7_SEGMENT_DATA_Pos)
#define LCD_RAM_COM7_SEGMENT_DATA_3                                        (0x8U << LCD_RAM_COM7_SEGMENT_DATA_Pos)
#define LCD_RAM_COM7_SEGMENT_DATA_4                                        (0x10U << LCD_RAM_COM7_SEGMENT_DATA_Pos)
#define LCD_RAM_COM7_SEGMENT_DATA_5                                        (0x20U << LCD_RAM_COM7_SEGMENT_DATA_Pos)
#define LCD_RAM_COM7_SEGMENT_DATA_6                                        (0x40U << LCD_RAM_COM7_SEGMENT_DATA_Pos)
#define LCD_RAM_COM7_SEGMENT_DATA_7                                        (0x80U << LCD_RAM_COM7_SEGMENT_DATA_Pos)
#define LCD_RAM_COM7_SEGMENT_DATA_8                                        (0x100U << LCD_RAM_COM7_SEGMENT_DATA_Pos)
#define LCD_RAM_COM7_SEGMENT_DATA_9                                        (0x200U << LCD_RAM_COM7_SEGMENT_DATA_Pos)
#define LCD_RAM_COM7_SEGMENT_DATA_10                                       (0x400U << LCD_RAM_COM7_SEGMENT_DATA_Pos)
#define LCD_RAM_COM7_SEGMENT_DATA_11                                       (0x800U << LCD_RAM_COM7_SEGMENT_DATA_Pos)


