embetech-official/embenet-demo-nucleo-wl33cc1/Drivers/CMSIS/Device/ST/STM32WL3X/Include/stm32wl33.h
/* =====================================================    STAT    =====================================================*/ 
#define LCSC_STAT_MAX_LCAB_CNT_BOUND_Pos                                   (24UL)		/*!<LCSC STAT: MAX_LCAB_CNT_BOUND (Bit 24) */
#define LCSC_STAT_MAX_LCAB_CNT_BOUND_Msk                                   (0xff000000UL)		/*!< LCSC STAT: MAX_LCAB_CNT_BOUND (Bitfield-Mask: 0xff) */
#define LCSC_STAT_MAX_LCAB_CNT_BOUND                                       LCSC_STAT_MAX_LCAB_CNT_BOUND_Msk
#define LCSC_STAT_MAX_LCAB_CNT_BOUND_0                                     (0x1U << LCSC_STAT_MAX_LCAB_CNT_BOUND_Pos)
#define LCSC_STAT_MAX_LCAB_CNT_BOUND_1                                     (0x2U << LCSC_STAT_MAX_LCAB_CNT_BOUND_Pos)
#define LCSC_STAT_MAX_LCAB_CNT_BOUND_2                                     (0x4U << LCSC_STAT_MAX_LCAB_CNT_BOUND_Pos)
#define LCSC_STAT_MAX_LCAB_CNT_BOUND_3                                     (0x8U << LCSC_STAT_MAX_LCAB_CNT_BOUND_Pos)
#define LCSC_STAT_MAX_LCAB_CNT_BOUND_4                                     (0x10U << LCSC_STAT_MAX_LCAB_CNT_BOUND_Pos)
#define LCSC_STAT_MAX_LCAB_CNT_BOUND_5                                     (0x20U << LCSC_STAT_MAX_LCAB_CNT_BOUND_Pos)
#define LCSC_STAT_MAX_LCAB_CNT_BOUND_6                                     (0x40U << LCSC_STAT_MAX_LCAB_CNT_BOUND_Pos)
#define LCSC_STAT_MAX_LCAB_CNT_BOUND_7                                     (0x80U << LCSC_STAT_MAX_LCAB_CNT_BOUND_Pos)
#define LCSC_STAT_MIN_LCAB_CNT_BOUND_Pos                                   (16UL)		/*!<LCSC STAT: MIN_LCAB_CNT_BOUND (Bit 16) */
#define LCSC_STAT_MIN_LCAB_CNT_BOUND_Msk                                   (0xff0000UL)		/*!< LCSC STAT: MIN_LCAB_CNT_BOUND (Bitfield-Mask: 0xff) */
#define LCSC_STAT_MIN_LCAB_CNT_BOUND                                       LCSC_STAT_MIN_LCAB_CNT_BOUND_Msk
#define LCSC_STAT_MIN_LCAB_CNT_BOUND_0                                     (0x1U << LCSC_STAT_MIN_LCAB_CNT_BOUND_Pos)
#define LCSC_STAT_MIN_LCAB_CNT_BOUND_1                                     (0x2U << LCSC_STAT_MIN_LCAB_CNT_BOUND_Pos)
#define LCSC_STAT_MIN_LCAB_CNT_BOUND_2                                     (0x4U << LCSC_STAT_MIN_LCAB_CNT_BOUND_Pos)
#define LCSC_STAT_MIN_LCAB_CNT_BOUND_3                                     (0x8U << LCSC_STAT_MIN_LCAB_CNT_BOUND_Pos)
#define LCSC_STAT_MIN_LCAB_CNT_BOUND_4                                     (0x10U << LCSC_STAT_MIN_LCAB_CNT_BOUND_Pos)
#define LCSC_STAT_MIN_LCAB_CNT_BOUND_5                                     (0x20U << LCSC_STAT_MIN_LCAB_CNT_BOUND_Pos)
#define LCSC_STAT_MIN_LCAB_CNT_BOUND_6                                     (0x40U << LCSC_STAT_MIN_LCAB_CNT_BOUND_Pos)
#define LCSC_STAT_MIN_LCAB_CNT_BOUND_7                                     (0x80U << LCSC_STAT_MIN_LCAB_CNT_BOUND_Pos)
#define LCSC_STAT_MAX_LCAB_CNT_Pos                                         (8UL)		/*!<LCSC STAT: MAX_LCAB_CNT (Bit 8) */
#define LCSC_STAT_MAX_LCAB_CNT_Msk                                         (0xff00UL)		/*!< LCSC STAT: MAX_LCAB_CNT (Bitfield-Mask: 0xff) */
#define LCSC_STAT_MAX_LCAB_CNT                                             LCSC_STAT_MAX_LCAB_CNT_Msk
#define LCSC_STAT_MAX_LCAB_CNT_0                                           (0x1U << LCSC_STAT_MAX_LCAB_CNT_Pos)
#define LCSC_STAT_MAX_LCAB_CNT_1                                           (0x2U << LCSC_STAT_MAX_LCAB_CNT_Pos)
#define LCSC_STAT_MAX_LCAB_CNT_2                                           (0x4U << LCSC_STAT_MAX_LCAB_CNT_Pos)
#define LCSC_STAT_MAX_LCAB_CNT_3                                           (0x8U << LCSC_STAT_MAX_LCAB_CNT_Pos)
#define LCSC_STAT_MAX_LCAB_CNT_4                                           (0x10U << LCSC_STAT_MAX_LCAB_CNT_Pos)
#define LCSC_STAT_MAX_LCAB_CNT_5                                           (0x20U << LCSC_STAT_MAX_LCAB_CNT_Pos)
#define LCSC_STAT_MAX_LCAB_CNT_6                                           (0x40U << LCSC_STAT_MAX_LCAB_CNT_Pos)
#define LCSC_STAT_MAX_LCAB_CNT_7                                           (0x80U << LCSC_STAT_MAX_LCAB_CNT_Pos)
#define LCSC_STAT_MIN_LCAB_CNT_Pos                                         (0UL)		/*!<LCSC STAT: MIN_LCAB_CNT (Bit 0) */
#define LCSC_STAT_MIN_LCAB_CNT_Msk                                         (0xffUL)		/*!< LCSC STAT: MIN_LCAB_CNT (Bitfield-Mask: 0xff) */
#define LCSC_STAT_MIN_LCAB_CNT                                             LCSC_STAT_MIN_LCAB_CNT_Msk
#define LCSC_STAT_MIN_LCAB_CNT_0                                           (0x1U << LCSC_STAT_MIN_LCAB_CNT_Pos)
#define LCSC_STAT_MIN_LCAB_CNT_1                                           (0x2U << LCSC_STAT_MIN_LCAB_CNT_Pos)
#define LCSC_STAT_MIN_LCAB_CNT_2                                           (0x4U << LCSC_STAT_MIN_LCAB_CNT_Pos)
#define LCSC_STAT_MIN_LCAB_CNT_3                                           (0x8U << LCSC_STAT_MIN_LCAB_CNT_Pos)
#define LCSC_STAT_MIN_LCAB_CNT_4                                           (0x10U << LCSC_STAT_MIN_LCAB_CNT_Pos)
#define LCSC_STAT_MIN_LCAB_CNT_5                                           (0x20U << LCSC_STAT_MIN_LCAB_CNT_Pos)
#define LCSC_STAT_MIN_LCAB_CNT_6                                           (0x40U << LCSC_STAT_MIN_LCAB_CNT_Pos)
#define LCSC_STAT_MIN_LCAB_CNT_7                                           (0x80U << LCSC_STAT_MIN_LCAB_CNT_Pos)

/* =====================================================    VER    =====================================================*/ 
#define LCSC_VER_PROD_Pos                                                  (12UL)		/*!<LCSC VER: PROD (Bit 12) */
#define LCSC_VER_PROD_Msk                                                  (0xf000UL)		/*!< LCSC VER: PROD (Bitfield-Mask: 0x0f) */
#define LCSC_VER_PROD                                                      LCSC_VER_PROD_Msk
#define LCSC_VER_PROD_0                                                    (0x1U << LCSC_VER_PROD_Pos)
#define LCSC_VER_PROD_1                                                    (0x2U << LCSC_VER_PROD_Pos)
#define LCSC_VER_PROD_2                                                    (0x4U << LCSC_VER_PROD_Pos)
#define LCSC_VER_PROD_3                                                    (0x8U << LCSC_VER_PROD_Pos)
#define LCSC_VER_VER_Pos                                                   (8UL)		/*!<LCSC VER: VER (Bit 8) */
#define LCSC_VER_VER_Msk                                                   (0xf00UL)		/*!< LCSC VER: VER (Bitfield-Mask: 0x0f) */
#define LCSC_VER_VER                                                       LCSC_VER_VER_Msk
#define LCSC_VER_VER_0                                                     (0x1U << LCSC_VER_VER_Pos)
#define LCSC_VER_VER_1                                                     (0x2U << LCSC_VER_VER_Pos)
#define LCSC_VER_VER_2                                                     (0x4U << LCSC_VER_VER_Pos)
#define LCSC_VER_VER_3                                                     (0x8U << LCSC_VER_VER_Pos)
#define LCSC_VER_REV_Pos                                                   (4UL)		/*!<LCSC VER: REV (Bit 4) */
#define LCSC_VER_REV_Msk                                                   (0xf0UL)		/*!< LCSC VER: REV (Bitfield-Mask: 0x0f) */
#define LCSC_VER_REV                                                       LCSC_VER_REV_Msk
#define LCSC_VER_REV_0                                                     (0x1U << LCSC_VER_REV_Pos)
#define LCSC_VER_REV_1                                                     (0x2U << LCSC_VER_REV_Pos)
#define LCSC_VER_REV_2                                                     (0x4U << LCSC_VER_REV_Pos)
#define LCSC_VER_REV_3                                                     (0x8U << LCSC_VER_REV_Pos)

