embetech-official/embenet-demo-nucleo-wl33cc1/Drivers/CMSIS/Device/ST/STM32WL3X/Include/stm32wl33.h
/* =====================================================    TIMINGR    =====================================================*/ 
#define I2C_TIMINGR_PRESC_Pos                                              (28UL)		/*!<I2C TIMINGR: PRESC (Bit 28) */
#define I2C_TIMINGR_PRESC_Msk                                              (0xf0000000UL)		/*!< I2C TIMINGR: PRESC (Bitfield-Mask: 0x0f) */
#define I2C_TIMINGR_PRESC                                                  I2C_TIMINGR_PRESC_Msk
#define I2C_TIMINGR_PRESC_0                                                (0x1U << I2C_TIMINGR_PRESC_Pos)
#define I2C_TIMINGR_PRESC_1                                                (0x2U << I2C_TIMINGR_PRESC_Pos)
#define I2C_TIMINGR_PRESC_2                                                (0x4U << I2C_TIMINGR_PRESC_Pos)
#define I2C_TIMINGR_PRESC_3                                                (0x8U << I2C_TIMINGR_PRESC_Pos)
#define I2C_TIMINGR_SCLDEL_Pos                                             (20UL)		/*!<I2C TIMINGR: SCLDEL (Bit 20) */
#define I2C_TIMINGR_SCLDEL_Msk                                             (0xf00000UL)		/*!< I2C TIMINGR: SCLDEL (Bitfield-Mask: 0x0f) */
#define I2C_TIMINGR_SCLDEL                                                 I2C_TIMINGR_SCLDEL_Msk
#define I2C_TIMINGR_SCLDEL_0                                               (0x1U << I2C_TIMINGR_SCLDEL_Pos)
#define I2C_TIMINGR_SCLDEL_1                                               (0x2U << I2C_TIMINGR_SCLDEL_Pos)
#define I2C_TIMINGR_SCLDEL_2                                               (0x4U << I2C_TIMINGR_SCLDEL_Pos)
#define I2C_TIMINGR_SCLDEL_3                                               (0x8U << I2C_TIMINGR_SCLDEL_Pos)
#define I2C_TIMINGR_SDADEL_Pos                                             (16UL)		/*!<I2C TIMINGR: SDADEL (Bit 16) */
#define I2C_TIMINGR_SDADEL_Msk                                             (0xf0000UL)		/*!< I2C TIMINGR: SDADEL (Bitfield-Mask: 0x0f) */
#define I2C_TIMINGR_SDADEL                                                 I2C_TIMINGR_SDADEL_Msk
#define I2C_TIMINGR_SDADEL_0                                               (0x1U << I2C_TIMINGR_SDADEL_Pos)
#define I2C_TIMINGR_SDADEL_1                                               (0x2U << I2C_TIMINGR_SDADEL_Pos)
#define I2C_TIMINGR_SDADEL_2                                               (0x4U << I2C_TIMINGR_SDADEL_Pos)
#define I2C_TIMINGR_SDADEL_3                                               (0x8U << I2C_TIMINGR_SDADEL_Pos)
#define I2C_TIMINGR_SCLH_Pos                                               (8UL)		/*!<I2C TIMINGR: SCLH (Bit 8) */
#define I2C_TIMINGR_SCLH_Msk                                               (0xff00UL)		/*!< I2C TIMINGR: SCLH (Bitfield-Mask: 0xff) */
#define I2C_TIMINGR_SCLH                                                   I2C_TIMINGR_SCLH_Msk
#define I2C_TIMINGR_SCLH_0                                                 (0x1U << I2C_TIMINGR_SCLH_Pos)
#define I2C_TIMINGR_SCLH_1                                                 (0x2U << I2C_TIMINGR_SCLH_Pos)
#define I2C_TIMINGR_SCLH_2                                                 (0x4U << I2C_TIMINGR_SCLH_Pos)
#define I2C_TIMINGR_SCLH_3                                                 (0x8U << I2C_TIMINGR_SCLH_Pos)
#define I2C_TIMINGR_SCLH_4                                                 (0x10U << I2C_TIMINGR_SCLH_Pos)
#define I2C_TIMINGR_SCLH_5                                                 (0x20U << I2C_TIMINGR_SCLH_Pos)
#define I2C_TIMINGR_SCLH_6                                                 (0x40U << I2C_TIMINGR_SCLH_Pos)
#define I2C_TIMINGR_SCLH_7                                                 (0x80U << I2C_TIMINGR_SCLH_Pos)
#define I2C_TIMINGR_SCLL_Pos                                               (0UL)		/*!<I2C TIMINGR: SCLL (Bit 0) */
#define I2C_TIMINGR_SCLL_Msk                                               (0xffUL)		/*!< I2C TIMINGR: SCLL (Bitfield-Mask: 0xff) */
#define I2C_TIMINGR_SCLL                                                   I2C_TIMINGR_SCLL_Msk
#define I2C_TIMINGR_SCLL_0                                                 (0x1U << I2C_TIMINGR_SCLL_Pos)
#define I2C_TIMINGR_SCLL_1                                                 (0x2U << I2C_TIMINGR_SCLL_Pos)
#define I2C_TIMINGR_SCLL_2                                                 (0x4U << I2C_TIMINGR_SCLL_Pos)
#define I2C_TIMINGR_SCLL_3                                                 (0x8U << I2C_TIMINGR_SCLL_Pos)
#define I2C_TIMINGR_SCLL_4                                                 (0x10U << I2C_TIMINGR_SCLL_Pos)
#define I2C_TIMINGR_SCLL_5                                                 (0x20U << I2C_TIMINGR_SCLL_Pos)
#define I2C_TIMINGR_SCLL_6                                                 (0x40U << I2C_TIMINGR_SCLL_Pos)
#define I2C_TIMINGR_SCLL_7                                                 (0x80U << I2C_TIMINGR_SCLL_Pos)

/* =====================================================    TIMEOUTR    =====================================================*/ 
#define I2C_TIMEOUTR_TEXTEN_Pos                                            (31UL)		/*!<I2C TIMEOUTR: TEXTEN (Bit 31) */
#define I2C_TIMEOUTR_TEXTEN_Msk                                            (0x80000000UL)		/*!< I2C TIMEOUTR: TEXTEN (Bitfield-Mask: 0x01) */
#define I2C_TIMEOUTR_TEXTEN                                                I2C_TIMEOUTR_TEXTEN_Msk
#define I2C_TIMEOUTR_TIMEOUTB_Pos                                          (16UL)		/*!<I2C TIMEOUTR: TIMEOUTB (Bit 16) */
#define I2C_TIMEOUTR_TIMEOUTB_Msk                                          (0xfff0000UL)		/*!< I2C TIMEOUTR: TIMEOUTB (Bitfield-Mask: 0xfff) */
#define I2C_TIMEOUTR_TIMEOUTB                                              I2C_TIMEOUTR_TIMEOUTB_Msk
#define I2C_TIMEOUTR_TIMEOUTB_0                                            (0x1U << I2C_TIMEOUTR_TIMEOUTB_Pos)
#define I2C_TIMEOUTR_TIMEOUTB_1                                            (0x2U << I2C_TIMEOUTR_TIMEOUTB_Pos)
#define I2C_TIMEOUTR_TIMEOUTB_2                                            (0x4U << I2C_TIMEOUTR_TIMEOUTB_Pos)
#define I2C_TIMEOUTR_TIMEOUTB_3                                            (0x8U << I2C_TIMEOUTR_TIMEOUTB_Pos)
#define I2C_TIMEOUTR_TIMEOUTB_4                                            (0x10U << I2C_TIMEOUTR_TIMEOUTB_Pos)
#define I2C_TIMEOUTR_TIMEOUTB_5                                            (0x20U << I2C_TIMEOUTR_TIMEOUTB_Pos)
#define I2C_TIMEOUTR_TIMEOUTB_6                                            (0x40U << I2C_TIMEOUTR_TIMEOUTB_Pos)
#define I2C_TIMEOUTR_TIMEOUTB_7                                            (0x80U << I2C_TIMEOUTR_TIMEOUTB_Pos)
#define I2C_TIMEOUTR_TIMEOUTB_8                                            (0x100U << I2C_TIMEOUTR_TIMEOUTB_Pos)
#define I2C_TIMEOUTR_TIMEOUTB_9                                            (0x200U << I2C_TIMEOUTR_TIMEOUTB_Pos)
#define I2C_TIMEOUTR_TIMEOUTB_10                                           (0x400U << I2C_TIMEOUTR_TIMEOUTB_Pos)
#define I2C_TIMEOUTR_TIMEOUTB_11                                           (0x800U << I2C_TIMEOUTR_TIMEOUTB_Pos)
#define I2C_TIMEOUTR_TIMOUTEN_Pos                                          (15UL)		/*!<I2C TIMEOUTR: TIMOUTEN (Bit 15) */
#define I2C_TIMEOUTR_TIMOUTEN_Msk                                          (0x8000UL)		/*!< I2C TIMEOUTR: TIMOUTEN (Bitfield-Mask: 0x01) */
#define I2C_TIMEOUTR_TIMOUTEN                                              I2C_TIMEOUTR_TIMOUTEN_Msk
#define I2C_TIMEOUTR_TIDLE_Pos                                             (12UL)		/*!<I2C TIMEOUTR: TIDLE (Bit 12) */
#define I2C_TIMEOUTR_TIDLE_Msk                                             (0x1000UL)		/*!< I2C TIMEOUTR: TIDLE (Bitfield-Mask: 0x01) */
#define I2C_TIMEOUTR_TIDLE                                                 I2C_TIMEOUTR_TIDLE_Msk
#define I2C_TIMEOUTR_TIMEOUTA_Pos                                          (0UL)		/*!<I2C TIMEOUTR: TIMEOUTA (Bit 0) */
#define I2C_TIMEOUTR_TIMEOUTA_Msk                                          (0xfffUL)		/*!< I2C TIMEOUTR: TIMEOUTA (Bitfield-Mask: 0xfff) */
#define I2C_TIMEOUTR_TIMEOUTA                                              I2C_TIMEOUTR_TIMEOUTA_Msk
#define I2C_TIMEOUTR_TIMEOUTA_0                                            (0x1U << I2C_TIMEOUTR_TIMEOUTA_Pos)
#define I2C_TIMEOUTR_TIMEOUTA_1                                            (0x2U << I2C_TIMEOUTR_TIMEOUTA_Pos)
#define I2C_TIMEOUTR_TIMEOUTA_2                                            (0x4U << I2C_TIMEOUTR_TIMEOUTA_Pos)
#define I2C_TIMEOUTR_TIMEOUTA_3                                            (0x8U << I2C_TIMEOUTR_TIMEOUTA_Pos)
#define I2C_TIMEOUTR_TIMEOUTA_4                                            (0x10U << I2C_TIMEOUTR_TIMEOUTA_Pos)
#define I2C_TIMEOUTR_TIMEOUTA_5                                            (0x20U << I2C_TIMEOUTR_TIMEOUTA_Pos)
#define I2C_TIMEOUTR_TIMEOUTA_6                                            (0x40U << I2C_TIMEOUTR_TIMEOUTA_Pos)
#define I2C_TIMEOUTR_TIMEOUTA_7                                            (0x80U << I2C_TIMEOUTR_TIMEOUTA_Pos)
#define I2C_TIMEOUTR_TIMEOUTA_8                                            (0x100U << I2C_TIMEOUTR_TIMEOUTA_Pos)
#define I2C_TIMEOUTR_TIMEOUTA_9                                            (0x200U << I2C_TIMEOUTR_TIMEOUTA_Pos)
#define I2C_TIMEOUTR_TIMEOUTA_10                                           (0x400U << I2C_TIMEOUTR_TIMEOUTA_Pos)
#define I2C_TIMEOUTR_TIMEOUTA_11                                           (0x800U << I2C_TIMEOUTR_TIMEOUTA_Pos)

