embetech-official/embenet-demo-nucleo-wl33cc1/Drivers/CMSIS/Device/ST/STM32WL3X/Include/stm32wl33.h
/* =====================================================    CTRL    =====================================================*/ 
#define ADC_CTRL_STOP_OP_MODE_Pos                                          (2UL)		/*!<ADC CTRL: STOP_OP_MODE (Bit 2) */
#define ADC_CTRL_STOP_OP_MODE_Msk                                          (0x4UL)		/*!< ADC CTRL: STOP_OP_MODE (Bitfield-Mask: 0x01) */
#define ADC_CTRL_STOP_OP_MODE                                              ADC_CTRL_STOP_OP_MODE_Msk
#define ADC_CTRL_START_CONV_Pos                                            (1UL)		/*!<ADC CTRL: START_CONV (Bit 1) */
#define ADC_CTRL_START_CONV_Msk                                            (0x2UL)		/*!< ADC CTRL: START_CONV (Bitfield-Mask: 0x01) */
#define ADC_CTRL_START_CONV                                                ADC_CTRL_START_CONV_Msk
#define ADC_CTRL_ADC_ON_OFF_Pos                                            (0UL)		/*!<ADC CTRL: ADC_ON_OFF (Bit 0) */
#define ADC_CTRL_ADC_ON_OFF_Msk                                            (0x1UL)		/*!< ADC CTRL: ADC_ON_OFF (Bitfield-Mask: 0x01) */
#define ADC_CTRL_ADC_ON_OFF                                                ADC_CTRL_ADC_ON_OFF_Msk

/* =====================================================    SWITCH    =====================================================*/ 
#define ADC_SWITCH_SE_VIN_7_Pos                                            (14UL)		/*!<ADC SWITCH: SE_VIN_7 (Bit 14) */
#define ADC_SWITCH_SE_VIN_7_Msk                                            (0xc000UL)		/*!< ADC SWITCH: SE_VIN_7 (Bitfield-Mask: 0x03) */
#define ADC_SWITCH_SE_VIN_7                                                ADC_SWITCH_SE_VIN_7_Msk
#define ADC_SWITCH_SE_VIN_7_0                                              (0x1U << ADC_SWITCH_SE_VIN_7_Pos)
#define ADC_SWITCH_SE_VIN_7_1                                              (0x2U << ADC_SWITCH_SE_VIN_7_Pos)
#define ADC_SWITCH_SE_VIN_6_Pos                                            (12UL)		/*!<ADC SWITCH: SE_VIN_6 (Bit 12) */
#define ADC_SWITCH_SE_VIN_6_Msk                                            (0x3000UL)		/*!< ADC SWITCH: SE_VIN_6 (Bitfield-Mask: 0x03) */
#define ADC_SWITCH_SE_VIN_6                                                ADC_SWITCH_SE_VIN_6_Msk
#define ADC_SWITCH_SE_VIN_6_0                                              (0x1U << ADC_SWITCH_SE_VIN_6_Pos)
#define ADC_SWITCH_SE_VIN_6_1                                              (0x2U << ADC_SWITCH_SE_VIN_6_Pos)
#define ADC_SWITCH_SE_VIN_5_Pos                                            (10UL)		/*!<ADC SWITCH: SE_VIN_5 (Bit 10) */
#define ADC_SWITCH_SE_VIN_5_Msk                                            (0xc00UL)		/*!< ADC SWITCH: SE_VIN_5 (Bitfield-Mask: 0x03) */
#define ADC_SWITCH_SE_VIN_5                                                ADC_SWITCH_SE_VIN_5_Msk
#define ADC_SWITCH_SE_VIN_5_0                                              (0x1U << ADC_SWITCH_SE_VIN_5_Pos)
#define ADC_SWITCH_SE_VIN_5_1                                              (0x2U << ADC_SWITCH_SE_VIN_5_Pos)
#define ADC_SWITCH_SE_VIN_4_Pos                                            (8UL)		/*!<ADC SWITCH: SE_VIN_4 (Bit 8) */
#define ADC_SWITCH_SE_VIN_4_Msk                                            (0x300UL)		/*!< ADC SWITCH: SE_VIN_4 (Bitfield-Mask: 0x03) */
#define ADC_SWITCH_SE_VIN_4                                                ADC_SWITCH_SE_VIN_4_Msk
#define ADC_SWITCH_SE_VIN_4_0                                              (0x1U << ADC_SWITCH_SE_VIN_4_Pos)
#define ADC_SWITCH_SE_VIN_4_1                                              (0x2U << ADC_SWITCH_SE_VIN_4_Pos)
#define ADC_SWITCH_SE_VIN_3_Pos                                            (6UL)		/*!<ADC SWITCH: SE_VIN_3 (Bit 6) */
#define ADC_SWITCH_SE_VIN_3_Msk                                            (0xc0UL)		/*!< ADC SWITCH: SE_VIN_3 (Bitfield-Mask: 0x03) */
#define ADC_SWITCH_SE_VIN_3                                                ADC_SWITCH_SE_VIN_3_Msk
#define ADC_SWITCH_SE_VIN_3_0                                              (0x1U << ADC_SWITCH_SE_VIN_3_Pos)
#define ADC_SWITCH_SE_VIN_3_1                                              (0x2U << ADC_SWITCH_SE_VIN_3_Pos)
#define ADC_SWITCH_SE_VIN_2_Pos                                            (4UL)		/*!<ADC SWITCH: SE_VIN_2 (Bit 4) */
#define ADC_SWITCH_SE_VIN_2_Msk                                            (0x30UL)		/*!< ADC SWITCH: SE_VIN_2 (Bitfield-Mask: 0x03) */
#define ADC_SWITCH_SE_VIN_2                                                ADC_SWITCH_SE_VIN_2_Msk
#define ADC_SWITCH_SE_VIN_2_0                                              (0x1U << ADC_SWITCH_SE_VIN_2_Pos)
#define ADC_SWITCH_SE_VIN_2_1                                              (0x2U << ADC_SWITCH_SE_VIN_2_Pos)
#define ADC_SWITCH_SE_VIN_1_Pos                                            (2UL)		/*!<ADC SWITCH: SE_VIN_1 (Bit 2) */
#define ADC_SWITCH_SE_VIN_1_Msk                                            (0xcUL)		/*!< ADC SWITCH: SE_VIN_1 (Bitfield-Mask: 0x03) */
#define ADC_SWITCH_SE_VIN_1                                                ADC_SWITCH_SE_VIN_1_Msk
#define ADC_SWITCH_SE_VIN_1_0                                              (0x1U << ADC_SWITCH_SE_VIN_1_Pos)
#define ADC_SWITCH_SE_VIN_1_1                                              (0x2U << ADC_SWITCH_SE_VIN_1_Pos)
#define ADC_SWITCH_SE_VIN_0_Pos                                            (0UL)		/*!<ADC SWITCH: SE_VIN_0 (Bit 0) */
#define ADC_SWITCH_SE_VIN_0_Msk                                            (0x3UL)		/*!< ADC SWITCH: SE_VIN_0 (Bitfield-Mask: 0x03) */
#define ADC_SWITCH_SE_VIN_0                                                ADC_SWITCH_SE_VIN_0_Msk
#define ADC_SWITCH_SE_VIN_0_0                                              (0x1U << ADC_SWITCH_SE_VIN_0_Pos)
#define ADC_SWITCH_SE_VIN_0_1                                              (0x2U << ADC_SWITCH_SE_VIN_0_Pos)

/* =====================================================    DS_CONF    =====================================================*/ 
#define ADC_DS_CONF_DS_WIDTH_Pos                                           (3UL)		/*!<ADC DS_CONF: DS_WIDTH (Bit 3) */
#define ADC_DS_CONF_DS_WIDTH_Msk                                           (0x38UL)		/*!< ADC DS_CONF: DS_WIDTH (Bitfield-Mask: 0x07) */
#define ADC_DS_CONF_DS_WIDTH                                               ADC_DS_CONF_DS_WIDTH_Msk
#define ADC_DS_CONF_DS_WIDTH_0                                             (0x1U << ADC_DS_CONF_DS_WIDTH_Pos)
#define ADC_DS_CONF_DS_WIDTH_1                                             (0x2U << ADC_DS_CONF_DS_WIDTH_Pos)
#define ADC_DS_CONF_DS_WIDTH_2                                             (0x4U << ADC_DS_CONF_DS_WIDTH_Pos)
#define ADC_DS_CONF_DS_RATIO_Pos                                           (0UL)		/*!<ADC DS_CONF: DS_RATIO (Bit 0) */
#define ADC_DS_CONF_DS_RATIO_Msk                                           (0x7UL)		/*!< ADC DS_CONF: DS_RATIO (Bitfield-Mask: 0x07) */
#define ADC_DS_CONF_DS_RATIO                                               ADC_DS_CONF_DS_RATIO_Msk
#define ADC_DS_CONF_DS_RATIO_0                                             (0x1U << ADC_DS_CONF_DS_RATIO_Pos)
#define ADC_DS_CONF_DS_RATIO_1                                             (0x2U << ADC_DS_CONF_DS_RATIO_Pos)
#define ADC_DS_CONF_DS_RATIO_2                                             (0x4U << ADC_DS_CONF_DS_RATIO_Pos)

/* =====================================================    SEQ_1    =====================================================*/ 
#define ADC_SEQ_1_SEQ7_Pos                                                 (28UL)		/*!<ADC SEQ_1: SEQ7 (Bit 28) */
#define ADC_SEQ_1_SEQ7_Msk                                                 (0xf0000000UL)		/*!< ADC SEQ_1: SEQ7 (Bitfield-Mask: 0x0f) */
#define ADC_SEQ_1_SEQ7                                                     ADC_SEQ_1_SEQ7_Msk
#define ADC_SEQ_1_SEQ7_0                                                   (0x1U << ADC_SEQ_1_SEQ7_Pos)
#define ADC_SEQ_1_SEQ7_1                                                   (0x2U << ADC_SEQ_1_SEQ7_Pos)
#define ADC_SEQ_1_SEQ7_2                                                   (0x4U << ADC_SEQ_1_SEQ7_Pos)
#define ADC_SEQ_1_SEQ7_3                                                   (0x8U << ADC_SEQ_1_SEQ7_Pos)
#define ADC_SEQ_1_SEQ6_Pos                                                 (24UL)		/*!<ADC SEQ_1: SEQ6 (Bit 24) */
#define ADC_SEQ_1_SEQ6_Msk                                                 (0xf000000UL)		/*!< ADC SEQ_1: SEQ6 (Bitfield-Mask: 0x0f) */
#define ADC_SEQ_1_SEQ6                                                     ADC_SEQ_1_SEQ6_Msk
#define ADC_SEQ_1_SEQ6_0                                                   (0x1U << ADC_SEQ_1_SEQ6_Pos)
#define ADC_SEQ_1_SEQ6_1                                                   (0x2U << ADC_SEQ_1_SEQ6_Pos)
#define ADC_SEQ_1_SEQ6_2                                                   (0x4U << ADC_SEQ_1_SEQ6_Pos)
#define ADC_SEQ_1_SEQ6_3                                                   (0x8U << ADC_SEQ_1_SEQ6_Pos)
#define ADC_SEQ_1_SEQ5_Pos                                                 (20UL)		/*!<ADC SEQ_1: SEQ5 (Bit 20) */
#define ADC_SEQ_1_SEQ5_Msk                                                 (0xf00000UL)		/*!< ADC SEQ_1: SEQ5 (Bitfield-Mask: 0x0f) */
#define ADC_SEQ_1_SEQ5                                                     ADC_SEQ_1_SEQ5_Msk
#define ADC_SEQ_1_SEQ5_0                                                   (0x1U << ADC_SEQ_1_SEQ5_Pos)
#define ADC_SEQ_1_SEQ5_1                                                   (0x2U << ADC_SEQ_1_SEQ5_Pos)
#define ADC_SEQ_1_SEQ5_2                                                   (0x4U << ADC_SEQ_1_SEQ5_Pos)
#define ADC_SEQ_1_SEQ5_3                                                   (0x8U << ADC_SEQ_1_SEQ5_Pos)
#define ADC_SEQ_1_SEQ4_Pos                                                 (16UL)		/*!<ADC SEQ_1: SEQ4 (Bit 16) */
#define ADC_SEQ_1_SEQ4_Msk                                                 (0xf0000UL)		/*!< ADC SEQ_1: SEQ4 (Bitfield-Mask: 0x0f) */
#define ADC_SEQ_1_SEQ4                                                     ADC_SEQ_1_SEQ4_Msk
#define ADC_SEQ_1_SEQ4_0                                                   (0x1U << ADC_SEQ_1_SEQ4_Pos)
#define ADC_SEQ_1_SEQ4_1                                                   (0x2U << ADC_SEQ_1_SEQ4_Pos)
#define ADC_SEQ_1_SEQ4_2                                                   (0x4U << ADC_SEQ_1_SEQ4_Pos)
#define ADC_SEQ_1_SEQ4_3                                                   (0x8U << ADC_SEQ_1_SEQ4_Pos)
#define ADC_SEQ_1_SEQ3_Pos                                                 (12UL)		/*!<ADC SEQ_1: SEQ3 (Bit 12) */
#define ADC_SEQ_1_SEQ3_Msk                                                 (0xf000UL)		/*!< ADC SEQ_1: SEQ3 (Bitfield-Mask: 0x0f) */
#define ADC_SEQ_1_SEQ3                                                     ADC_SEQ_1_SEQ3_Msk
#define ADC_SEQ_1_SEQ3_0                                                   (0x1U << ADC_SEQ_1_SEQ3_Pos)
#define ADC_SEQ_1_SEQ3_1                                                   (0x2U << ADC_SEQ_1_SEQ3_Pos)
#define ADC_SEQ_1_SEQ3_2                                                   (0x4U << ADC_SEQ_1_SEQ3_Pos)
#define ADC_SEQ_1_SEQ3_3                                                   (0x8U << ADC_SEQ_1_SEQ3_Pos)
#define ADC_SEQ_1_SEQ2_Pos                                                 (8UL)		/*!<ADC SEQ_1: SEQ2 (Bit 8) */
#define ADC_SEQ_1_SEQ2_Msk                                                 (0xf00UL)		/*!< ADC SEQ_1: SEQ2 (Bitfield-Mask: 0x0f) */
#define ADC_SEQ_1_SEQ2                                                     ADC_SEQ_1_SEQ2_Msk
#define ADC_SEQ_1_SEQ2_0                                                   (0x1U << ADC_SEQ_1_SEQ2_Pos)
#define ADC_SEQ_1_SEQ2_1                                                   (0x2U << ADC_SEQ_1_SEQ2_Pos)
#define ADC_SEQ_1_SEQ2_2                                                   (0x4U << ADC_SEQ_1_SEQ2_Pos)
#define ADC_SEQ_1_SEQ2_3                                                   (0x8U << ADC_SEQ_1_SEQ2_Pos)
#define ADC_SEQ_1_SEQ1_Pos                                                 (4UL)		/*!<ADC SEQ_1: SEQ1 (Bit 4) */
#define ADC_SEQ_1_SEQ1_Msk                                                 (0xf0UL)		/*!< ADC SEQ_1: SEQ1 (Bitfield-Mask: 0x0f) */
#define ADC_SEQ_1_SEQ1                                                     ADC_SEQ_1_SEQ1_Msk
#define ADC_SEQ_1_SEQ1_0                                                   (0x1U << ADC_SEQ_1_SEQ1_Pos)
#define ADC_SEQ_1_SEQ1_1                                                   (0x2U << ADC_SEQ_1_SEQ1_Pos)
#define ADC_SEQ_1_SEQ1_2                                                   (0x4U << ADC_SEQ_1_SEQ1_Pos)
#define ADC_SEQ_1_SEQ1_3                                                   (0x8U << ADC_SEQ_1_SEQ1_Pos)
#define ADC_SEQ_1_SEQ0_Pos                                                 (0UL)		/*!<ADC SEQ_1: SEQ0 (Bit 0) */
#define ADC_SEQ_1_SEQ0_Msk                                                 (0xfUL)		/*!< ADC SEQ_1: SEQ0 (Bitfield-Mask: 0x0f) */
#define ADC_SEQ_1_SEQ0                                                     ADC_SEQ_1_SEQ0_Msk
#define ADC_SEQ_1_SEQ0_0                                                   (0x1U << ADC_SEQ_1_SEQ0_Pos)
#define ADC_SEQ_1_SEQ0_1                                                   (0x2U << ADC_SEQ_1_SEQ0_Pos)
#define ADC_SEQ_1_SEQ0_2                                                   (0x4U << ADC_SEQ_1_SEQ0_Pos)
#define ADC_SEQ_1_SEQ0_3                                                   (0x8U << ADC_SEQ_1_SEQ0_Pos)

/* =====================================================    SEQ_2    =====================================================*/ 
#define ADC_SEQ_2_SEQ15_Pos                                                (28UL)		/*!<ADC SEQ_2: SEQ15 (Bit 28) */
#define ADC_SEQ_2_SEQ15_Msk                                                (0xf0000000UL)		/*!< ADC SEQ_2: SEQ15 (Bitfield-Mask: 0x0f) */
#define ADC_SEQ_2_SEQ15                                                    ADC_SEQ_2_SEQ15_Msk
#define ADC_SEQ_2_SEQ15_0                                                  (0x1U << ADC_SEQ_2_SEQ15_Pos)
#define ADC_SEQ_2_SEQ15_1                                                  (0x2U << ADC_SEQ_2_SEQ15_Pos)
#define ADC_SEQ_2_SEQ15_2                                                  (0x4U << ADC_SEQ_2_SEQ15_Pos)
#define ADC_SEQ_2_SEQ15_3                                                  (0x8U << ADC_SEQ_2_SEQ15_Pos)
#define ADC_SEQ_2_SEQ14_Pos                                                (24UL)		/*!<ADC SEQ_2: SEQ14 (Bit 24) */
#define ADC_SEQ_2_SEQ14_Msk                                                (0xf000000UL)		/*!< ADC SEQ_2: SEQ14 (Bitfield-Mask: 0x0f) */
#define ADC_SEQ_2_SEQ14                                                    ADC_SEQ_2_SEQ14_Msk
#define ADC_SEQ_2_SEQ14_0                                                  (0x1U << ADC_SEQ_2_SEQ14_Pos)
#define ADC_SEQ_2_SEQ14_1                                                  (0x2U << ADC_SEQ_2_SEQ14_Pos)
#define ADC_SEQ_2_SEQ14_2                                                  (0x4U << ADC_SEQ_2_SEQ14_Pos)
#define ADC_SEQ_2_SEQ14_3                                                  (0x8U << ADC_SEQ_2_SEQ14_Pos)
#define ADC_SEQ_2_SEQ13_Pos                                                (20UL)		/*!<ADC SEQ_2: SEQ13 (Bit 20) */
#define ADC_SEQ_2_SEQ13_Msk                                                (0xf00000UL)		/*!< ADC SEQ_2: SEQ13 (Bitfield-Mask: 0x0f) */
#define ADC_SEQ_2_SEQ13                                                    ADC_SEQ_2_SEQ13_Msk
#define ADC_SEQ_2_SEQ13_0                                                  (0x1U << ADC_SEQ_2_SEQ13_Pos)
#define ADC_SEQ_2_SEQ13_1                                                  (0x2U << ADC_SEQ_2_SEQ13_Pos)
#define ADC_SEQ_2_SEQ13_2                                                  (0x4U << ADC_SEQ_2_SEQ13_Pos)
#define ADC_SEQ_2_SEQ13_3                                                  (0x8U << ADC_SEQ_2_SEQ13_Pos)
#define ADC_SEQ_2_SEQ12_Pos                                                (16UL)		/*!<ADC SEQ_2: SEQ12 (Bit 16) */
#define ADC_SEQ_2_SEQ12_Msk                                                (0xf0000UL)		/*!< ADC SEQ_2: SEQ12 (Bitfield-Mask: 0x0f) */
#define ADC_SEQ_2_SEQ12                                                    ADC_SEQ_2_SEQ12_Msk
#define ADC_SEQ_2_SEQ12_0                                                  (0x1U << ADC_SEQ_2_SEQ12_Pos)
#define ADC_SEQ_2_SEQ12_1                                                  (0x2U << ADC_SEQ_2_SEQ12_Pos)
#define ADC_SEQ_2_SEQ12_2                                                  (0x4U << ADC_SEQ_2_SEQ12_Pos)
#define ADC_SEQ_2_SEQ12_3                                                  (0x8U << ADC_SEQ_2_SEQ12_Pos)
#define ADC_SEQ_2_SEQ11_Pos                                                (12UL)		/*!<ADC SEQ_2: SEQ11 (Bit 12) */
#define ADC_SEQ_2_SEQ11_Msk                                                (0xf000UL)		/*!< ADC SEQ_2: SEQ11 (Bitfield-Mask: 0x0f) */
#define ADC_SEQ_2_SEQ11                                                    ADC_SEQ_2_SEQ11_Msk
#define ADC_SEQ_2_SEQ11_0                                                  (0x1U << ADC_SEQ_2_SEQ11_Pos)
#define ADC_SEQ_2_SEQ11_1                                                  (0x2U << ADC_SEQ_2_SEQ11_Pos)
#define ADC_SEQ_2_SEQ11_2                                                  (0x4U << ADC_SEQ_2_SEQ11_Pos)
#define ADC_SEQ_2_SEQ11_3                                                  (0x8U << ADC_SEQ_2_SEQ11_Pos)
#define ADC_SEQ_2_SEQ10_Pos                                                (8UL)		/*!<ADC SEQ_2: SEQ10 (Bit 8) */
#define ADC_SEQ_2_SEQ10_Msk                                                (0xf00UL)		/*!< ADC SEQ_2: SEQ10 (Bitfield-Mask: 0x0f) */
#define ADC_SEQ_2_SEQ10                                                    ADC_SEQ_2_SEQ10_Msk
#define ADC_SEQ_2_SEQ10_0                                                  (0x1U << ADC_SEQ_2_SEQ10_Pos)
#define ADC_SEQ_2_SEQ10_1                                                  (0x2U << ADC_SEQ_2_SEQ10_Pos)
#define ADC_SEQ_2_SEQ10_2                                                  (0x4U << ADC_SEQ_2_SEQ10_Pos)
#define ADC_SEQ_2_SEQ10_3                                                  (0x8U << ADC_SEQ_2_SEQ10_Pos)
#define ADC_SEQ_2_SEQ9_Pos                                                 (4UL)		/*!<ADC SEQ_2: SEQ9 (Bit 4) */
#define ADC_SEQ_2_SEQ9_Msk                                                 (0xf0UL)		/*!< ADC SEQ_2: SEQ9 (Bitfield-Mask: 0x0f) */
#define ADC_SEQ_2_SEQ9                                                     ADC_SEQ_2_SEQ9_Msk
#define ADC_SEQ_2_SEQ9_0                                                   (0x1U << ADC_SEQ_2_SEQ9_Pos)
#define ADC_SEQ_2_SEQ9_1                                                   (0x2U << ADC_SEQ_2_SEQ9_Pos)
#define ADC_SEQ_2_SEQ9_2                                                   (0x4U << ADC_SEQ_2_SEQ9_Pos)
#define ADC_SEQ_2_SEQ9_3                                                   (0x8U << ADC_SEQ_2_SEQ9_Pos)
#define ADC_SEQ_2_SEQ8_Pos                                                 (0UL)		/*!<ADC SEQ_2: SEQ8 (Bit 0) */
#define ADC_SEQ_2_SEQ8_Msk                                                 (0xfUL)		/*!< ADC SEQ_2: SEQ8 (Bitfield-Mask: 0x0f) */
#define ADC_SEQ_2_SEQ8                                                     ADC_SEQ_2_SEQ8_Msk
#define ADC_SEQ_2_SEQ8_0                                                   (0x1U << ADC_SEQ_2_SEQ8_Pos)
#define ADC_SEQ_2_SEQ8_1                                                   (0x2U << ADC_SEQ_2_SEQ8_Pos)
#define ADC_SEQ_2_SEQ8_2                                                   (0x4U << ADC_SEQ_2_SEQ8_Pos)
#define ADC_SEQ_2_SEQ8_3                                                   (0x8U << ADC_SEQ_2_SEQ8_Pos)

/* =====================================================    COMP_1    =====================================================*/ 
#define ADC_COMP_1_OFFSET1_Pos                                             (12UL)		/*!<ADC COMP_1: OFFSET1 (Bit 12) */
#define ADC_COMP_1_OFFSET1_Msk                                             (0xff000UL)		/*!< ADC COMP_1: OFFSET1 (Bitfield-Mask: 0xff) */
#define ADC_COMP_1_OFFSET1                                                 ADC_COMP_1_OFFSET1_Msk
#define ADC_COMP_1_OFFSET1_0                                               (0x1U << ADC_COMP_1_OFFSET1_Pos)
#define ADC_COMP_1_OFFSET1_1                                               (0x2U << ADC_COMP_1_OFFSET1_Pos)
#define ADC_COMP_1_OFFSET1_2                                               (0x4U << ADC_COMP_1_OFFSET1_Pos)
#define ADC_COMP_1_OFFSET1_3                                               (0x8U << ADC_COMP_1_OFFSET1_Pos)
#define ADC_COMP_1_OFFSET1_4                                               (0x10U << ADC_COMP_1_OFFSET1_Pos)
#define ADC_COMP_1_OFFSET1_5                                               (0x20U << ADC_COMP_1_OFFSET1_Pos)
#define ADC_COMP_1_OFFSET1_6                                               (0x40U << ADC_COMP_1_OFFSET1_Pos)
#define ADC_COMP_1_OFFSET1_7                                               (0x80U << ADC_COMP_1_OFFSET1_Pos)
#define ADC_COMP_1_GAIN1_Pos                                               (0UL)		/*!<ADC COMP_1: GAIN1 (Bit 0) */
#define ADC_COMP_1_GAIN1_Msk                                               (0xfffUL)		/*!< ADC COMP_1: GAIN1 (Bitfield-Mask: 0xfff) */
#define ADC_COMP_1_GAIN1                                                   ADC_COMP_1_GAIN1_Msk
#define ADC_COMP_1_GAIN1_0                                                 (0x1U << ADC_COMP_1_GAIN1_Pos)
#define ADC_COMP_1_GAIN1_1                                                 (0x2U << ADC_COMP_1_GAIN1_Pos)
#define ADC_COMP_1_GAIN1_2                                                 (0x4U << ADC_COMP_1_GAIN1_Pos)
#define ADC_COMP_1_GAIN1_3                                                 (0x8U << ADC_COMP_1_GAIN1_Pos)
#define ADC_COMP_1_GAIN1_4                                                 (0x10U << ADC_COMP_1_GAIN1_Pos)
#define ADC_COMP_1_GAIN1_5                                                 (0x20U << ADC_COMP_1_GAIN1_Pos)
#define ADC_COMP_1_GAIN1_6                                                 (0x40U << ADC_COMP_1_GAIN1_Pos)
#define ADC_COMP_1_GAIN1_7                                                 (0x80U << ADC_COMP_1_GAIN1_Pos)
#define ADC_COMP_1_GAIN1_8                                                 (0x100U << ADC_COMP_1_GAIN1_Pos)
#define ADC_COMP_1_GAIN1_9                                                 (0x200U << ADC_COMP_1_GAIN1_Pos)
#define ADC_COMP_1_GAIN1_10                                                (0x400U << ADC_COMP_1_GAIN1_Pos)
#define ADC_COMP_1_GAIN1_11                                                (0x800U << ADC_COMP_1_GAIN1_Pos)

