embetech-official/embenet-demo-nucleo-wl33cc1/Drivers/CMSIS/Device/ST/STM32WL3X/Include/stm32wl33.h
/* =====================================================    COMP_SEL    =====================================================*/ 
#define ADC_COMP_SEL_OFFSET_GAIN8_Pos                                      (16UL)		/*!<ADC COMP_SEL: OFFSET_GAIN8 (Bit 16) */
#define ADC_COMP_SEL_OFFSET_GAIN8_Msk                                      (0x30000UL)		/*!< ADC COMP_SEL: OFFSET_GAIN8 (Bitfield-Mask: 0x03) */
#define ADC_COMP_SEL_OFFSET_GAIN8                                          ADC_COMP_SEL_OFFSET_GAIN8_Msk
#define ADC_COMP_SEL_OFFSET_GAIN8_0                                        (0x1U << ADC_COMP_SEL_OFFSET_GAIN8_Pos)
#define ADC_COMP_SEL_OFFSET_GAIN8_1                                        (0x2U << ADC_COMP_SEL_OFFSET_GAIN8_Pos)
#define ADC_COMP_SEL_OFFSET_GAIN7_Pos                                      (14UL)		/*!<ADC COMP_SEL: OFFSET_GAIN7 (Bit 14) */
#define ADC_COMP_SEL_OFFSET_GAIN7_Msk                                      (0xc000UL)		/*!< ADC COMP_SEL: OFFSET_GAIN7 (Bitfield-Mask: 0x03) */
#define ADC_COMP_SEL_OFFSET_GAIN7                                          ADC_COMP_SEL_OFFSET_GAIN7_Msk
#define ADC_COMP_SEL_OFFSET_GAIN7_0                                        (0x1U << ADC_COMP_SEL_OFFSET_GAIN7_Pos)
#define ADC_COMP_SEL_OFFSET_GAIN7_1                                        (0x2U << ADC_COMP_SEL_OFFSET_GAIN7_Pos)
#define ADC_COMP_SEL_OFFSET_GAIN6_Pos                                      (12UL)		/*!<ADC COMP_SEL: OFFSET_GAIN6 (Bit 12) */
#define ADC_COMP_SEL_OFFSET_GAIN6_Msk                                      (0x3000UL)		/*!< ADC COMP_SEL: OFFSET_GAIN6 (Bitfield-Mask: 0x03) */
#define ADC_COMP_SEL_OFFSET_GAIN6                                          ADC_COMP_SEL_OFFSET_GAIN6_Msk
#define ADC_COMP_SEL_OFFSET_GAIN6_0                                        (0x1U << ADC_COMP_SEL_OFFSET_GAIN6_Pos)
#define ADC_COMP_SEL_OFFSET_GAIN6_1                                        (0x2U << ADC_COMP_SEL_OFFSET_GAIN6_Pos)
#define ADC_COMP_SEL_OFFSET_GAIN5_Pos                                      (10UL)		/*!<ADC COMP_SEL: OFFSET_GAIN5 (Bit 10) */
#define ADC_COMP_SEL_OFFSET_GAIN5_Msk                                      (0xc00UL)		/*!< ADC COMP_SEL: OFFSET_GAIN5 (Bitfield-Mask: 0x03) */
#define ADC_COMP_SEL_OFFSET_GAIN5                                          ADC_COMP_SEL_OFFSET_GAIN5_Msk
#define ADC_COMP_SEL_OFFSET_GAIN5_0                                        (0x1U << ADC_COMP_SEL_OFFSET_GAIN5_Pos)
#define ADC_COMP_SEL_OFFSET_GAIN5_1                                        (0x2U << ADC_COMP_SEL_OFFSET_GAIN5_Pos)
#define ADC_COMP_SEL_OFFSET_GAIN4_Pos                                      (8UL)		/*!<ADC COMP_SEL: OFFSET_GAIN4 (Bit 8) */
#define ADC_COMP_SEL_OFFSET_GAIN4_Msk                                      (0x300UL)		/*!< ADC COMP_SEL: OFFSET_GAIN4 (Bitfield-Mask: 0x03) */
#define ADC_COMP_SEL_OFFSET_GAIN4                                          ADC_COMP_SEL_OFFSET_GAIN4_Msk
#define ADC_COMP_SEL_OFFSET_GAIN4_0                                        (0x1U << ADC_COMP_SEL_OFFSET_GAIN4_Pos)
#define ADC_COMP_SEL_OFFSET_GAIN4_1                                        (0x2U << ADC_COMP_SEL_OFFSET_GAIN4_Pos)
#define ADC_COMP_SEL_OFFSET_GAIN3_Pos                                      (6UL)		/*!<ADC COMP_SEL: OFFSET_GAIN3 (Bit 6) */
#define ADC_COMP_SEL_OFFSET_GAIN3_Msk                                      (0xc0UL)		/*!< ADC COMP_SEL: OFFSET_GAIN3 (Bitfield-Mask: 0x03) */
#define ADC_COMP_SEL_OFFSET_GAIN3                                          ADC_COMP_SEL_OFFSET_GAIN3_Msk
#define ADC_COMP_SEL_OFFSET_GAIN3_0                                        (0x1U << ADC_COMP_SEL_OFFSET_GAIN3_Pos)
#define ADC_COMP_SEL_OFFSET_GAIN3_1                                        (0x2U << ADC_COMP_SEL_OFFSET_GAIN3_Pos)
#define ADC_COMP_SEL_OFFSET_GAIN2_Pos                                      (4UL)		/*!<ADC COMP_SEL: OFFSET_GAIN2 (Bit 4) */
#define ADC_COMP_SEL_OFFSET_GAIN2_Msk                                      (0x30UL)		/*!< ADC COMP_SEL: OFFSET_GAIN2 (Bitfield-Mask: 0x03) */
#define ADC_COMP_SEL_OFFSET_GAIN2                                          ADC_COMP_SEL_OFFSET_GAIN2_Msk
#define ADC_COMP_SEL_OFFSET_GAIN2_0                                        (0x1U << ADC_COMP_SEL_OFFSET_GAIN2_Pos)
#define ADC_COMP_SEL_OFFSET_GAIN2_1                                        (0x2U << ADC_COMP_SEL_OFFSET_GAIN2_Pos)
#define ADC_COMP_SEL_OFFSET_GAIN1_Pos                                      (2UL)		/*!<ADC COMP_SEL: OFFSET_GAIN1 (Bit 2) */
#define ADC_COMP_SEL_OFFSET_GAIN1_Msk                                      (0xcUL)		/*!< ADC COMP_SEL: OFFSET_GAIN1 (Bitfield-Mask: 0x03) */
#define ADC_COMP_SEL_OFFSET_GAIN1                                          ADC_COMP_SEL_OFFSET_GAIN1_Msk
#define ADC_COMP_SEL_OFFSET_GAIN1_0                                        (0x1U << ADC_COMP_SEL_OFFSET_GAIN1_Pos)
#define ADC_COMP_SEL_OFFSET_GAIN1_1                                        (0x2U << ADC_COMP_SEL_OFFSET_GAIN1_Pos)
#define ADC_COMP_SEL_OFFSET_GAIN0_Pos                                      (0UL)		/*!<ADC COMP_SEL: OFFSET_GAIN0 (Bit 0) */
#define ADC_COMP_SEL_OFFSET_GAIN0_Msk                                      (0x3UL)		/*!< ADC COMP_SEL: OFFSET_GAIN0 (Bitfield-Mask: 0x03) */
#define ADC_COMP_SEL_OFFSET_GAIN0                                          ADC_COMP_SEL_OFFSET_GAIN0_Msk
#define ADC_COMP_SEL_OFFSET_GAIN0_0                                        (0x1U << ADC_COMP_SEL_OFFSET_GAIN0_Pos)
#define ADC_COMP_SEL_OFFSET_GAIN0_1                                        (0x2U << ADC_COMP_SEL_OFFSET_GAIN0_Pos)

/* =====================================================    WD_TH    =====================================================*/ 
#define ADC_WD_TH_WD_HT_Pos                                                (16UL)		/*!<ADC WD_TH: WD_HT (Bit 16) */
#define ADC_WD_TH_WD_HT_Msk                                                (0xfff0000UL)		/*!< ADC WD_TH: WD_HT (Bitfield-Mask: 0xfff) */
#define ADC_WD_TH_WD_HT                                                    ADC_WD_TH_WD_HT_Msk
#define ADC_WD_TH_WD_HT_0                                                  (0x1U << ADC_WD_TH_WD_HT_Pos)
#define ADC_WD_TH_WD_HT_1                                                  (0x2U << ADC_WD_TH_WD_HT_Pos)
#define ADC_WD_TH_WD_HT_2                                                  (0x4U << ADC_WD_TH_WD_HT_Pos)
#define ADC_WD_TH_WD_HT_3                                                  (0x8U << ADC_WD_TH_WD_HT_Pos)
#define ADC_WD_TH_WD_HT_4                                                  (0x10U << ADC_WD_TH_WD_HT_Pos)
#define ADC_WD_TH_WD_HT_5                                                  (0x20U << ADC_WD_TH_WD_HT_Pos)
#define ADC_WD_TH_WD_HT_6                                                  (0x40U << ADC_WD_TH_WD_HT_Pos)
#define ADC_WD_TH_WD_HT_7                                                  (0x80U << ADC_WD_TH_WD_HT_Pos)
#define ADC_WD_TH_WD_HT_8                                                  (0x100U << ADC_WD_TH_WD_HT_Pos)
#define ADC_WD_TH_WD_HT_9                                                  (0x200U << ADC_WD_TH_WD_HT_Pos)
#define ADC_WD_TH_WD_HT_10                                                 (0x400U << ADC_WD_TH_WD_HT_Pos)
#define ADC_WD_TH_WD_HT_11                                                 (0x800U << ADC_WD_TH_WD_HT_Pos)
#define ADC_WD_TH_WD_LT_Pos                                                (0UL)		/*!<ADC WD_TH: WD_LT (Bit 0) */
#define ADC_WD_TH_WD_LT_Msk                                                (0xfffUL)		/*!< ADC WD_TH: WD_LT (Bitfield-Mask: 0xfff) */
#define ADC_WD_TH_WD_LT                                                    ADC_WD_TH_WD_LT_Msk
#define ADC_WD_TH_WD_LT_0                                                  (0x1U << ADC_WD_TH_WD_LT_Pos)
#define ADC_WD_TH_WD_LT_1                                                  (0x2U << ADC_WD_TH_WD_LT_Pos)
#define ADC_WD_TH_WD_LT_2                                                  (0x4U << ADC_WD_TH_WD_LT_Pos)
#define ADC_WD_TH_WD_LT_3                                                  (0x8U << ADC_WD_TH_WD_LT_Pos)
#define ADC_WD_TH_WD_LT_4                                                  (0x10U << ADC_WD_TH_WD_LT_Pos)
#define ADC_WD_TH_WD_LT_5                                                  (0x20U << ADC_WD_TH_WD_LT_Pos)
#define ADC_WD_TH_WD_LT_6                                                  (0x40U << ADC_WD_TH_WD_LT_Pos)
#define ADC_WD_TH_WD_LT_7                                                  (0x80U << ADC_WD_TH_WD_LT_Pos)
#define ADC_WD_TH_WD_LT_8                                                  (0x100U << ADC_WD_TH_WD_LT_Pos)
#define ADC_WD_TH_WD_LT_9                                                  (0x200U << ADC_WD_TH_WD_LT_Pos)
#define ADC_WD_TH_WD_LT_10                                                 (0x400U << ADC_WD_TH_WD_LT_Pos)
#define ADC_WD_TH_WD_LT_11                                                 (0x800U << ADC_WD_TH_WD_LT_Pos)

/* =====================================================    WD_CONF    =====================================================*/ 
#define ADC_WD_CONF_AWD_CHX_Pos                                            (0UL)		/*!<ADC WD_CONF: AWD_CHX (Bit 0) */
#define ADC_WD_CONF_AWD_CHX_Msk                                            (0xffffUL)		/*!< ADC WD_CONF: AWD_CHX (Bitfield-Mask: 0xffff) */
#define ADC_WD_CONF_AWD_CHX                                                ADC_WD_CONF_AWD_CHX_Msk
#define ADC_WD_CONF_AWD_CHX_0                                              (0x1U << ADC_WD_CONF_AWD_CHX_Pos)
#define ADC_WD_CONF_AWD_CHX_1                                              (0x2U << ADC_WD_CONF_AWD_CHX_Pos)
#define ADC_WD_CONF_AWD_CHX_2                                              (0x4U << ADC_WD_CONF_AWD_CHX_Pos)
#define ADC_WD_CONF_AWD_CHX_3                                              (0x8U << ADC_WD_CONF_AWD_CHX_Pos)
#define ADC_WD_CONF_AWD_CHX_4                                              (0x10U << ADC_WD_CONF_AWD_CHX_Pos)
#define ADC_WD_CONF_AWD_CHX_5                                              (0x20U << ADC_WD_CONF_AWD_CHX_Pos)
#define ADC_WD_CONF_AWD_CHX_6                                              (0x40U << ADC_WD_CONF_AWD_CHX_Pos)
#define ADC_WD_CONF_AWD_CHX_7                                              (0x80U << ADC_WD_CONF_AWD_CHX_Pos)
#define ADC_WD_CONF_AWD_CHX_8                                              (0x100U << ADC_WD_CONF_AWD_CHX_Pos)
#define ADC_WD_CONF_AWD_CHX_9                                              (0x200U << ADC_WD_CONF_AWD_CHX_Pos)
#define ADC_WD_CONF_AWD_CHX_10                                             (0x400U << ADC_WD_CONF_AWD_CHX_Pos)
#define ADC_WD_CONF_AWD_CHX_11                                             (0x800U << ADC_WD_CONF_AWD_CHX_Pos)
#define ADC_WD_CONF_AWD_CHX_12                                             (0x1000U << ADC_WD_CONF_AWD_CHX_Pos)
#define ADC_WD_CONF_AWD_CHX_13                                             (0x2000U << ADC_WD_CONF_AWD_CHX_Pos)
#define ADC_WD_CONF_AWD_CHX_14                                             (0x4000U << ADC_WD_CONF_AWD_CHX_Pos)
#define ADC_WD_CONF_AWD_CHX_15                                             (0x8000U << ADC_WD_CONF_AWD_CHX_Pos)

/* =====================================================    DS_DATAOUT    =====================================================*/ 
#define ADC_DS_DATAOUT_DS_DATA_Pos                                         (0UL)		/*!<ADC DS_DATAOUT: DS_DATA (Bit 0) */
#define ADC_DS_DATAOUT_DS_DATA_Msk                                         (0xffffUL)		/*!< ADC DS_DATAOUT: DS_DATA (Bitfield-Mask: 0xffff) */
#define ADC_DS_DATAOUT_DS_DATA                                             ADC_DS_DATAOUT_DS_DATA_Msk
#define ADC_DS_DATAOUT_DS_DATA_0                                           (0x1U << ADC_DS_DATAOUT_DS_DATA_Pos)
#define ADC_DS_DATAOUT_DS_DATA_1                                           (0x2U << ADC_DS_DATAOUT_DS_DATA_Pos)
#define ADC_DS_DATAOUT_DS_DATA_2                                           (0x4U << ADC_DS_DATAOUT_DS_DATA_Pos)
#define ADC_DS_DATAOUT_DS_DATA_3                                           (0x8U << ADC_DS_DATAOUT_DS_DATA_Pos)
#define ADC_DS_DATAOUT_DS_DATA_4                                           (0x10U << ADC_DS_DATAOUT_DS_DATA_Pos)
#define ADC_DS_DATAOUT_DS_DATA_5                                           (0x20U << ADC_DS_DATAOUT_DS_DATA_Pos)
#define ADC_DS_DATAOUT_DS_DATA_6                                           (0x40U << ADC_DS_DATAOUT_DS_DATA_Pos)
#define ADC_DS_DATAOUT_DS_DATA_7                                           (0x80U << ADC_DS_DATAOUT_DS_DATA_Pos)
#define ADC_DS_DATAOUT_DS_DATA_8                                           (0x100U << ADC_DS_DATAOUT_DS_DATA_Pos)
#define ADC_DS_DATAOUT_DS_DATA_9                                           (0x200U << ADC_DS_DATAOUT_DS_DATA_Pos)
#define ADC_DS_DATAOUT_DS_DATA_10                                          (0x400U << ADC_DS_DATAOUT_DS_DATA_Pos)
#define ADC_DS_DATAOUT_DS_DATA_11                                          (0x800U << ADC_DS_DATAOUT_DS_DATA_Pos)
#define ADC_DS_DATAOUT_DS_DATA_12                                          (0x1000U << ADC_DS_DATAOUT_DS_DATA_Pos)
#define ADC_DS_DATAOUT_DS_DATA_13                                          (0x2000U << ADC_DS_DATAOUT_DS_DATA_Pos)
#define ADC_DS_DATAOUT_DS_DATA_14                                          (0x4000U << ADC_DS_DATAOUT_DS_DATA_Pos)
#define ADC_DS_DATAOUT_DS_DATA_15                                          (0x8000U << ADC_DS_DATAOUT_DS_DATA_Pos)

/* =====================================================    IRQ_STATUS    =====================================================*/ 
#define ADC_IRQ_STATUS_OVR_DS_IRQ_Pos                                      (5UL)		/*!<ADC IRQ_STATUS: OVR_DS_IRQ (Bit 5) */
#define ADC_IRQ_STATUS_OVR_DS_IRQ_Msk                                      (0x20UL)		/*!< ADC IRQ_STATUS: OVR_DS_IRQ (Bitfield-Mask: 0x01) */
#define ADC_IRQ_STATUS_OVR_DS_IRQ                                          ADC_IRQ_STATUS_OVR_DS_IRQ_Msk
#define ADC_IRQ_STATUS_AWD_IRQ_Pos                                         (4UL)		/*!<ADC IRQ_STATUS: AWD_IRQ (Bit 4) */
#define ADC_IRQ_STATUS_AWD_IRQ_Msk                                         (0x10UL)		/*!< ADC IRQ_STATUS: AWD_IRQ (Bitfield-Mask: 0x01) */
#define ADC_IRQ_STATUS_AWD_IRQ                                             ADC_IRQ_STATUS_AWD_IRQ_Msk
#define ADC_IRQ_STATUS_EOS_IRQ_Pos                                         (3UL)		/*!<ADC IRQ_STATUS: EOS_IRQ (Bit 3) */
#define ADC_IRQ_STATUS_EOS_IRQ_Msk                                         (0x8UL)		/*!< ADC IRQ_STATUS: EOS_IRQ (Bitfield-Mask: 0x01) */
#define ADC_IRQ_STATUS_EOS_IRQ                                             ADC_IRQ_STATUS_EOS_IRQ_Msk
#define ADC_IRQ_STATUS_EODS_IRQ_Pos                                        (1UL)		/*!<ADC IRQ_STATUS: EODS_IRQ (Bit 1) */
#define ADC_IRQ_STATUS_EODS_IRQ_Msk                                        (0x2UL)		/*!< ADC IRQ_STATUS: EODS_IRQ (Bitfield-Mask: 0x01) */
#define ADC_IRQ_STATUS_EODS_IRQ                                            ADC_IRQ_STATUS_EODS_IRQ_Msk
#define ADC_IRQ_STATUS_EOC_IRQ_Pos                                         (0UL)		/*!<ADC IRQ_STATUS: EOC_IRQ (Bit 0) */
#define ADC_IRQ_STATUS_EOC_IRQ_Msk                                         (0x1UL)		/*!< ADC IRQ_STATUS: EOC_IRQ (Bitfield-Mask: 0x01) */
#define ADC_IRQ_STATUS_EOC_IRQ                                             ADC_IRQ_STATUS_EOC_IRQ_Msk

/* =====================================================    IRQ_ENABLE    =====================================================*/ 
#define ADC_IRQ_ENABLE_OVR_DS_IRQ_ENA_Pos                                  (5UL)		/*!<ADC IRQ_ENABLE: OVR_DS_IRQ_ENA (Bit 5) */
#define ADC_IRQ_ENABLE_OVR_DS_IRQ_ENA_Msk                                  (0x20UL)		/*!< ADC IRQ_ENABLE: OVR_DS_IRQ_ENA (Bitfield-Mask: 0x01) */
#define ADC_IRQ_ENABLE_OVR_DS_IRQ_ENA                                      ADC_IRQ_ENABLE_OVR_DS_IRQ_ENA_Msk
#define ADC_IRQ_ENABLE_AWD_IRQ_ENA_Pos                                     (4UL)		/*!<ADC IRQ_ENABLE: AWD_IRQ_ENA (Bit 4) */
#define ADC_IRQ_ENABLE_AWD_IRQ_ENA_Msk                                     (0x10UL)		/*!< ADC IRQ_ENABLE: AWD_IRQ_ENA (Bitfield-Mask: 0x01) */
#define ADC_IRQ_ENABLE_AWD_IRQ_ENA                                         ADC_IRQ_ENABLE_AWD_IRQ_ENA_Msk
#define ADC_IRQ_ENABLE_EOS_IRQ_ENA_Pos                                     (3UL)		/*!<ADC IRQ_ENABLE: EOS_IRQ_ENA (Bit 3) */
#define ADC_IRQ_ENABLE_EOS_IRQ_ENA_Msk                                     (0x8UL)		/*!< ADC IRQ_ENABLE: EOS_IRQ_ENA (Bitfield-Mask: 0x01) */
#define ADC_IRQ_ENABLE_EOS_IRQ_ENA                                         ADC_IRQ_ENABLE_EOS_IRQ_ENA_Msk
#define ADC_IRQ_ENABLE_EODS_IRQ_ENA_Pos                                    (1UL)		/*!<ADC IRQ_ENABLE: EODS_IRQ_ENA (Bit 1) */
#define ADC_IRQ_ENABLE_EODS_IRQ_ENA_Msk                                    (0x2UL)		/*!< ADC IRQ_ENABLE: EODS_IRQ_ENA (Bitfield-Mask: 0x01) */
#define ADC_IRQ_ENABLE_EODS_IRQ_ENA                                        ADC_IRQ_ENABLE_EODS_IRQ_ENA_Msk
#define ADC_IRQ_ENABLE_EOC_IRQ_ENA_Pos                                     (0UL)		/*!<ADC IRQ_ENABLE: EOC_IRQ_ENA (Bit 0) */
#define ADC_IRQ_ENABLE_EOC_IRQ_ENA_Msk                                     (0x1UL)		/*!< ADC IRQ_ENABLE: EOC_IRQ_ENA (Bitfield-Mask: 0x01) */
#define ADC_IRQ_ENABLE_EOC_IRQ_ENA                                         ADC_IRQ_ENABLE_EOC_IRQ_ENA_Msk


