embetech-official/embenet-demo-nucleo-wl33cc1/Drivers/CMSIS/Device/ST/STM32WL3X/Include/stm32wl33.h
/* =====================================================    CSSWCR    =====================================================*/ 
#define RCC_CSSWCR_HSITRIMSW_Pos                                           (24UL)		/*!<RCC CSSWCR: HSITRIMSW (Bit 24) */
#define RCC_CSSWCR_HSITRIMSW_Msk                                           (0x3f000000UL)		/*!< RCC CSSWCR: HSITRIMSW (Bitfield-Mask: 0x3f) */
#define RCC_CSSWCR_HSITRIMSW                                               RCC_CSSWCR_HSITRIMSW_Msk
#define RCC_CSSWCR_HSITRIMSW_0                                             (0x1U << RCC_CSSWCR_HSITRIMSW_Pos)
#define RCC_CSSWCR_HSITRIMSW_1                                             (0x2U << RCC_CSSWCR_HSITRIMSW_Pos)
#define RCC_CSSWCR_HSITRIMSW_2                                             (0x4U << RCC_CSSWCR_HSITRIMSW_Pos)
#define RCC_CSSWCR_HSITRIMSW_3                                             (0x8U << RCC_CSSWCR_HSITRIMSW_Pos)
#define RCC_CSSWCR_HSITRIMSW_4                                             (0x10U << RCC_CSSWCR_HSITRIMSW_Pos)
#define RCC_CSSWCR_HSITRIMSW_5                                             (0x20U << RCC_CSSWCR_HSITRIMSW_Pos)
#define RCC_CSSWCR_HSISWTRIMEN_Pos                                         (23UL)		/*!<RCC CSSWCR: HSISWTRIMEN (Bit 23) */
#define RCC_CSSWCR_HSISWTRIMEN_Msk                                         (0x800000UL)		/*!< RCC CSSWCR: HSISWTRIMEN (Bitfield-Mask: 0x01) */
#define RCC_CSSWCR_HSISWTRIMEN                                             RCC_CSSWCR_HSISWTRIMEN_Msk
#define RCC_CSSWCR_LSEDRV_Pos                                              (5UL)		/*!<RCC CSSWCR: LSEDRV (Bit 5) */
#define RCC_CSSWCR_LSEDRV_Msk                                              (0x60UL)		/*!< RCC CSSWCR: LSEDRV (Bitfield-Mask: 0x03) */
#define RCC_CSSWCR_LSEDRV                                                  RCC_CSSWCR_LSEDRV_Msk
#define RCC_CSSWCR_LSEDRV_0                                                (0x1U << RCC_CSSWCR_LSEDRV_Pos)
#define RCC_CSSWCR_LSEDRV_1                                                (0x2U << RCC_CSSWCR_LSEDRV_Pos)
#define RCC_CSSWCR_LSISWBW_Pos                                             (1UL)		/*!<RCC CSSWCR: LSISWBW (Bit 1) */
#define RCC_CSSWCR_LSISWBW_Msk                                             (0x1eUL)		/*!< RCC CSSWCR: LSISWBW (Bitfield-Mask: 0x0f) */
#define RCC_CSSWCR_LSISWBW                                                 RCC_CSSWCR_LSISWBW_Msk
#define RCC_CSSWCR_LSISWBW_0                                               (0x1U << RCC_CSSWCR_LSISWBW_Pos)
#define RCC_CSSWCR_LSISWBW_1                                               (0x2U << RCC_CSSWCR_LSISWBW_Pos)
#define RCC_CSSWCR_LSISWBW_2                                               (0x4U << RCC_CSSWCR_LSISWBW_Pos)
#define RCC_CSSWCR_LSISWBW_3                                               (0x8U << RCC_CSSWCR_LSISWBW_Pos)
#define RCC_CSSWCR_LSISWTRIMEN_Pos                                         (0UL)		/*!<RCC CSSWCR: LSISWTRIMEN (Bit 0) */
#define RCC_CSSWCR_LSISWTRIMEN_Msk                                         (0x1UL)		/*!< RCC CSSWCR: LSISWTRIMEN (Bitfield-Mask: 0x01) */
#define RCC_CSSWCR_LSISWTRIMEN                                             RCC_CSSWCR_LSISWTRIMEN_Msk

/* =====================================================    KRMR    =====================================================*/ 
#define RCC_KRMR_KRM_Pos                                                   (1UL)		/*!<RCC KRMR: KRM (Bit 1) */
#define RCC_KRMR_KRM_Msk                                                   (0xfffeUL)		/*!< RCC KRMR: KRM (Bitfield-Mask: 0x7fff) */
#define RCC_KRMR_KRM                                                       RCC_KRMR_KRM_Msk
#define RCC_KRMR_KRM_0                                                     (0x1U << RCC_KRMR_KRM_Pos)
#define RCC_KRMR_KRM_1                                                     (0x2U << RCC_KRMR_KRM_Pos)
#define RCC_KRMR_KRM_2                                                     (0x4U << RCC_KRMR_KRM_Pos)
#define RCC_KRMR_KRM_3                                                     (0x8U << RCC_KRMR_KRM_Pos)
#define RCC_KRMR_KRM_4                                                     (0x10U << RCC_KRMR_KRM_Pos)
#define RCC_KRMR_KRM_5                                                     (0x20U << RCC_KRMR_KRM_Pos)
#define RCC_KRMR_KRM_6                                                     (0x40U << RCC_KRMR_KRM_Pos)
#define RCC_KRMR_KRM_7                                                     (0x80U << RCC_KRMR_KRM_Pos)
#define RCC_KRMR_KRM_8                                                     (0x100U << RCC_KRMR_KRM_Pos)
#define RCC_KRMR_KRM_9                                                     (0x200U << RCC_KRMR_KRM_Pos)
#define RCC_KRMR_KRM_10                                                    (0x400U << RCC_KRMR_KRM_Pos)
#define RCC_KRMR_KRM_11                                                    (0x800U << RCC_KRMR_KRM_Pos)
#define RCC_KRMR_KRM_12                                                    (0x1000U << RCC_KRMR_KRM_Pos)
#define RCC_KRMR_KRM_13                                                    (0x2000U << RCC_KRMR_KRM_Pos)
#define RCC_KRMR_KRM_14                                                    (0x4000U << RCC_KRMR_KRM_Pos)
#define RCC_KRMR_KRM_EN_Pos                                                (0UL)		/*!<RCC KRMR: KRM_EN (Bit 0) */
#define RCC_KRMR_KRM_EN_Msk                                                (0x1UL)		/*!< RCC KRMR: KRM_EN (Bitfield-Mask: 0x01) */
#define RCC_KRMR_KRM_EN                                                    RCC_KRMR_KRM_EN_Msk

/* =====================================================    CIER    =====================================================*/ 
#define RCC_CIER_LCSCRSTIE_Pos                                             (13UL)		/*!<RCC CIER: LCSCRSTIE (Bit 13) */
#define RCC_CIER_LCSCRSTIE_Msk                                             (0x2000UL)		/*!< RCC CIER: LCSCRSTIE (Bitfield-Mask: 0x01) */
#define RCC_CIER_LCSCRSTIE                                                 RCC_CIER_LCSCRSTIE_Msk
#define RCC_CIER_LCDRSTIE_Pos                                              (10UL)		/*!<RCC CIER: LCDRSTIE (Bit 10) */
#define RCC_CIER_LCDRSTIE_Msk                                              (0x400UL)		/*!< RCC CIER: LCDRSTIE (Bitfield-Mask: 0x01) */
#define RCC_CIER_LCDRSTIE                                                  RCC_CIER_LCDRSTIE_Msk
#define RCC_CIER_LPURSTIE_Pos                                              (9UL)		/*!<RCC CIER: LPURSTIE (Bit 9) */
#define RCC_CIER_LPURSTIE_Msk                                              (0x200UL)		/*!< RCC CIER: LPURSTIE (Bitfield-Mask: 0x01) */
#define RCC_CIER_LPURSTIE                                                  RCC_CIER_LPURSTIE_Msk
#define RCC_CIER_WDGRSTIE_Pos                                              (8UL)		/*!<RCC CIER: WDGRSTIE (Bit 8) */
#define RCC_CIER_WDGRSTIE_Msk                                              (0x100UL)		/*!< RCC CIER: WDGRSTIE (Bitfield-Mask: 0x01) */
#define RCC_CIER_WDGRSTIE                                                  RCC_CIER_WDGRSTIE_Msk
#define RCC_CIER_RTCRSTIE_Pos                                              (7UL)		/*!<RCC CIER: RTCRSTIE (Bit 7) */
#define RCC_CIER_RTCRSTIE_Msk                                              (0x80UL)		/*!< RCC CIER: RTCRSTIE (Bitfield-Mask: 0x01) */
#define RCC_CIER_RTCRSTIE                                                  RCC_CIER_RTCRSTIE_Msk
#define RCC_CIER_HSIPLLUNLOCKDETIE_Pos                                     (6UL)		/*!<RCC CIER: HSIPLLUNLOCKDETIE (Bit 6) */
#define RCC_CIER_HSIPLLUNLOCKDETIE_Msk                                     (0x40UL)		/*!< RCC CIER: HSIPLLUNLOCKDETIE (Bitfield-Mask: 0x01) */
#define RCC_CIER_HSIPLLUNLOCKDETIE                                         RCC_CIER_HSIPLLUNLOCKDETIE_Msk
#define RCC_CIER_HSIPLLRDYIE_Pos                                           (5UL)		/*!<RCC CIER: HSIPLLRDYIE (Bit 5) */
#define RCC_CIER_HSIPLLRDYIE_Msk                                           (0x20UL)		/*!< RCC CIER: HSIPLLRDYIE (Bitfield-Mask: 0x01) */
#define RCC_CIER_HSIPLLRDYIE                                               RCC_CIER_HSIPLLRDYIE_Msk
#define RCC_CIER_HSERDYIE_Pos                                              (4UL)		/*!<RCC CIER: HSERDYIE (Bit 4) */
#define RCC_CIER_HSERDYIE_Msk                                              (0x10UL)		/*!< RCC CIER: HSERDYIE (Bitfield-Mask: 0x01) */
#define RCC_CIER_HSERDYIE                                                  RCC_CIER_HSERDYIE_Msk
#define RCC_CIER_HSIRDYIE_Pos                                              (3UL)		/*!<RCC CIER: HSIRDYIE (Bit 3) */
#define RCC_CIER_HSIRDYIE_Msk                                              (0x8UL)		/*!< RCC CIER: HSIRDYIE (Bitfield-Mask: 0x01) */
#define RCC_CIER_HSIRDYIE                                                  RCC_CIER_HSIRDYIE_Msk
#define RCC_CIER_LSERDYIE_Pos                                              (1UL)		/*!<RCC CIER: LSERDYIE (Bit 1) */
#define RCC_CIER_LSERDYIE_Msk                                              (0x2UL)		/*!< RCC CIER: LSERDYIE (Bitfield-Mask: 0x01) */
#define RCC_CIER_LSERDYIE                                                  RCC_CIER_LSERDYIE_Msk
#define RCC_CIER_LSIRDYIE_Pos                                              (0UL)		/*!<RCC CIER: LSIRDYIE (Bit 0) */
#define RCC_CIER_LSIRDYIE_Msk                                              (0x1UL)		/*!< RCC CIER: LSIRDYIE (Bitfield-Mask: 0x01) */
#define RCC_CIER_LSIRDYIE                                                  RCC_CIER_LSIRDYIE_Msk

/* =====================================================    CIFR    =====================================================*/ 
#define RCC_CIFR_LCSCRSTF_Pos                                              (13UL)		/*!<RCC CIFR: LCSCRSTF (Bit 13) */
#define RCC_CIFR_LCSCRSTF_Msk                                              (0x2000UL)		/*!< RCC CIFR: LCSCRSTF (Bitfield-Mask: 0x01) */
#define RCC_CIFR_LCSCRSTF                                                  RCC_CIFR_LCSCRSTF_Msk
#define RCC_CIFR_LCDRSTF_Pos                                               (10UL)		/*!<RCC CIFR: LCDRSTF (Bit 10) */
#define RCC_CIFR_LCDRSTF_Msk                                               (0x400UL)		/*!< RCC CIFR: LCDRSTF (Bitfield-Mask: 0x01) */
#define RCC_CIFR_LCDRSTF                                                   RCC_CIFR_LCDRSTF_Msk
#define RCC_CIFR_LPURSTF_Pos                                               (9UL)		/*!<RCC CIFR: LPURSTF (Bit 9) */
#define RCC_CIFR_LPURSTF_Msk                                               (0x200UL)		/*!< RCC CIFR: LPURSTF (Bitfield-Mask: 0x01) */
#define RCC_CIFR_LPURSTF                                                   RCC_CIFR_LPURSTF_Msk
#define RCC_CIFR_WDGRSTF_Pos                                               (8UL)		/*!<RCC CIFR: WDGRSTF (Bit 8) */
#define RCC_CIFR_WDGRSTF_Msk                                               (0x100UL)		/*!< RCC CIFR: WDGRSTF (Bitfield-Mask: 0x01) */
#define RCC_CIFR_WDGRSTF                                                   RCC_CIFR_WDGRSTF_Msk
#define RCC_CIFR_RTCRSTF_Pos                                               (7UL)		/*!<RCC CIFR: RTCRSTF (Bit 7) */
#define RCC_CIFR_RTCRSTF_Msk                                               (0x80UL)		/*!< RCC CIFR: RTCRSTF (Bitfield-Mask: 0x01) */
#define RCC_CIFR_RTCRSTF                                                   RCC_CIFR_RTCRSTF_Msk
#define RCC_CIFR_HSIPLLUNLOCKDETF_Pos                                      (6UL)		/*!<RCC CIFR: HSIPLLUNLOCKDETF (Bit 6) */
#define RCC_CIFR_HSIPLLUNLOCKDETF_Msk                                      (0x40UL)		/*!< RCC CIFR: HSIPLLUNLOCKDETF (Bitfield-Mask: 0x01) */
#define RCC_CIFR_HSIPLLUNLOCKDETF                                          RCC_CIFR_HSIPLLUNLOCKDETF_Msk
#define RCC_CIFR_HSIPLLRDYF_Pos                                            (5UL)		/*!<RCC CIFR: HSIPLLRDYF (Bit 5) */
#define RCC_CIFR_HSIPLLRDYF_Msk                                            (0x20UL)		/*!< RCC CIFR: HSIPLLRDYF (Bitfield-Mask: 0x01) */
#define RCC_CIFR_HSIPLLRDYF                                                RCC_CIFR_HSIPLLRDYF_Msk
#define RCC_CIFR_HSERDYF_Pos                                               (4UL)		/*!<RCC CIFR: HSERDYF (Bit 4) */
#define RCC_CIFR_HSERDYF_Msk                                               (0x10UL)		/*!< RCC CIFR: HSERDYF (Bitfield-Mask: 0x01) */
#define RCC_CIFR_HSERDYF                                                   RCC_CIFR_HSERDYF_Msk
#define RCC_CIFR_HSIRDYF_Pos                                               (3UL)		/*!<RCC CIFR: HSIRDYF (Bit 3) */
#define RCC_CIFR_HSIRDYF_Msk                                               (0x8UL)		/*!< RCC CIFR: HSIRDYF (Bitfield-Mask: 0x01) */
#define RCC_CIFR_HSIRDYF                                                   RCC_CIFR_HSIRDYF_Msk
#define RCC_CIFR_LSERDYF_Pos                                               (1UL)		/*!<RCC CIFR: LSERDYF (Bit 1) */
#define RCC_CIFR_LSERDYF_Msk                                               (0x2UL)		/*!< RCC CIFR: LSERDYF (Bitfield-Mask: 0x01) */
#define RCC_CIFR_LSERDYF                                                   RCC_CIFR_LSERDYF_Msk
#define RCC_CIFR_LSIRDYF_Pos                                               (0UL)		/*!<RCC CIFR: LSIRDYF (Bit 0) */
#define RCC_CIFR_LSIRDYF_Msk                                               (0x1UL)		/*!< RCC CIFR: LSIRDYF (Bitfield-Mask: 0x01) */
#define RCC_CIFR_LSIRDYF                                                   RCC_CIFR_LSIRDYF_Msk

/* =====================================================    CSCMDR    =====================================================*/ 
#define RCC_CSCMDR_EOFSEQ_IRQ_Pos                                          (7UL)		/*!<RCC CSCMDR: EOFSEQ_IRQ (Bit 7) */
#define RCC_CSCMDR_EOFSEQ_IRQ_Msk                                          (0x80UL)		/*!< RCC CSCMDR: EOFSEQ_IRQ (Bitfield-Mask: 0x01) */
#define RCC_CSCMDR_EOFSEQ_IRQ                                              RCC_CSCMDR_EOFSEQ_IRQ_Msk
#define RCC_CSCMDR_EOFSEQ_IE_Pos                                           (6UL)		/*!<RCC CSCMDR: EOFSEQ_IE (Bit 6) */
#define RCC_CSCMDR_EOFSEQ_IE_Msk                                           (0x40UL)		/*!< RCC CSCMDR: EOFSEQ_IE (Bitfield-Mask: 0x01) */
#define RCC_CSCMDR_EOFSEQ_IE                                               RCC_CSCMDR_EOFSEQ_IE_Msk
#define RCC_CSCMDR_STATUS_Pos                                              (4UL)		/*!<RCC CSCMDR: STATUS (Bit 4) */
#define RCC_CSCMDR_STATUS_Msk                                              (0x30UL)		/*!< RCC CSCMDR: STATUS (Bitfield-Mask: 0x03) */
#define RCC_CSCMDR_STATUS                                                  RCC_CSCMDR_STATUS_Msk
#define RCC_CSCMDR_STATUS_0                                                (0x1U << RCC_CSCMDR_STATUS_Pos)
#define RCC_CSCMDR_STATUS_1                                                (0x2U << RCC_CSCMDR_STATUS_Pos)
#define RCC_CSCMDR_CLKSYSDIV_REQ_Pos                                       (1UL)		/*!<RCC CSCMDR: CLKSYSDIV_REQ (Bit 1) */
#define RCC_CSCMDR_CLKSYSDIV_REQ_Msk                                       (0xeUL)		/*!< RCC CSCMDR: CLKSYSDIV_REQ (Bitfield-Mask: 0x07) */
#define RCC_CSCMDR_CLKSYSDIV_REQ                                           RCC_CSCMDR_CLKSYSDIV_REQ_Msk
#define RCC_CSCMDR_CLKSYSDIV_REQ_0                                         (0x1U << RCC_CSCMDR_CLKSYSDIV_REQ_Pos)
#define RCC_CSCMDR_CLKSYSDIV_REQ_1                                         (0x2U << RCC_CSCMDR_CLKSYSDIV_REQ_Pos)
#define RCC_CSCMDR_CLKSYSDIV_REQ_2                                         (0x4U << RCC_CSCMDR_CLKSYSDIV_REQ_Pos)
#define RCC_CSCMDR_REQUEST_Pos                                             (0UL)		/*!<RCC CSCMDR: REQUEST (Bit 0) */
#define RCC_CSCMDR_REQUEST_Msk                                             (0x1UL)		/*!< RCC CSCMDR: REQUEST (Bitfield-Mask: 0x01) */
#define RCC_CSCMDR_REQUEST                                                 RCC_CSCMDR_REQUEST_Msk

/* =====================================================    AHBRSTR    =====================================================*/ 
#define RCC_AHBRSTR_AESRST_Pos                                             (20UL)		/*!<RCC AHBRSTR: AESRST (Bit 20) */
#define RCC_AHBRSTR_AESRST_Msk                                             (0x100000UL)		/*!< RCC AHBRSTR: AESRST (Bitfield-Mask: 0x01) */
#define RCC_AHBRSTR_AESRST                                                 RCC_AHBRSTR_AESRST_Msk
#define RCC_AHBRSTR_RNGRST_Pos                                             (18UL)		/*!<RCC AHBRSTR: RNGRST (Bit 18) */
#define RCC_AHBRSTR_RNGRST_Msk                                             (0x40000UL)		/*!< RCC AHBRSTR: RNGRST (Bitfield-Mask: 0x01) */
#define RCC_AHBRSTR_RNGRST                                                 RCC_AHBRSTR_RNGRST_Msk
#define RCC_AHBRSTR_CRCRST_Pos                                             (12UL)		/*!<RCC AHBRSTR: CRCRST (Bit 12) */
#define RCC_AHBRSTR_CRCRST_Msk                                             (0x1000UL)		/*!< RCC AHBRSTR: CRCRST (Bitfield-Mask: 0x01) */
#define RCC_AHBRSTR_CRCRST                                                 RCC_AHBRSTR_CRCRST_Msk
#define RCC_AHBRSTR_GPIOBRST_Pos                                           (3UL)		/*!<RCC AHBRSTR: GPIOBRST (Bit 3) */
#define RCC_AHBRSTR_GPIOBRST_Msk                                           (0x8UL)		/*!< RCC AHBRSTR: GPIOBRST (Bitfield-Mask: 0x01) */
#define RCC_AHBRSTR_GPIOBRST                                               RCC_AHBRSTR_GPIOBRST_Msk
#define RCC_AHBRSTR_GPIOARST_Pos                                           (2UL)		/*!<RCC AHBRSTR: GPIOARST (Bit 2) */
#define RCC_AHBRSTR_GPIOARST_Msk                                           (0x4UL)		/*!< RCC AHBRSTR: GPIOARST (Bitfield-Mask: 0x01) */
#define RCC_AHBRSTR_GPIOARST                                               RCC_AHBRSTR_GPIOARST_Msk
#define RCC_AHBRSTR_DMARST_Pos                                             (0UL)		/*!<RCC AHBRSTR: DMARST (Bit 0) */
#define RCC_AHBRSTR_DMARST_Msk                                             (0x1UL)		/*!< RCC AHBRSTR: DMARST (Bitfield-Mask: 0x01) */
#define RCC_AHBRSTR_DMARST                                                 RCC_AHBRSTR_DMARST_Msk

