embetech-official/embenet-demo-nucleo-wl33cc1/Drivers/CMSIS/Device/ST/STM32WL3X/Include/stm32wl33.h
/* =====================================================    EWUB    =====================================================*/ 
#define PWR_EWUB_EWU15_Pos                                                 (15UL)		/*!<PWR EWUB: EWU15 (Bit 15) */
#define PWR_EWUB_EWU15_Msk                                                 (0x8000UL)		/*!< PWR EWUB: EWU15 (Bitfield-Mask: 0x01) */
#define PWR_EWUB_EWU15                                                     PWR_EWUB_EWU15_Msk
#define PWR_EWUB_EWU14_Pos                                                 (14UL)		/*!<PWR EWUB: EWU14 (Bit 14) */
#define PWR_EWUB_EWU14_Msk                                                 (0x4000UL)		/*!< PWR EWUB: EWU14 (Bitfield-Mask: 0x01) */
#define PWR_EWUB_EWU14                                                     PWR_EWUB_EWU14_Msk
#define PWR_EWUB_EWU13_Pos                                                 (13UL)		/*!<PWR EWUB: EWU13 (Bit 13) */
#define PWR_EWUB_EWU13_Msk                                                 (0x2000UL)		/*!< PWR EWUB: EWU13 (Bitfield-Mask: 0x01) */
#define PWR_EWUB_EWU13                                                     PWR_EWUB_EWU13_Msk
#define PWR_EWUB_EWU12_Pos                                                 (12UL)		/*!<PWR EWUB: EWU12 (Bit 12) */
#define PWR_EWUB_EWU12_Msk                                                 (0x1000UL)		/*!< PWR EWUB: EWU12 (Bitfield-Mask: 0x01) */
#define PWR_EWUB_EWU12                                                     PWR_EWUB_EWU12_Msk
#define PWR_EWUB_EWU11_Pos                                                 (11UL)		/*!<PWR EWUB: EWU11 (Bit 11) */
#define PWR_EWUB_EWU11_Msk                                                 (0x800UL)		/*!< PWR EWUB: EWU11 (Bitfield-Mask: 0x01) */
#define PWR_EWUB_EWU11                                                     PWR_EWUB_EWU11_Msk
#define PWR_EWUB_EWU10_Pos                                                 (10UL)		/*!<PWR EWUB: EWU10 (Bit 10) */
#define PWR_EWUB_EWU10_Msk                                                 (0x400UL)		/*!< PWR EWUB: EWU10 (Bitfield-Mask: 0x01) */
#define PWR_EWUB_EWU10                                                     PWR_EWUB_EWU10_Msk
#define PWR_EWUB_EWU9_Pos                                                  (9UL)		/*!<PWR EWUB: EWU9 (Bit 9) */
#define PWR_EWUB_EWU9_Msk                                                  (0x200UL)		/*!< PWR EWUB: EWU9 (Bitfield-Mask: 0x01) */
#define PWR_EWUB_EWU9                                                      PWR_EWUB_EWU9_Msk
#define PWR_EWUB_EWU8_Pos                                                  (8UL)		/*!<PWR EWUB: EWU8 (Bit 8) */
#define PWR_EWUB_EWU8_Msk                                                  (0x100UL)		/*!< PWR EWUB: EWU8 (Bitfield-Mask: 0x01) */
#define PWR_EWUB_EWU8                                                      PWR_EWUB_EWU8_Msk
#define PWR_EWUB_EWU7_Pos                                                  (7UL)		/*!<PWR EWUB: EWU7 (Bit 7) */
#define PWR_EWUB_EWU7_Msk                                                  (0x80UL)		/*!< PWR EWUB: EWU7 (Bitfield-Mask: 0x01) */
#define PWR_EWUB_EWU7                                                      PWR_EWUB_EWU7_Msk
#define PWR_EWUB_EWU6_Pos                                                  (6UL)		/*!<PWR EWUB: EWU6 (Bit 6) */
#define PWR_EWUB_EWU6_Msk                                                  (0x40UL)		/*!< PWR EWUB: EWU6 (Bitfield-Mask: 0x01) */
#define PWR_EWUB_EWU6                                                      PWR_EWUB_EWU6_Msk
#define PWR_EWUB_EWU5_Pos                                                  (5UL)		/*!<PWR EWUB: EWU5 (Bit 5) */
#define PWR_EWUB_EWU5_Msk                                                  (0x20UL)		/*!< PWR EWUB: EWU5 (Bitfield-Mask: 0x01) */
#define PWR_EWUB_EWU5                                                      PWR_EWUB_EWU5_Msk
#define PWR_EWUB_EWU4_Pos                                                  (4UL)		/*!<PWR EWUB: EWU4 (Bit 4) */
#define PWR_EWUB_EWU4_Msk                                                  (0x10UL)		/*!< PWR EWUB: EWU4 (Bitfield-Mask: 0x01) */
#define PWR_EWUB_EWU4                                                      PWR_EWUB_EWU4_Msk
#define PWR_EWUB_EWU3_Pos                                                  (3UL)		/*!<PWR EWUB: EWU3 (Bit 3) */
#define PWR_EWUB_EWU3_Msk                                                  (0x8UL)		/*!< PWR EWUB: EWU3 (Bitfield-Mask: 0x01) */
#define PWR_EWUB_EWU3                                                      PWR_EWUB_EWU3_Msk
#define PWR_EWUB_EWU2_Pos                                                  (2UL)		/*!<PWR EWUB: EWU2 (Bit 2) */
#define PWR_EWUB_EWU2_Msk                                                  (0x4UL)		/*!< PWR EWUB: EWU2 (Bitfield-Mask: 0x01) */
#define PWR_EWUB_EWU2                                                      PWR_EWUB_EWU2_Msk
#define PWR_EWUB_EWU1_Pos                                                  (1UL)		/*!<PWR EWUB: EWU1 (Bit 1) */
#define PWR_EWUB_EWU1_Msk                                                  (0x2UL)		/*!< PWR EWUB: EWU1 (Bitfield-Mask: 0x01) */
#define PWR_EWUB_EWU1                                                      PWR_EWUB_EWU1_Msk
#define PWR_EWUB_EWU0_Pos                                                  (0UL)		/*!<PWR EWUB: EWU0 (Bit 0) */
#define PWR_EWUB_EWU0_Msk                                                  (0x1UL)		/*!< PWR EWUB: EWU0 (Bitfield-Mask: 0x01) */
#define PWR_EWUB_EWU0                                                      PWR_EWUB_EWU0_Msk

/* =====================================================    WUPB    =====================================================*/ 
#define PWR_WUPB_WUP15_Pos                                                 (15UL)		/*!<PWR WUPB: WUP15 (Bit 15) */
#define PWR_WUPB_WUP15_Msk                                                 (0x8000UL)		/*!< PWR WUPB: WUP15 (Bitfield-Mask: 0x01) */
#define PWR_WUPB_WUP15                                                     PWR_WUPB_WUP15_Msk
#define PWR_WUPB_WUP14_Pos                                                 (14UL)		/*!<PWR WUPB: WUP14 (Bit 14) */
#define PWR_WUPB_WUP14_Msk                                                 (0x4000UL)		/*!< PWR WUPB: WUP14 (Bitfield-Mask: 0x01) */
#define PWR_WUPB_WUP14                                                     PWR_WUPB_WUP14_Msk
#define PWR_WUPB_WUP13_Pos                                                 (13UL)		/*!<PWR WUPB: WUP13 (Bit 13) */
#define PWR_WUPB_WUP13_Msk                                                 (0x2000UL)		/*!< PWR WUPB: WUP13 (Bitfield-Mask: 0x01) */
#define PWR_WUPB_WUP13                                                     PWR_WUPB_WUP13_Msk
#define PWR_WUPB_WUP12_Pos                                                 (12UL)		/*!<PWR WUPB: WUP12 (Bit 12) */
#define PWR_WUPB_WUP12_Msk                                                 (0x1000UL)		/*!< PWR WUPB: WUP12 (Bitfield-Mask: 0x01) */
#define PWR_WUPB_WUP12                                                     PWR_WUPB_WUP12_Msk
#define PWR_WUPB_WUP11_Pos                                                 (11UL)		/*!<PWR WUPB: WUP11 (Bit 11) */
#define PWR_WUPB_WUP11_Msk                                                 (0x800UL)		/*!< PWR WUPB: WUP11 (Bitfield-Mask: 0x01) */
#define PWR_WUPB_WUP11                                                     PWR_WUPB_WUP11_Msk
#define PWR_WUPB_WUP10_Pos                                                 (10UL)		/*!<PWR WUPB: WUP10 (Bit 10) */
#define PWR_WUPB_WUP10_Msk                                                 (0x400UL)		/*!< PWR WUPB: WUP10 (Bitfield-Mask: 0x01) */
#define PWR_WUPB_WUP10                                                     PWR_WUPB_WUP10_Msk
#define PWR_WUPB_WUP9_Pos                                                  (9UL)		/*!<PWR WUPB: WUP9 (Bit 9) */
#define PWR_WUPB_WUP9_Msk                                                  (0x200UL)		/*!< PWR WUPB: WUP9 (Bitfield-Mask: 0x01) */
#define PWR_WUPB_WUP9                                                      PWR_WUPB_WUP9_Msk
#define PWR_WUPB_WUP8_Pos                                                  (8UL)		/*!<PWR WUPB: WUP8 (Bit 8) */
#define PWR_WUPB_WUP8_Msk                                                  (0x100UL)		/*!< PWR WUPB: WUP8 (Bitfield-Mask: 0x01) */
#define PWR_WUPB_WUP8                                                      PWR_WUPB_WUP8_Msk
#define PWR_WUPB_WUP7_Pos                                                  (7UL)		/*!<PWR WUPB: WUP7 (Bit 7) */
#define PWR_WUPB_WUP7_Msk                                                  (0x80UL)		/*!< PWR WUPB: WUP7 (Bitfield-Mask: 0x01) */
#define PWR_WUPB_WUP7                                                      PWR_WUPB_WUP7_Msk
#define PWR_WUPB_WUP6_Pos                                                  (6UL)		/*!<PWR WUPB: WUP6 (Bit 6) */
#define PWR_WUPB_WUP6_Msk                                                  (0x40UL)		/*!< PWR WUPB: WUP6 (Bitfield-Mask: 0x01) */
#define PWR_WUPB_WUP6                                                      PWR_WUPB_WUP6_Msk
#define PWR_WUPB_WUP5_Pos                                                  (5UL)		/*!<PWR WUPB: WUP5 (Bit 5) */
#define PWR_WUPB_WUP5_Msk                                                  (0x20UL)		/*!< PWR WUPB: WUP5 (Bitfield-Mask: 0x01) */
#define PWR_WUPB_WUP5                                                      PWR_WUPB_WUP5_Msk
#define PWR_WUPB_WUP4_Pos                                                  (4UL)		/*!<PWR WUPB: WUP4 (Bit 4) */
#define PWR_WUPB_WUP4_Msk                                                  (0x10UL)		/*!< PWR WUPB: WUP4 (Bitfield-Mask: 0x01) */
#define PWR_WUPB_WUP4                                                      PWR_WUPB_WUP4_Msk
#define PWR_WUPB_WUP3_Pos                                                  (3UL)		/*!<PWR WUPB: WUP3 (Bit 3) */
#define PWR_WUPB_WUP3_Msk                                                  (0x8UL)		/*!< PWR WUPB: WUP3 (Bitfield-Mask: 0x01) */
#define PWR_WUPB_WUP3                                                      PWR_WUPB_WUP3_Msk
#define PWR_WUPB_WUP2_Pos                                                  (2UL)		/*!<PWR WUPB: WUP2 (Bit 2) */
#define PWR_WUPB_WUP2_Msk                                                  (0x4UL)		/*!< PWR WUPB: WUP2 (Bitfield-Mask: 0x01) */
#define PWR_WUPB_WUP2                                                      PWR_WUPB_WUP2_Msk
#define PWR_WUPB_WUP1_Pos                                                  (1UL)		/*!<PWR WUPB: WUP1 (Bit 1) */
#define PWR_WUPB_WUP1_Msk                                                  (0x2UL)		/*!< PWR WUPB: WUP1 (Bitfield-Mask: 0x01) */
#define PWR_WUPB_WUP1                                                      PWR_WUPB_WUP1_Msk
#define PWR_WUPB_WUP0_Pos                                                  (0UL)		/*!<PWR WUPB: WUP0 (Bit 0) */
#define PWR_WUPB_WUP0_Msk                                                  (0x1UL)		/*!< PWR WUPB: WUP0 (Bitfield-Mask: 0x01) */
#define PWR_WUPB_WUP0                                                      PWR_WUPB_WUP0_Msk

/* =====================================================    WUFB    =====================================================*/ 
#define PWR_WUFB_WUF15_Pos                                                 (15UL)		/*!<PWR WUFB: WUF15 (Bit 15) */
#define PWR_WUFB_WUF15_Msk                                                 (0x8000UL)		/*!< PWR WUFB: WUF15 (Bitfield-Mask: 0x01) */
#define PWR_WUFB_WUF15                                                     PWR_WUFB_WUF15_Msk
#define PWR_WUFB_WUF14_Pos                                                 (14UL)		/*!<PWR WUFB: WUF14 (Bit 14) */
#define PWR_WUFB_WUF14_Msk                                                 (0x4000UL)		/*!< PWR WUFB: WUF14 (Bitfield-Mask: 0x01) */
#define PWR_WUFB_WUF14                                                     PWR_WUFB_WUF14_Msk
#define PWR_WUFB_WUF13_Pos                                                 (13UL)		/*!<PWR WUFB: WUF13 (Bit 13) */
#define PWR_WUFB_WUF13_Msk                                                 (0x2000UL)		/*!< PWR WUFB: WUF13 (Bitfield-Mask: 0x01) */
#define PWR_WUFB_WUF13                                                     PWR_WUFB_WUF13_Msk
#define PWR_WUFB_WUF12_Pos                                                 (12UL)		/*!<PWR WUFB: WUF12 (Bit 12) */
#define PWR_WUFB_WUF12_Msk                                                 (0x1000UL)		/*!< PWR WUFB: WUF12 (Bitfield-Mask: 0x01) */
#define PWR_WUFB_WUF12                                                     PWR_WUFB_WUF12_Msk
#define PWR_WUFB_WUF11_Pos                                                 (11UL)		/*!<PWR WUFB: WUF11 (Bit 11) */
#define PWR_WUFB_WUF11_Msk                                                 (0x800UL)		/*!< PWR WUFB: WUF11 (Bitfield-Mask: 0x01) */
#define PWR_WUFB_WUF11                                                     PWR_WUFB_WUF11_Msk
#define PWR_WUFB_WUF10_Pos                                                 (10UL)		/*!<PWR WUFB: WUF10 (Bit 10) */
#define PWR_WUFB_WUF10_Msk                                                 (0x400UL)		/*!< PWR WUFB: WUF10 (Bitfield-Mask: 0x01) */
#define PWR_WUFB_WUF10                                                     PWR_WUFB_WUF10_Msk
#define PWR_WUFB_WUF9_Pos                                                  (9UL)		/*!<PWR WUFB: WUF9 (Bit 9) */
#define PWR_WUFB_WUF9_Msk                                                  (0x200UL)		/*!< PWR WUFB: WUF9 (Bitfield-Mask: 0x01) */
#define PWR_WUFB_WUF9                                                      PWR_WUFB_WUF9_Msk
#define PWR_WUFB_WUF8_Pos                                                  (8UL)		/*!<PWR WUFB: WUF8 (Bit 8) */
#define PWR_WUFB_WUF8_Msk                                                  (0x100UL)		/*!< PWR WUFB: WUF8 (Bitfield-Mask: 0x01) */
#define PWR_WUFB_WUF8                                                      PWR_WUFB_WUF8_Msk
#define PWR_WUFB_WUF7_Pos                                                  (7UL)		/*!<PWR WUFB: WUF7 (Bit 7) */
#define PWR_WUFB_WUF7_Msk                                                  (0x80UL)		/*!< PWR WUFB: WUF7 (Bitfield-Mask: 0x01) */
#define PWR_WUFB_WUF7                                                      PWR_WUFB_WUF7_Msk
#define PWR_WUFB_WUF6_Pos                                                  (6UL)		/*!<PWR WUFB: WUF6 (Bit 6) */
#define PWR_WUFB_WUF6_Msk                                                  (0x40UL)		/*!< PWR WUFB: WUF6 (Bitfield-Mask: 0x01) */
#define PWR_WUFB_WUF6                                                      PWR_WUFB_WUF6_Msk
#define PWR_WUFB_WUF5_Pos                                                  (5UL)		/*!<PWR WUFB: WUF5 (Bit 5) */
#define PWR_WUFB_WUF5_Msk                                                  (0x20UL)		/*!< PWR WUFB: WUF5 (Bitfield-Mask: 0x01) */
#define PWR_WUFB_WUF5                                                      PWR_WUFB_WUF5_Msk
#define PWR_WUFB_WUF4_Pos                                                  (4UL)		/*!<PWR WUFB: WUF4 (Bit 4) */
#define PWR_WUFB_WUF4_Msk                                                  (0x10UL)		/*!< PWR WUFB: WUF4 (Bitfield-Mask: 0x01) */
#define PWR_WUFB_WUF4                                                      PWR_WUFB_WUF4_Msk
#define PWR_WUFB_WUF3_Pos                                                  (3UL)		/*!<PWR WUFB: WUF3 (Bit 3) */
#define PWR_WUFB_WUF3_Msk                                                  (0x8UL)		/*!< PWR WUFB: WUF3 (Bitfield-Mask: 0x01) */
#define PWR_WUFB_WUF3                                                      PWR_WUFB_WUF3_Msk
#define PWR_WUFB_WUF2_Pos                                                  (2UL)		/*!<PWR WUFB: WUF2 (Bit 2) */
#define PWR_WUFB_WUF2_Msk                                                  (0x4UL)		/*!< PWR WUFB: WUF2 (Bitfield-Mask: 0x01) */
#define PWR_WUFB_WUF2                                                      PWR_WUFB_WUF2_Msk
#define PWR_WUFB_WUF1_Pos                                                  (1UL)		/*!<PWR WUFB: WUF1 (Bit 1) */
#define PWR_WUFB_WUF1_Msk                                                  (0x2UL)		/*!< PWR WUFB: WUF1 (Bitfield-Mask: 0x01) */
#define PWR_WUFB_WUF1                                                      PWR_WUFB_WUF1_Msk
#define PWR_WUFB_WUF0_Pos                                                  (0UL)		/*!<PWR WUFB: WUF0 (Bit 0) */
#define PWR_WUFB_WUF0_Msk                                                  (0x1UL)		/*!< PWR WUFB: WUF0 (Bitfield-Mask: 0x01) */
#define PWR_WUFB_WUF0                                                      PWR_WUFB_WUF0_Msk

