embetech-official/embenet-demo-nucleo-wl33cc1/Drivers/CMSIS/Device/ST/STM32WL3X/Include/stm32wl33.h
/* ============================================================================================================================*/ 
/*=====================                                      LPAWUR                                      =====================*/ 
/* ============================================================================================================================*/ 

/* =====================================================    FRAME_CONFIG0    =====================================================*/ 
#define LPAWUR_FRAME_CONFIG0_SLOW_CLK_CYCLE_PER_BIT_CNT_Pos                (21UL)		/*!<LPAWUR FRAME_CONFIG0: SLOW_CLK_CYCLE_PER_BIT_CNT (Bit 21) */
#define LPAWUR_FRAME_CONFIG0_SLOW_CLK_CYCLE_PER_BIT_CNT_Msk                (0x3e00000UL)		/*!< LPAWUR FRAME_CONFIG0: SLOW_CLK_CYCLE_PER_BIT_CNT (Bitfield-Mask: 0x1f) */
#define LPAWUR_FRAME_CONFIG0_SLOW_CLK_CYCLE_PER_BIT_CNT                    LPAWUR_FRAME_CONFIG0_SLOW_CLK_CYCLE_PER_BIT_CNT_Msk
#define LPAWUR_FRAME_CONFIG0_SLOW_CLK_CYCLE_PER_BIT_CNT_0                  (0x1U << LPAWUR_FRAME_CONFIG0_SLOW_CLK_CYCLE_PER_BIT_CNT_Pos)
#define LPAWUR_FRAME_CONFIG0_SLOW_CLK_CYCLE_PER_BIT_CNT_1                  (0x2U << LPAWUR_FRAME_CONFIG0_SLOW_CLK_CYCLE_PER_BIT_CNT_Pos)
#define LPAWUR_FRAME_CONFIG0_SLOW_CLK_CYCLE_PER_BIT_CNT_2                  (0x4U << LPAWUR_FRAME_CONFIG0_SLOW_CLK_CYCLE_PER_BIT_CNT_Pos)
#define LPAWUR_FRAME_CONFIG0_SLOW_CLK_CYCLE_PER_BIT_CNT_3                  (0x8U << LPAWUR_FRAME_CONFIG0_SLOW_CLK_CYCLE_PER_BIT_CNT_Pos)
#define LPAWUR_FRAME_CONFIG0_SLOW_CLK_CYCLE_PER_BIT_CNT_4                  (0x10U << LPAWUR_FRAME_CONFIG0_SLOW_CLK_CYCLE_PER_BIT_CNT_Pos)
#define LPAWUR_FRAME_CONFIG0_PAYLOAD_LENGTH_Pos                            (16UL)		/*!<LPAWUR FRAME_CONFIG0: PAYLOAD_LENGTH (Bit 16) */
#define LPAWUR_FRAME_CONFIG0_PAYLOAD_LENGTH_Msk                            (0xf0000UL)		/*!< LPAWUR FRAME_CONFIG0: PAYLOAD_LENGTH (Bitfield-Mask: 0x0f) */
#define LPAWUR_FRAME_CONFIG0_PAYLOAD_LENGTH                                LPAWUR_FRAME_CONFIG0_PAYLOAD_LENGTH_Msk
#define LPAWUR_FRAME_CONFIG0_PAYLOAD_LENGTH_0                              (0x1U << LPAWUR_FRAME_CONFIG0_PAYLOAD_LENGTH_Pos)
#define LPAWUR_FRAME_CONFIG0_PAYLOAD_LENGTH_1                              (0x2U << LPAWUR_FRAME_CONFIG0_PAYLOAD_LENGTH_Pos)
#define LPAWUR_FRAME_CONFIG0_PAYLOAD_LENGTH_2                              (0x4U << LPAWUR_FRAME_CONFIG0_PAYLOAD_LENGTH_Pos)
#define LPAWUR_FRAME_CONFIG0_PAYLOAD_LENGTH_3                              (0x8U << LPAWUR_FRAME_CONFIG0_PAYLOAD_LENGTH_Pos)
#define LPAWUR_FRAME_CONFIG0_SYNC_THRESHOLD_COUNT_Pos                      (10UL)		/*!<LPAWUR FRAME_CONFIG0: SYNC_THRESHOLD_COUNT (Bit 10) */
#define LPAWUR_FRAME_CONFIG0_SYNC_THRESHOLD_COUNT_Msk                      (0xfc00UL)		/*!< LPAWUR FRAME_CONFIG0: SYNC_THRESHOLD_COUNT (Bitfield-Mask: 0x3f) */
#define LPAWUR_FRAME_CONFIG0_SYNC_THRESHOLD_COUNT                          LPAWUR_FRAME_CONFIG0_SYNC_THRESHOLD_COUNT_Msk
#define LPAWUR_FRAME_CONFIG0_SYNC_THRESHOLD_COUNT_0                        (0x1U << LPAWUR_FRAME_CONFIG0_SYNC_THRESHOLD_COUNT_Pos)
#define LPAWUR_FRAME_CONFIG0_SYNC_THRESHOLD_COUNT_1                        (0x2U << LPAWUR_FRAME_CONFIG0_SYNC_THRESHOLD_COUNT_Pos)
#define LPAWUR_FRAME_CONFIG0_SYNC_THRESHOLD_COUNT_2                        (0x4U << LPAWUR_FRAME_CONFIG0_SYNC_THRESHOLD_COUNT_Pos)
#define LPAWUR_FRAME_CONFIG0_SYNC_THRESHOLD_COUNT_3                        (0x8U << LPAWUR_FRAME_CONFIG0_SYNC_THRESHOLD_COUNT_Pos)
#define LPAWUR_FRAME_CONFIG0_SYNC_THRESHOLD_COUNT_4                        (0x10U << LPAWUR_FRAME_CONFIG0_SYNC_THRESHOLD_COUNT_Pos)
#define LPAWUR_FRAME_CONFIG0_SYNC_THRESHOLD_COUNT_5                        (0x20U << LPAWUR_FRAME_CONFIG0_SYNC_THRESHOLD_COUNT_Pos)
#define LPAWUR_FRAME_CONFIG0_SYNC_LENGTH_Pos                               (8UL)		/*!<LPAWUR FRAME_CONFIG0: SYNC_LENGTH (Bit 8) */
#define LPAWUR_FRAME_CONFIG0_SYNC_LENGTH_Msk                               (0x100UL)		/*!< LPAWUR FRAME_CONFIG0: SYNC_LENGTH (Bitfield-Mask: 0x01) */
#define LPAWUR_FRAME_CONFIG0_SYNC_LENGTH                                   LPAWUR_FRAME_CONFIG0_SYNC_LENGTH_Msk
#define LPAWUR_FRAME_CONFIG0_PREAMBLE_THRESHOLD_COUNT_Pos                  (0UL)		/*!<LPAWUR FRAME_CONFIG0: PREAMBLE_THRESHOLD_COUNT (Bit 0) */
#define LPAWUR_FRAME_CONFIG0_PREAMBLE_THRESHOLD_COUNT_Msk                  (0xffUL)		/*!< LPAWUR FRAME_CONFIG0: PREAMBLE_THRESHOLD_COUNT (Bitfield-Mask: 0xff) */
#define LPAWUR_FRAME_CONFIG0_PREAMBLE_THRESHOLD_COUNT                      LPAWUR_FRAME_CONFIG0_PREAMBLE_THRESHOLD_COUNT_Msk
#define LPAWUR_FRAME_CONFIG0_PREAMBLE_THRESHOLD_COUNT_0                    (0x1U << LPAWUR_FRAME_CONFIG0_PREAMBLE_THRESHOLD_COUNT_Pos)
#define LPAWUR_FRAME_CONFIG0_PREAMBLE_THRESHOLD_COUNT_1                    (0x2U << LPAWUR_FRAME_CONFIG0_PREAMBLE_THRESHOLD_COUNT_Pos)
#define LPAWUR_FRAME_CONFIG0_PREAMBLE_THRESHOLD_COUNT_2                    (0x4U << LPAWUR_FRAME_CONFIG0_PREAMBLE_THRESHOLD_COUNT_Pos)
#define LPAWUR_FRAME_CONFIG0_PREAMBLE_THRESHOLD_COUNT_3                    (0x8U << LPAWUR_FRAME_CONFIG0_PREAMBLE_THRESHOLD_COUNT_Pos)
#define LPAWUR_FRAME_CONFIG0_PREAMBLE_THRESHOLD_COUNT_4                    (0x10U << LPAWUR_FRAME_CONFIG0_PREAMBLE_THRESHOLD_COUNT_Pos)
#define LPAWUR_FRAME_CONFIG0_PREAMBLE_THRESHOLD_COUNT_5                    (0x20U << LPAWUR_FRAME_CONFIG0_PREAMBLE_THRESHOLD_COUNT_Pos)
#define LPAWUR_FRAME_CONFIG0_PREAMBLE_THRESHOLD_COUNT_6                    (0x40U << LPAWUR_FRAME_CONFIG0_PREAMBLE_THRESHOLD_COUNT_Pos)
#define LPAWUR_FRAME_CONFIG0_PREAMBLE_THRESHOLD_COUNT_7                    (0x80U << LPAWUR_FRAME_CONFIG0_PREAMBLE_THRESHOLD_COUNT_Pos)

/* =====================================================    FRAME_CONFIG1    =====================================================*/ 
#define LPAWUR_FRAME_CONFIG1_TREC_LOOP_ALGO_SEL_Pos                        (18UL)		/*!<LPAWUR FRAME_CONFIG1: TREC_LOOP_ALGO_SEL (Bit 18) */
#define LPAWUR_FRAME_CONFIG1_TREC_LOOP_ALGO_SEL_Msk                        (0x40000UL)		/*!< LPAWUR FRAME_CONFIG1: TREC_LOOP_ALGO_SEL (Bitfield-Mask: 0x01) */
#define LPAWUR_FRAME_CONFIG1_TREC_LOOP_ALGO_SEL                            LPAWUR_FRAME_CONFIG1_TREC_LOOP_ALGO_SEL_Msk
#define LPAWUR_FRAME_CONFIG1_PREAMBLE_ENABLE_Pos                           (17UL)		/*!<LPAWUR FRAME_CONFIG1: PREAMBLE_ENABLE (Bit 17) */
#define LPAWUR_FRAME_CONFIG1_PREAMBLE_ENABLE_Msk                           (0x20000UL)		/*!< LPAWUR FRAME_CONFIG1: PREAMBLE_ENABLE (Bitfield-Mask: 0x01) */
#define LPAWUR_FRAME_CONFIG1_PREAMBLE_ENABLE                               LPAWUR_FRAME_CONFIG1_PREAMBLE_ENABLE_Msk
#define LPAWUR_FRAME_CONFIG1_FRAME_SYNC_COUNTER_TIMEOUT_Pos                (8UL)		/*!<LPAWUR FRAME_CONFIG1: FRAME_SYNC_COUNTER_TIMEOUT (Bit 8) */
#define LPAWUR_FRAME_CONFIG1_FRAME_SYNC_COUNTER_TIMEOUT_Msk                (0xff00UL)		/*!< LPAWUR FRAME_CONFIG1: FRAME_SYNC_COUNTER_TIMEOUT (Bitfield-Mask: 0xff) */
#define LPAWUR_FRAME_CONFIG1_FRAME_SYNC_COUNTER_TIMEOUT                    LPAWUR_FRAME_CONFIG1_FRAME_SYNC_COUNTER_TIMEOUT_Msk
#define LPAWUR_FRAME_CONFIG1_FRAME_SYNC_COUNTER_TIMEOUT_0                  (0x1U << LPAWUR_FRAME_CONFIG1_FRAME_SYNC_COUNTER_TIMEOUT_Pos)
#define LPAWUR_FRAME_CONFIG1_FRAME_SYNC_COUNTER_TIMEOUT_1                  (0x2U << LPAWUR_FRAME_CONFIG1_FRAME_SYNC_COUNTER_TIMEOUT_Pos)
#define LPAWUR_FRAME_CONFIG1_FRAME_SYNC_COUNTER_TIMEOUT_2                  (0x4U << LPAWUR_FRAME_CONFIG1_FRAME_SYNC_COUNTER_TIMEOUT_Pos)
#define LPAWUR_FRAME_CONFIG1_FRAME_SYNC_COUNTER_TIMEOUT_3                  (0x8U << LPAWUR_FRAME_CONFIG1_FRAME_SYNC_COUNTER_TIMEOUT_Pos)
#define LPAWUR_FRAME_CONFIG1_FRAME_SYNC_COUNTER_TIMEOUT_4                  (0x10U << LPAWUR_FRAME_CONFIG1_FRAME_SYNC_COUNTER_TIMEOUT_Pos)
#define LPAWUR_FRAME_CONFIG1_FRAME_SYNC_COUNTER_TIMEOUT_5                  (0x20U << LPAWUR_FRAME_CONFIG1_FRAME_SYNC_COUNTER_TIMEOUT_Pos)
#define LPAWUR_FRAME_CONFIG1_FRAME_SYNC_COUNTER_TIMEOUT_6                  (0x40U << LPAWUR_FRAME_CONFIG1_FRAME_SYNC_COUNTER_TIMEOUT_Pos)
#define LPAWUR_FRAME_CONFIG1_FRAME_SYNC_COUNTER_TIMEOUT_7                  (0x80U << LPAWUR_FRAME_CONFIG1_FRAME_SYNC_COUNTER_TIMEOUT_Pos)
#define LPAWUR_FRAME_CONFIG1_KP_Pos                                        (4UL)		/*!<LPAWUR FRAME_CONFIG1: KP (Bit 4) */
#define LPAWUR_FRAME_CONFIG1_KP_Msk                                        (0xf0UL)		/*!< LPAWUR FRAME_CONFIG1: KP (Bitfield-Mask: 0x0f) */
#define LPAWUR_FRAME_CONFIG1_KP                                            LPAWUR_FRAME_CONFIG1_KP_Msk
#define LPAWUR_FRAME_CONFIG1_KP_0                                          (0x1U << LPAWUR_FRAME_CONFIG1_KP_Pos)
#define LPAWUR_FRAME_CONFIG1_KP_1                                          (0x2U << LPAWUR_FRAME_CONFIG1_KP_Pos)
#define LPAWUR_FRAME_CONFIG1_KP_2                                          (0x4U << LPAWUR_FRAME_CONFIG1_KP_Pos)
#define LPAWUR_FRAME_CONFIG1_KP_3                                          (0x8U << LPAWUR_FRAME_CONFIG1_KP_Pos)
#define LPAWUR_FRAME_CONFIG1_KI_Pos                                        (0UL)		/*!<LPAWUR FRAME_CONFIG1: KI (Bit 0) */
#define LPAWUR_FRAME_CONFIG1_KI_Msk                                        (0xfUL)		/*!< LPAWUR FRAME_CONFIG1: KI (Bitfield-Mask: 0x0f) */
#define LPAWUR_FRAME_CONFIG1_KI                                            LPAWUR_FRAME_CONFIG1_KI_Msk
#define LPAWUR_FRAME_CONFIG1_KI_0                                          (0x1U << LPAWUR_FRAME_CONFIG1_KI_Pos)
#define LPAWUR_FRAME_CONFIG1_KI_1                                          (0x2U << LPAWUR_FRAME_CONFIG1_KI_Pos)
#define LPAWUR_FRAME_CONFIG1_KI_2                                          (0x4U << LPAWUR_FRAME_CONFIG1_KI_Pos)
#define LPAWUR_FRAME_CONFIG1_KI_3                                          (0x8U << LPAWUR_FRAME_CONFIG1_KI_Pos)

/* =====================================================    FRAME_SYNC_CONFIG    =====================================================*/ 
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_H_Pos                  (16UL)		/*!<LPAWUR FRAME_SYNC_CONFIG: FRAME_SYNC_PATTERN_H (Bit 16) */
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_H_Msk                  (0xffff0000UL)		/*!< LPAWUR FRAME_SYNC_CONFIG: FRAME_SYNC_PATTERN_H (Bitfield-Mask: 0xffff) */
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_H                      LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_H_Msk
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_H_0                    (0x1U << LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_H_Pos)
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_H_1                    (0x2U << LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_H_Pos)
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_H_2                    (0x4U << LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_H_Pos)
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_H_3                    (0x8U << LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_H_Pos)
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_H_4                    (0x10U << LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_H_Pos)
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_H_5                    (0x20U << LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_H_Pos)
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_H_6                    (0x40U << LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_H_Pos)
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_H_7                    (0x80U << LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_H_Pos)
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_H_8                    (0x100U << LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_H_Pos)
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_H_9                    (0x200U << LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_H_Pos)
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_H_10                   (0x400U << LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_H_Pos)
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_H_11                   (0x800U << LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_H_Pos)
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_H_12                   (0x1000U << LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_H_Pos)
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_H_13                   (0x2000U << LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_H_Pos)
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_H_14                   (0x4000U << LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_H_Pos)
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_H_15                   (0x8000U << LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_H_Pos)
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_L_Pos                  (0UL)		/*!<LPAWUR FRAME_SYNC_CONFIG: FRAME_SYNC_PATTERN_L (Bit 0) */
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_L_Msk                  (0xffffUL)		/*!< LPAWUR FRAME_SYNC_CONFIG: FRAME_SYNC_PATTERN_L (Bitfield-Mask: 0xffff) */
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_L                      LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_L_Msk
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_L_0                    (0x1U << LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_L_Pos)
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_L_1                    (0x2U << LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_L_Pos)
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_L_2                    (0x4U << LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_L_Pos)
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_L_3                    (0x8U << LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_L_Pos)
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_L_4                    (0x10U << LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_L_Pos)
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_L_5                    (0x20U << LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_L_Pos)
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_L_6                    (0x40U << LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_L_Pos)
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_L_7                    (0x80U << LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_L_Pos)
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_L_8                    (0x100U << LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_L_Pos)
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_L_9                    (0x200U << LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_L_Pos)
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_L_10                   (0x400U << LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_L_Pos)
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_L_11                   (0x800U << LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_L_Pos)
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_L_12                   (0x1000U << LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_L_Pos)
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_L_13                   (0x2000U << LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_L_Pos)
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_L_14                   (0x4000U << LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_L_Pos)
#define LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_L_15                   (0x8000U << LPAWUR_FRAME_SYNC_CONFIG_FRAME_SYNC_PATTERN_L_Pos)

/* =====================================================    RFIP_CONFIG    =====================================================*/ 
#define LPAWUR_RFIP_CONFIG_WAKEUP_LEVEL_Pos                                (1UL)		/*!<LPAWUR RFIP_CONFIG: WAKEUP_LEVEL (Bit 1) */
#define LPAWUR_RFIP_CONFIG_WAKEUP_LEVEL_Msk                                (0x6UL)		/*!< LPAWUR RFIP_CONFIG: WAKEUP_LEVEL (Bitfield-Mask: 0x03) */
#define LPAWUR_RFIP_CONFIG_WAKEUP_LEVEL                                    LPAWUR_RFIP_CONFIG_WAKEUP_LEVEL_Msk
#define LPAWUR_RFIP_CONFIG_WAKEUP_LEVEL_0                                  (0x1U << LPAWUR_RFIP_CONFIG_WAKEUP_LEVEL_Pos)
#define LPAWUR_RFIP_CONFIG_WAKEUP_LEVEL_1                                  (0x2U << LPAWUR_RFIP_CONFIG_WAKEUP_LEVEL_Pos)
#define LPAWUR_RFIP_CONFIG_LPAWUR_ENABLE_Pos                               (0UL)		/*!<LPAWUR RFIP_CONFIG: LPAWUR_ENABLE (Bit 0) */
#define LPAWUR_RFIP_CONFIG_LPAWUR_ENABLE_Msk                               (0x1UL)		/*!< LPAWUR RFIP_CONFIG: LPAWUR_ENABLE (Bitfield-Mask: 0x01) */
#define LPAWUR_RFIP_CONFIG_LPAWUR_ENABLE                                   LPAWUR_RFIP_CONFIG_LPAWUR_ENABLE_Msk

/* =====================================================    RF_CONFIG    =====================================================*/ 
#define LPAWUR_RF_CONFIG_ED_ICAL_Pos                                       (18UL)		/*!<LPAWUR RF_CONFIG: ED_ICAL (Bit 18) */
#define LPAWUR_RF_CONFIG_ED_ICAL_Msk                                       (0x1c0000UL)		/*!< LPAWUR RF_CONFIG: ED_ICAL (Bitfield-Mask: 0x07) */
#define LPAWUR_RF_CONFIG_ED_ICAL                                           LPAWUR_RF_CONFIG_ED_ICAL_Msk
#define LPAWUR_RF_CONFIG_ED_ICAL_0                                         (0x1U << LPAWUR_RF_CONFIG_ED_ICAL_Pos)
#define LPAWUR_RF_CONFIG_ED_ICAL_1                                         (0x2U << LPAWUR_RF_CONFIG_ED_ICAL_Pos)
#define LPAWUR_RF_CONFIG_ED_ICAL_2                                         (0x4U << LPAWUR_RF_CONFIG_ED_ICAL_Pos)
#define LPAWUR_RF_CONFIG_AGC_HIGH_LVL_Pos                                  (14UL)		/*!<LPAWUR RF_CONFIG: AGC_HIGH_LVL (Bit 14) */
#define LPAWUR_RF_CONFIG_AGC_HIGH_LVL_Msk                                  (0x3c000UL)		/*!< LPAWUR RF_CONFIG: AGC_HIGH_LVL (Bitfield-Mask: 0x0f) */
#define LPAWUR_RF_CONFIG_AGC_HIGH_LVL                                      LPAWUR_RF_CONFIG_AGC_HIGH_LVL_Msk
#define LPAWUR_RF_CONFIG_AGC_HIGH_LVL_0                                    (0x1U << LPAWUR_RF_CONFIG_AGC_HIGH_LVL_Pos)
#define LPAWUR_RF_CONFIG_AGC_HIGH_LVL_1                                    (0x2U << LPAWUR_RF_CONFIG_AGC_HIGH_LVL_Pos)
#define LPAWUR_RF_CONFIG_AGC_HIGH_LVL_2                                    (0x4U << LPAWUR_RF_CONFIG_AGC_HIGH_LVL_Pos)
#define LPAWUR_RF_CONFIG_AGC_HIGH_LVL_3                                    (0x8U << LPAWUR_RF_CONFIG_AGC_HIGH_LVL_Pos)
#define LPAWUR_RF_CONFIG_ED_DC_CTRL_Pos                                    (13UL)		/*!<LPAWUR RF_CONFIG: ED_DC_CTRL (Bit 13) */
#define LPAWUR_RF_CONFIG_ED_DC_CTRL_Msk                                    (0x2000UL)		/*!< LPAWUR RF_CONFIG: ED_DC_CTRL (Bitfield-Mask: 0x01) */
#define LPAWUR_RF_CONFIG_ED_DC_CTRL                                        LPAWUR_RF_CONFIG_ED_DC_CTRL_Msk
#define LPAWUR_RF_CONFIG_AGC_LOW_LVL_Pos                                   (11UL)		/*!<LPAWUR RF_CONFIG: AGC_LOW_LVL (Bit 11) */
#define LPAWUR_RF_CONFIG_AGC_LOW_LVL_Msk                                   (0x1800UL)		/*!< LPAWUR RF_CONFIG: AGC_LOW_LVL (Bitfield-Mask: 0x03) */
#define LPAWUR_RF_CONFIG_AGC_LOW_LVL                                       LPAWUR_RF_CONFIG_AGC_LOW_LVL_Msk
#define LPAWUR_RF_CONFIG_AGC_LOW_LVL_0                                     (0x1U << LPAWUR_RF_CONFIG_AGC_LOW_LVL_Pos)
#define LPAWUR_RF_CONFIG_AGC_LOW_LVL_1                                     (0x2U << LPAWUR_RF_CONFIG_AGC_LOW_LVL_Pos)
#define LPAWUR_RF_CONFIG_CLKDIV_Pos                                        (1UL)		/*!<LPAWUR RF_CONFIG: CLKDIV (Bit 1) */
#define LPAWUR_RF_CONFIG_CLKDIV_Msk                                        (0x1eUL)		/*!< LPAWUR RF_CONFIG: CLKDIV (Bitfield-Mask: 0x0f) */
#define LPAWUR_RF_CONFIG_CLKDIV                                            LPAWUR_RF_CONFIG_CLKDIV_Msk
#define LPAWUR_RF_CONFIG_CLKDIV_0                                          (0x1U << LPAWUR_RF_CONFIG_CLKDIV_Pos)
#define LPAWUR_RF_CONFIG_CLKDIV_1                                          (0x2U << LPAWUR_RF_CONFIG_CLKDIV_Pos)
#define LPAWUR_RF_CONFIG_CLKDIV_2                                          (0x4U << LPAWUR_RF_CONFIG_CLKDIV_Pos)
#define LPAWUR_RF_CONFIG_CLKDIV_3                                          (0x8U << LPAWUR_RF_CONFIG_CLKDIV_Pos)
#define LPAWUR_RF_CONFIG_ED_SWITCH_Pos                                     (0UL)		/*!<LPAWUR RF_CONFIG: ED_SWITCH (Bit 0) */
#define LPAWUR_RF_CONFIG_ED_SWITCH_Msk                                     (0x1UL)		/*!< LPAWUR RF_CONFIG: ED_SWITCH (Bitfield-Mask: 0x01) */
#define LPAWUR_RF_CONFIG_ED_SWITCH                                         LPAWUR_RF_CONFIG_ED_SWITCH_Msk

/* =====================================================    AGC_CONFIG    =====================================================*/ 
#define LPAWUR_AGC_CONFIG_AGC_RESET_MODE_Pos                               (3UL)		/*!<LPAWUR AGC_CONFIG: AGC_RESET_MODE (Bit 3) */
#define LPAWUR_AGC_CONFIG_AGC_RESET_MODE_Msk                               (0x8UL)		/*!< LPAWUR AGC_CONFIG: AGC_RESET_MODE (Bitfield-Mask: 0x01) */
#define LPAWUR_AGC_CONFIG_AGC_RESET_MODE                                   LPAWUR_AGC_CONFIG_AGC_RESET_MODE_Msk
#define LPAWUR_AGC_CONFIG_AGC_HOLD_MODE_Pos                                (2UL)		/*!<LPAWUR AGC_CONFIG: AGC_HOLD_MODE (Bit 2) */
#define LPAWUR_AGC_CONFIG_AGC_HOLD_MODE_Msk                                (0x4UL)		/*!< LPAWUR AGC_CONFIG: AGC_HOLD_MODE (Bitfield-Mask: 0x01) */
#define LPAWUR_AGC_CONFIG_AGC_HOLD_MODE                                    LPAWUR_AGC_CONFIG_AGC_HOLD_MODE_Msk
#define LPAWUR_AGC_CONFIG_AGC_MODE_Pos                                     (0UL)		/*!<LPAWUR AGC_CONFIG: AGC_MODE (Bit 0) */
#define LPAWUR_AGC_CONFIG_AGC_MODE_Msk                                     (0x3UL)		/*!< LPAWUR AGC_CONFIG: AGC_MODE (Bitfield-Mask: 0x03) */
#define LPAWUR_AGC_CONFIG_AGC_MODE                                         LPAWUR_AGC_CONFIG_AGC_MODE_Msk
#define LPAWUR_AGC_CONFIG_AGC_MODE_0                                       (0x1U << LPAWUR_AGC_CONFIG_AGC_MODE_Pos)
#define LPAWUR_AGC_CONFIG_AGC_MODE_1                                       (0x2U << LPAWUR_AGC_CONFIG_AGC_MODE_Pos)

