embetech-official/embenet-demo-nucleo-wl33cc1/Drivers/CMSIS/Device/ST/STM32WL3X/Include/stm32wl33.h
/* ============================================================================================================================*/ 
/*=====================                               MR_SUBG_GLOB_DYNAMIC                               =====================*/ 
/* ============================================================================================================================*/ 

/* =====================================================    PCKTLEN_CONFIG    =====================================================*/ 
#define MR_SUBG_GLOB_DYNAMIC_PCKTLEN_CONFIG_PCKTLEN_Pos                    (0UL)		/*!<MR_SUBG_GLOB_DYNAMIC PCKTLEN_CONFIG: PCKTLEN (Bit 0) */
#define MR_SUBG_GLOB_DYNAMIC_PCKTLEN_CONFIG_PCKTLEN_Msk                    (0xffffUL)		/*!< MR_SUBG_GLOB_DYNAMIC PCKTLEN_CONFIG: PCKTLEN (Bitfield-Mask: 0xffff) */
#define MR_SUBG_GLOB_DYNAMIC_PCKTLEN_CONFIG_PCKTLEN                        MR_SUBG_GLOB_DYNAMIC_PCKTLEN_CONFIG_PCKTLEN_Msk
#define MR_SUBG_GLOB_DYNAMIC_PCKTLEN_CONFIG_PCKTLEN_0                      (0x1U << MR_SUBG_GLOB_DYNAMIC_PCKTLEN_CONFIG_PCKTLEN_Pos)
#define MR_SUBG_GLOB_DYNAMIC_PCKTLEN_CONFIG_PCKTLEN_1                      (0x2U << MR_SUBG_GLOB_DYNAMIC_PCKTLEN_CONFIG_PCKTLEN_Pos)
#define MR_SUBG_GLOB_DYNAMIC_PCKTLEN_CONFIG_PCKTLEN_2                      (0x4U << MR_SUBG_GLOB_DYNAMIC_PCKTLEN_CONFIG_PCKTLEN_Pos)
#define MR_SUBG_GLOB_DYNAMIC_PCKTLEN_CONFIG_PCKTLEN_3                      (0x8U << MR_SUBG_GLOB_DYNAMIC_PCKTLEN_CONFIG_PCKTLEN_Pos)
#define MR_SUBG_GLOB_DYNAMIC_PCKTLEN_CONFIG_PCKTLEN_4                      (0x10U << MR_SUBG_GLOB_DYNAMIC_PCKTLEN_CONFIG_PCKTLEN_Pos)
#define MR_SUBG_GLOB_DYNAMIC_PCKTLEN_CONFIG_PCKTLEN_5                      (0x20U << MR_SUBG_GLOB_DYNAMIC_PCKTLEN_CONFIG_PCKTLEN_Pos)
#define MR_SUBG_GLOB_DYNAMIC_PCKTLEN_CONFIG_PCKTLEN_6                      (0x40U << MR_SUBG_GLOB_DYNAMIC_PCKTLEN_CONFIG_PCKTLEN_Pos)
#define MR_SUBG_GLOB_DYNAMIC_PCKTLEN_CONFIG_PCKTLEN_7                      (0x80U << MR_SUBG_GLOB_DYNAMIC_PCKTLEN_CONFIG_PCKTLEN_Pos)
#define MR_SUBG_GLOB_DYNAMIC_PCKTLEN_CONFIG_PCKTLEN_8                      (0x100U << MR_SUBG_GLOB_DYNAMIC_PCKTLEN_CONFIG_PCKTLEN_Pos)
#define MR_SUBG_GLOB_DYNAMIC_PCKTLEN_CONFIG_PCKTLEN_9                      (0x200U << MR_SUBG_GLOB_DYNAMIC_PCKTLEN_CONFIG_PCKTLEN_Pos)
#define MR_SUBG_GLOB_DYNAMIC_PCKTLEN_CONFIG_PCKTLEN_10                     (0x400U << MR_SUBG_GLOB_DYNAMIC_PCKTLEN_CONFIG_PCKTLEN_Pos)
#define MR_SUBG_GLOB_DYNAMIC_PCKTLEN_CONFIG_PCKTLEN_11                     (0x800U << MR_SUBG_GLOB_DYNAMIC_PCKTLEN_CONFIG_PCKTLEN_Pos)
#define MR_SUBG_GLOB_DYNAMIC_PCKTLEN_CONFIG_PCKTLEN_12                     (0x1000U << MR_SUBG_GLOB_DYNAMIC_PCKTLEN_CONFIG_PCKTLEN_Pos)
#define MR_SUBG_GLOB_DYNAMIC_PCKTLEN_CONFIG_PCKTLEN_13                     (0x2000U << MR_SUBG_GLOB_DYNAMIC_PCKTLEN_CONFIG_PCKTLEN_Pos)
#define MR_SUBG_GLOB_DYNAMIC_PCKTLEN_CONFIG_PCKTLEN_14                     (0x4000U << MR_SUBG_GLOB_DYNAMIC_PCKTLEN_CONFIG_PCKTLEN_Pos)
#define MR_SUBG_GLOB_DYNAMIC_PCKTLEN_CONFIG_PCKTLEN_15                     (0x8000U << MR_SUBG_GLOB_DYNAMIC_PCKTLEN_CONFIG_PCKTLEN_Pos)

/* =====================================================    MOD0_CONFIG    =====================================================*/ 
#define MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_PA_CLKON_LOCKONTX_Pos             (31UL)		/*!<MR_SUBG_GLOB_DYNAMIC MOD0_CONFIG: PA_CLKON_LOCKONTX (Bit 31) */
#define MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_PA_CLKON_LOCKONTX_Msk             (0x80000000UL)		/*!< MR_SUBG_GLOB_DYNAMIC MOD0_CONFIG: PA_CLKON_LOCKONTX (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_PA_CLKON_LOCKONTX                 MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_PA_CLKON_LOCKONTX_Msk
#define MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_BT_SEL_Pos                        (26UL)		/*!<MR_SUBG_GLOB_DYNAMIC MOD0_CONFIG: BT_SEL (Bit 26) */
#define MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_BT_SEL_Msk                        (0x4000000UL)		/*!< MR_SUBG_GLOB_DYNAMIC MOD0_CONFIG: BT_SEL (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_BT_SEL                            MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_BT_SEL_Msk
#define MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_CONST_MAP_Pos                     (24UL)		/*!<MR_SUBG_GLOB_DYNAMIC MOD0_CONFIG: CONST_MAP (Bit 24) */
#define MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_CONST_MAP_Msk                     (0x3000000UL)		/*!< MR_SUBG_GLOB_DYNAMIC MOD0_CONFIG: CONST_MAP (Bitfield-Mask: 0x03) */
#define MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_CONST_MAP                         MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_CONST_MAP_Msk
#define MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_CONST_MAP_0                       (0x1U << MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_CONST_MAP_Pos)
#define MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_CONST_MAP_1                       (0x2U << MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_CONST_MAP_Pos)
#define MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_MOD_TYPE_Pos                      (20UL)		/*!<MR_SUBG_GLOB_DYNAMIC MOD0_CONFIG: MOD_TYPE (Bit 20) */
#define MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_MOD_TYPE_Msk                      (0x700000UL)		/*!< MR_SUBG_GLOB_DYNAMIC MOD0_CONFIG: MOD_TYPE (Bitfield-Mask: 0x07) */
#define MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_MOD_TYPE                          MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_MOD_TYPE_Msk
#define MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_MOD_TYPE_0                        (0x1U << MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_MOD_TYPE_Pos)
#define MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_MOD_TYPE_1                        (0x2U << MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_MOD_TYPE_Pos)
#define MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_MOD_TYPE_2                        (0x4U << MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_MOD_TYPE_Pos)
#define MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_DATARATE_E_Pos                    (16UL)		/*!<MR_SUBG_GLOB_DYNAMIC MOD0_CONFIG: DATARATE_E (Bit 16) */
#define MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_DATARATE_E_Msk                    (0xf0000UL)		/*!< MR_SUBG_GLOB_DYNAMIC MOD0_CONFIG: DATARATE_E (Bitfield-Mask: 0x0f) */
#define MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_DATARATE_E                        MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_DATARATE_E_Msk
#define MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_DATARATE_E_0                      (0x1U << MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_DATARATE_E_Pos)
#define MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_DATARATE_E_1                      (0x2U << MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_DATARATE_E_Pos)
#define MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_DATARATE_E_2                      (0x4U << MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_DATARATE_E_Pos)
#define MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_DATARATE_E_3                      (0x8U << MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_DATARATE_E_Pos)
#define MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_DATARATE_M_Pos                    (0UL)		/*!<MR_SUBG_GLOB_DYNAMIC MOD0_CONFIG: DATARATE_M (Bit 0) */
#define MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_DATARATE_M_Msk                    (0xffffUL)		/*!< MR_SUBG_GLOB_DYNAMIC MOD0_CONFIG: DATARATE_M (Bitfield-Mask: 0xffff) */
#define MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_DATARATE_M                        MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_DATARATE_M_Msk
#define MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_DATARATE_M_0                      (0x1U << MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_DATARATE_M_Pos)
#define MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_DATARATE_M_1                      (0x2U << MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_DATARATE_M_Pos)
#define MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_DATARATE_M_2                      (0x4U << MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_DATARATE_M_Pos)
#define MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_DATARATE_M_3                      (0x8U << MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_DATARATE_M_Pos)
#define MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_DATARATE_M_4                      (0x10U << MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_DATARATE_M_Pos)
#define MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_DATARATE_M_5                      (0x20U << MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_DATARATE_M_Pos)
#define MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_DATARATE_M_6                      (0x40U << MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_DATARATE_M_Pos)
#define MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_DATARATE_M_7                      (0x80U << MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_DATARATE_M_Pos)
#define MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_DATARATE_M_8                      (0x100U << MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_DATARATE_M_Pos)
#define MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_DATARATE_M_9                      (0x200U << MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_DATARATE_M_Pos)
#define MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_DATARATE_M_10                     (0x400U << MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_DATARATE_M_Pos)
#define MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_DATARATE_M_11                     (0x800U << MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_DATARATE_M_Pos)
#define MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_DATARATE_M_12                     (0x1000U << MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_DATARATE_M_Pos)
#define MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_DATARATE_M_13                     (0x2000U << MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_DATARATE_M_Pos)
#define MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_DATARATE_M_14                     (0x4000U << MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_DATARATE_M_Pos)
#define MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_DATARATE_M_15                     (0x8000U << MR_SUBG_GLOB_DYNAMIC_MOD0_CONFIG_DATARATE_M_Pos)

/* =====================================================    MOD1_CONFIG    =====================================================*/ 
#define MR_SUBG_GLOB_DYNAMIC_MOD1_CONFIG_CHFLT_E_Pos                       (20UL)		/*!<MR_SUBG_GLOB_DYNAMIC MOD1_CONFIG: CHFLT_E (Bit 20) */
#define MR_SUBG_GLOB_DYNAMIC_MOD1_CONFIG_CHFLT_E_Msk                       (0xf00000UL)		/*!< MR_SUBG_GLOB_DYNAMIC MOD1_CONFIG: CHFLT_E (Bitfield-Mask: 0x0f) */
#define MR_SUBG_GLOB_DYNAMIC_MOD1_CONFIG_CHFLT_E                           MR_SUBG_GLOB_DYNAMIC_MOD1_CONFIG_CHFLT_E_Msk
#define MR_SUBG_GLOB_DYNAMIC_MOD1_CONFIG_CHFLT_E_0                         (0x1U << MR_SUBG_GLOB_DYNAMIC_MOD1_CONFIG_CHFLT_E_Pos)
#define MR_SUBG_GLOB_DYNAMIC_MOD1_CONFIG_CHFLT_E_1                         (0x2U << MR_SUBG_GLOB_DYNAMIC_MOD1_CONFIG_CHFLT_E_Pos)
#define MR_SUBG_GLOB_DYNAMIC_MOD1_CONFIG_CHFLT_E_2                         (0x4U << MR_SUBG_GLOB_DYNAMIC_MOD1_CONFIG_CHFLT_E_Pos)
#define MR_SUBG_GLOB_DYNAMIC_MOD1_CONFIG_CHFLT_E_3                         (0x8U << MR_SUBG_GLOB_DYNAMIC_MOD1_CONFIG_CHFLT_E_Pos)
#define MR_SUBG_GLOB_DYNAMIC_MOD1_CONFIG_CHFLT_M_Pos                       (16UL)		/*!<MR_SUBG_GLOB_DYNAMIC MOD1_CONFIG: CHFLT_M (Bit 16) */
#define MR_SUBG_GLOB_DYNAMIC_MOD1_CONFIG_CHFLT_M_Msk                       (0xf0000UL)		/*!< MR_SUBG_GLOB_DYNAMIC MOD1_CONFIG: CHFLT_M (Bitfield-Mask: 0x0f) */
#define MR_SUBG_GLOB_DYNAMIC_MOD1_CONFIG_CHFLT_M                           MR_SUBG_GLOB_DYNAMIC_MOD1_CONFIG_CHFLT_M_Msk
#define MR_SUBG_GLOB_DYNAMIC_MOD1_CONFIG_CHFLT_M_0                         (0x1U << MR_SUBG_GLOB_DYNAMIC_MOD1_CONFIG_CHFLT_M_Pos)
#define MR_SUBG_GLOB_DYNAMIC_MOD1_CONFIG_CHFLT_M_1                         (0x2U << MR_SUBG_GLOB_DYNAMIC_MOD1_CONFIG_CHFLT_M_Pos)
#define MR_SUBG_GLOB_DYNAMIC_MOD1_CONFIG_CHFLT_M_2                         (0x4U << MR_SUBG_GLOB_DYNAMIC_MOD1_CONFIG_CHFLT_M_Pos)
#define MR_SUBG_GLOB_DYNAMIC_MOD1_CONFIG_CHFLT_M_3                         (0x8U << MR_SUBG_GLOB_DYNAMIC_MOD1_CONFIG_CHFLT_M_Pos)
#define MR_SUBG_GLOB_DYNAMIC_MOD1_CONFIG_FDEV_E_Pos                        (8UL)		/*!<MR_SUBG_GLOB_DYNAMIC MOD1_CONFIG: FDEV_E (Bit 8) */
#define MR_SUBG_GLOB_DYNAMIC_MOD1_CONFIG_FDEV_E_Msk                        (0xf00UL)		/*!< MR_SUBG_GLOB_DYNAMIC MOD1_CONFIG: FDEV_E (Bitfield-Mask: 0x0f) */
#define MR_SUBG_GLOB_DYNAMIC_MOD1_CONFIG_FDEV_E                            MR_SUBG_GLOB_DYNAMIC_MOD1_CONFIG_FDEV_E_Msk
#define MR_SUBG_GLOB_DYNAMIC_MOD1_CONFIG_FDEV_E_0                          (0x1U << MR_SUBG_GLOB_DYNAMIC_MOD1_CONFIG_FDEV_E_Pos)
#define MR_SUBG_GLOB_DYNAMIC_MOD1_CONFIG_FDEV_E_1                          (0x2U << MR_SUBG_GLOB_DYNAMIC_MOD1_CONFIG_FDEV_E_Pos)
#define MR_SUBG_GLOB_DYNAMIC_MOD1_CONFIG_FDEV_E_2                          (0x4U << MR_SUBG_GLOB_DYNAMIC_MOD1_CONFIG_FDEV_E_Pos)
#define MR_SUBG_GLOB_DYNAMIC_MOD1_CONFIG_FDEV_E_3                          (0x8U << MR_SUBG_GLOB_DYNAMIC_MOD1_CONFIG_FDEV_E_Pos)
#define MR_SUBG_GLOB_DYNAMIC_MOD1_CONFIG_FDEV_M_Pos                        (0UL)		/*!<MR_SUBG_GLOB_DYNAMIC MOD1_CONFIG: FDEV_M (Bit 0) */
#define MR_SUBG_GLOB_DYNAMIC_MOD1_CONFIG_FDEV_M_Msk                        (0xffUL)		/*!< MR_SUBG_GLOB_DYNAMIC MOD1_CONFIG: FDEV_M (Bitfield-Mask: 0xff) */
#define MR_SUBG_GLOB_DYNAMIC_MOD1_CONFIG_FDEV_M                            MR_SUBG_GLOB_DYNAMIC_MOD1_CONFIG_FDEV_M_Msk
#define MR_SUBG_GLOB_DYNAMIC_MOD1_CONFIG_FDEV_M_0                          (0x1U << MR_SUBG_GLOB_DYNAMIC_MOD1_CONFIG_FDEV_M_Pos)
#define MR_SUBG_GLOB_DYNAMIC_MOD1_CONFIG_FDEV_M_1                          (0x2U << MR_SUBG_GLOB_DYNAMIC_MOD1_CONFIG_FDEV_M_Pos)
#define MR_SUBG_GLOB_DYNAMIC_MOD1_CONFIG_FDEV_M_2                          (0x4U << MR_SUBG_GLOB_DYNAMIC_MOD1_CONFIG_FDEV_M_Pos)
#define MR_SUBG_GLOB_DYNAMIC_MOD1_CONFIG_FDEV_M_3                          (0x8U << MR_SUBG_GLOB_DYNAMIC_MOD1_CONFIG_FDEV_M_Pos)
#define MR_SUBG_GLOB_DYNAMIC_MOD1_CONFIG_FDEV_M_4                          (0x10U << MR_SUBG_GLOB_DYNAMIC_MOD1_CONFIG_FDEV_M_Pos)
#define MR_SUBG_GLOB_DYNAMIC_MOD1_CONFIG_FDEV_M_5                          (0x20U << MR_SUBG_GLOB_DYNAMIC_MOD1_CONFIG_FDEV_M_Pos)
#define MR_SUBG_GLOB_DYNAMIC_MOD1_CONFIG_FDEV_M_6                          (0x40U << MR_SUBG_GLOB_DYNAMIC_MOD1_CONFIG_FDEV_M_Pos)
#define MR_SUBG_GLOB_DYNAMIC_MOD1_CONFIG_FDEV_M_7                          (0x80U << MR_SUBG_GLOB_DYNAMIC_MOD1_CONFIG_FDEV_M_Pos)

/* =====================================================    SYNTH_FREQ    =====================================================*/ 
#define MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_BS_Pos                             (30UL)		/*!<MR_SUBG_GLOB_DYNAMIC SYNTH_FREQ: BS (Bit 30) */
#define MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_BS_Msk                             (0x40000000UL)		/*!< MR_SUBG_GLOB_DYNAMIC SYNTH_FREQ: BS (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_BS                                 MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_BS_Msk
#define MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_SYNTH_INT_Pos                      (20UL)		/*!<MR_SUBG_GLOB_DYNAMIC SYNTH_FREQ: SYNTH_INT (Bit 20) */
#define MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_SYNTH_INT_Msk                      (0xff00000UL)		/*!< MR_SUBG_GLOB_DYNAMIC SYNTH_FREQ: SYNTH_INT (Bitfield-Mask: 0xff) */
#define MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_SYNTH_INT                          MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_SYNTH_INT_Msk
#define MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_SYNTH_INT_0                        (0x1U << MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_SYNTH_INT_Pos)
#define MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_SYNTH_INT_1                        (0x2U << MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_SYNTH_INT_Pos)
#define MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_SYNTH_INT_2                        (0x4U << MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_SYNTH_INT_Pos)
#define MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_SYNTH_INT_3                        (0x8U << MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_SYNTH_INT_Pos)
#define MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_SYNTH_INT_4                        (0x10U << MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_SYNTH_INT_Pos)
#define MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_SYNTH_INT_5                        (0x20U << MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_SYNTH_INT_Pos)
#define MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_SYNTH_INT_6                        (0x40U << MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_SYNTH_INT_Pos)
#define MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_SYNTH_INT_7                        (0x80U << MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_SYNTH_INT_Pos)
#define MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_SYNTH_FRAC_Pos                     (0UL)		/*!<MR_SUBG_GLOB_DYNAMIC SYNTH_FREQ: SYNTH_FRAC (Bit 0) */
#define MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_SYNTH_FRAC_Msk                     (0xfffffUL)		/*!< MR_SUBG_GLOB_DYNAMIC SYNTH_FREQ: SYNTH_FRAC (Bitfield-Mask: 0xfffff) */
#define MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_SYNTH_FRAC                         MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_SYNTH_FRAC_Msk
#define MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_SYNTH_FRAC_0                       (0x1U << MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_SYNTH_FRAC_Pos)
#define MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_SYNTH_FRAC_1                       (0x2U << MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_SYNTH_FRAC_Pos)
#define MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_SYNTH_FRAC_2                       (0x4U << MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_SYNTH_FRAC_Pos)
#define MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_SYNTH_FRAC_3                       (0x8U << MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_SYNTH_FRAC_Pos)
#define MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_SYNTH_FRAC_4                       (0x10U << MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_SYNTH_FRAC_Pos)
#define MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_SYNTH_FRAC_5                       (0x20U << MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_SYNTH_FRAC_Pos)
#define MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_SYNTH_FRAC_6                       (0x40U << MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_SYNTH_FRAC_Pos)
#define MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_SYNTH_FRAC_7                       (0x80U << MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_SYNTH_FRAC_Pos)
#define MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_SYNTH_FRAC_8                       (0x100U << MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_SYNTH_FRAC_Pos)
#define MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_SYNTH_FRAC_9                       (0x200U << MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_SYNTH_FRAC_Pos)
#define MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_SYNTH_FRAC_10                      (0x400U << MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_SYNTH_FRAC_Pos)
#define MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_SYNTH_FRAC_11                      (0x800U << MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_SYNTH_FRAC_Pos)
#define MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_SYNTH_FRAC_12                      (0x1000U << MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_SYNTH_FRAC_Pos)
#define MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_SYNTH_FRAC_13                      (0x2000U << MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_SYNTH_FRAC_Pos)
#define MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_SYNTH_FRAC_14                      (0x4000U << MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_SYNTH_FRAC_Pos)
#define MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_SYNTH_FRAC_15                      (0x8000U << MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_SYNTH_FRAC_Pos)
#define MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_SYNTH_FRAC_16                      (0x10000U << MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_SYNTH_FRAC_Pos)
#define MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_SYNTH_FRAC_17                      (0x20000U << MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_SYNTH_FRAC_Pos)
#define MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_SYNTH_FRAC_18                      (0x40000U << MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_SYNTH_FRAC_Pos)
#define MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_SYNTH_FRAC_19                      (0x80000U << MR_SUBG_GLOB_DYNAMIC_SYNTH_FREQ_SYNTH_FRAC_Pos)

