embetech-official/embenet-demo-nucleo-wl33cc1/Drivers/CMSIS/Device/ST/STM32WL3X/Include/stm32wl33.h
/* =====================================================    WAKEUP_IRQ_STATUS    =====================================================*/ 
#define MR_SUBG_GLOB_MISC_WAKEUP_IRQ_STATUS_RFIP_WAKEUP_F_Pos              (1UL)		/*!<MR_SUBG_GLOB_MISC WAKEUP_IRQ_STATUS: RFIP_WAKEUP_F (Bit 1) */
#define MR_SUBG_GLOB_MISC_WAKEUP_IRQ_STATUS_RFIP_WAKEUP_F_Msk              (0x2UL)		/*!< MR_SUBG_GLOB_MISC WAKEUP_IRQ_STATUS: RFIP_WAKEUP_F (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_MISC_WAKEUP_IRQ_STATUS_RFIP_WAKEUP_F                  MR_SUBG_GLOB_MISC_WAKEUP_IRQ_STATUS_RFIP_WAKEUP_F_Msk
#define MR_SUBG_GLOB_MISC_WAKEUP_IRQ_STATUS_CPU_WAKEUP_F_Pos               (0UL)		/*!<MR_SUBG_GLOB_MISC WAKEUP_IRQ_STATUS: CPU_WAKEUP_F (Bit 0) */
#define MR_SUBG_GLOB_MISC_WAKEUP_IRQ_STATUS_CPU_WAKEUP_F_Msk               (0x1UL)		/*!< MR_SUBG_GLOB_MISC WAKEUP_IRQ_STATUS: CPU_WAKEUP_F (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_MISC_WAKEUP_IRQ_STATUS_CPU_WAKEUP_F                   MR_SUBG_GLOB_MISC_WAKEUP_IRQ_STATUS_CPU_WAKEUP_F_Msk


/* ============================================================================================================================*/ 
/*=====================                               MR_SUBG_GLOB_RETAINED                               =====================*/ 
/* ============================================================================================================================*/ 

/* =====================================================    RFIP_WAKEUPTIME    =====================================================*/ 
#define MR_SUBG_GLOB_RETAINED_RFIP_WAKEUPTIME_RFIP_WAKEUPTIME_Pos          (0UL)		/*!<MR_SUBG_GLOB_RETAINED RFIP_WAKEUPTIME: RFIP_WAKEUPTIME (Bit 0) */
#define MR_SUBG_GLOB_RETAINED_RFIP_WAKEUPTIME_RFIP_WAKEUPTIME_Msk          (0xffffffffUL)		/*!< MR_SUBG_GLOB_RETAINED RFIP_WAKEUPTIME: RFIP_WAKEUPTIME (Bitfield-Mask: 0xffffffff) */
#define MR_SUBG_GLOB_RETAINED_RFIP_WAKEUPTIME_RFIP_WAKEUPTIME              MR_SUBG_GLOB_RETAINED_RFIP_WAKEUPTIME_RFIP_WAKEUPTIME_Msk
#define MR_SUBG_GLOB_RETAINED_RFIP_WAKEUPTIME_RFIP_WAKEUPTIME_0            (0x1U << MR_SUBG_GLOB_RETAINED_RFIP_WAKEUPTIME_RFIP_WAKEUPTIME_Pos)
#define MR_SUBG_GLOB_RETAINED_RFIP_WAKEUPTIME_RFIP_WAKEUPTIME_1            (0x2U << MR_SUBG_GLOB_RETAINED_RFIP_WAKEUPTIME_RFIP_WAKEUPTIME_Pos)
#define MR_SUBG_GLOB_RETAINED_RFIP_WAKEUPTIME_RFIP_WAKEUPTIME_2            (0x4U << MR_SUBG_GLOB_RETAINED_RFIP_WAKEUPTIME_RFIP_WAKEUPTIME_Pos)
#define MR_SUBG_GLOB_RETAINED_RFIP_WAKEUPTIME_RFIP_WAKEUPTIME_3            (0x8U << MR_SUBG_GLOB_RETAINED_RFIP_WAKEUPTIME_RFIP_WAKEUPTIME_Pos)
#define MR_SUBG_GLOB_RETAINED_RFIP_WAKEUPTIME_RFIP_WAKEUPTIME_4            (0x10U << MR_SUBG_GLOB_RETAINED_RFIP_WAKEUPTIME_RFIP_WAKEUPTIME_Pos)
#define MR_SUBG_GLOB_RETAINED_RFIP_WAKEUPTIME_RFIP_WAKEUPTIME_5            (0x20U << MR_SUBG_GLOB_RETAINED_RFIP_WAKEUPTIME_RFIP_WAKEUPTIME_Pos)
#define MR_SUBG_GLOB_RETAINED_RFIP_WAKEUPTIME_RFIP_WAKEUPTIME_6            (0x40U << MR_SUBG_GLOB_RETAINED_RFIP_WAKEUPTIME_RFIP_WAKEUPTIME_Pos)
#define MR_SUBG_GLOB_RETAINED_RFIP_WAKEUPTIME_RFIP_WAKEUPTIME_7            (0x80U << MR_SUBG_GLOB_RETAINED_RFIP_WAKEUPTIME_RFIP_WAKEUPTIME_Pos)
#define MR_SUBG_GLOB_RETAINED_RFIP_WAKEUPTIME_RFIP_WAKEUPTIME_8            (0x100U << MR_SUBG_GLOB_RETAINED_RFIP_WAKEUPTIME_RFIP_WAKEUPTIME_Pos)
#define MR_SUBG_GLOB_RETAINED_RFIP_WAKEUPTIME_RFIP_WAKEUPTIME_9            (0x200U << MR_SUBG_GLOB_RETAINED_RFIP_WAKEUPTIME_RFIP_WAKEUPTIME_Pos)
#define MR_SUBG_GLOB_RETAINED_RFIP_WAKEUPTIME_RFIP_WAKEUPTIME_10           (0x400U << MR_SUBG_GLOB_RETAINED_RFIP_WAKEUPTIME_RFIP_WAKEUPTIME_Pos)
#define MR_SUBG_GLOB_RETAINED_RFIP_WAKEUPTIME_RFIP_WAKEUPTIME_11           (0x800U << MR_SUBG_GLOB_RETAINED_RFIP_WAKEUPTIME_RFIP_WAKEUPTIME_Pos)
#define MR_SUBG_GLOB_RETAINED_RFIP_WAKEUPTIME_RFIP_WAKEUPTIME_12           (0x1000U << MR_SUBG_GLOB_RETAINED_RFIP_WAKEUPTIME_RFIP_WAKEUPTIME_Pos)
#define MR_SUBG_GLOB_RETAINED_RFIP_WAKEUPTIME_RFIP_WAKEUPTIME_13           (0x2000U << MR_SUBG_GLOB_RETAINED_RFIP_WAKEUPTIME_RFIP_WAKEUPTIME_Pos)
#define MR_SUBG_GLOB_RETAINED_RFIP_WAKEUPTIME_RFIP_WAKEUPTIME_14           (0x4000U << MR_SUBG_GLOB_RETAINED_RFIP_WAKEUPTIME_RFIP_WAKEUPTIME_Pos)
#define MR_SUBG_GLOB_RETAINED_RFIP_WAKEUPTIME_RFIP_WAKEUPTIME_15           (0x8000U << MR_SUBG_GLOB_RETAINED_RFIP_WAKEUPTIME_RFIP_WAKEUPTIME_Pos)
#define MR_SUBG_GLOB_RETAINED_RFIP_WAKEUPTIME_RFIP_WAKEUPTIME_16           (0x10000U << MR_SUBG_GLOB_RETAINED_RFIP_WAKEUPTIME_RFIP_WAKEUPTIME_Pos)
#define MR_SUBG_GLOB_RETAINED_RFIP_WAKEUPTIME_RFIP_WAKEUPTIME_17           (0x20000U << MR_SUBG_GLOB_RETAINED_RFIP_WAKEUPTIME_RFIP_WAKEUPTIME_Pos)
#define MR_SUBG_GLOB_RETAINED_RFIP_WAKEUPTIME_RFIP_WAKEUPTIME_18           (0x40000U << MR_SUBG_GLOB_RETAINED_RFIP_WAKEUPTIME_RFIP_WAKEUPTIME_Pos)
#define MR_SUBG_GLOB_RETAINED_RFIP_WAKEUPTIME_RFIP_WAKEUPTIME_19           (0x80000U << MR_SUBG_GLOB_RETAINED_RFIP_WAKEUPTIME_RFIP_WAKEUPTIME_Pos)
#define MR_SUBG_GLOB_RETAINED_RFIP_WAKEUPTIME_RFIP_WAKEUPTIME_20           (0x100000U << MR_SUBG_GLOB_RETAINED_RFIP_WAKEUPTIME_RFIP_WAKEUPTIME_Pos)
#define MR_SUBG_GLOB_RETAINED_RFIP_WAKEUPTIME_RFIP_WAKEUPTIME_21           (0x200000U << MR_SUBG_GLOB_RETAINED_RFIP_WAKEUPTIME_RFIP_WAKEUPTIME_Pos)
#define MR_SUBG_GLOB_RETAINED_RFIP_WAKEUPTIME_RFIP_WAKEUPTIME_22           (0x400000U << MR_SUBG_GLOB_RETAINED_RFIP_WAKEUPTIME_RFIP_WAKEUPTIME_Pos)
#define MR_SUBG_GLOB_RETAINED_RFIP_WAKEUPTIME_RFIP_WAKEUPTIME_23           (0x800000U << MR_SUBG_GLOB_RETAINED_RFIP_WAKEUPTIME_RFIP_WAKEUPTIME_Pos)
#define MR_SUBG_GLOB_RETAINED_RFIP_WAKEUPTIME_RFIP_WAKEUPTIME_24           (0x1000000U << MR_SUBG_GLOB_RETAINED_RFIP_WAKEUPTIME_RFIP_WAKEUPTIME_Pos)
#define MR_SUBG_GLOB_RETAINED_RFIP_WAKEUPTIME_RFIP_WAKEUPTIME_25           (0x2000000U << MR_SUBG_GLOB_RETAINED_RFIP_WAKEUPTIME_RFIP_WAKEUPTIME_Pos)
#define MR_SUBG_GLOB_RETAINED_RFIP_WAKEUPTIME_RFIP_WAKEUPTIME_26           (0x4000000U << MR_SUBG_GLOB_RETAINED_RFIP_WAKEUPTIME_RFIP_WAKEUPTIME_Pos)
#define MR_SUBG_GLOB_RETAINED_RFIP_WAKEUPTIME_RFIP_WAKEUPTIME_27           (0x8000000U << MR_SUBG_GLOB_RETAINED_RFIP_WAKEUPTIME_RFIP_WAKEUPTIME_Pos)
#define MR_SUBG_GLOB_RETAINED_RFIP_WAKEUPTIME_RFIP_WAKEUPTIME_28           (0x10000000U << MR_SUBG_GLOB_RETAINED_RFIP_WAKEUPTIME_RFIP_WAKEUPTIME_Pos)
#define MR_SUBG_GLOB_RETAINED_RFIP_WAKEUPTIME_RFIP_WAKEUPTIME_29           (0x20000000U << MR_SUBG_GLOB_RETAINED_RFIP_WAKEUPTIME_RFIP_WAKEUPTIME_Pos)
#define MR_SUBG_GLOB_RETAINED_RFIP_WAKEUPTIME_RFIP_WAKEUPTIME_30           (0x40000000U << MR_SUBG_GLOB_RETAINED_RFIP_WAKEUPTIME_RFIP_WAKEUPTIME_Pos)
#define MR_SUBG_GLOB_RETAINED_RFIP_WAKEUPTIME_RFIP_WAKEUPTIME_31           (0x80000000UL << MR_SUBG_GLOB_RETAINED_RFIP_WAKEUPTIME_RFIP_WAKEUPTIME_Pos)

/* =====================================================    CPU_WAKEUPTIME    =====================================================*/ 
#define MR_SUBG_GLOB_RETAINED_CPU_WAKEUPTIME_CPU_WAKEUPTIME_Pos            (1UL)		/*!<MR_SUBG_GLOB_RETAINED CPU_WAKEUPTIME: CPU_WAKEUPTIME (Bit 1) */
#define MR_SUBG_GLOB_RETAINED_CPU_WAKEUPTIME_CPU_WAKEUPTIME_Msk            (0xfffffffeUL)		/*!< MR_SUBG_GLOB_RETAINED CPU_WAKEUPTIME: CPU_WAKEUPTIME (Bitfield-Mask: 0x7fffffff) */
#define MR_SUBG_GLOB_RETAINED_CPU_WAKEUPTIME_CPU_WAKEUPTIME                MR_SUBG_GLOB_RETAINED_CPU_WAKEUPTIME_CPU_WAKEUPTIME_Msk
#define MR_SUBG_GLOB_RETAINED_CPU_WAKEUPTIME_CPU_WAKEUPTIME_0              (0x1U << MR_SUBG_GLOB_RETAINED_CPU_WAKEUPTIME_CPU_WAKEUPTIME_Pos)
#define MR_SUBG_GLOB_RETAINED_CPU_WAKEUPTIME_CPU_WAKEUPTIME_1              (0x2U << MR_SUBG_GLOB_RETAINED_CPU_WAKEUPTIME_CPU_WAKEUPTIME_Pos)
#define MR_SUBG_GLOB_RETAINED_CPU_WAKEUPTIME_CPU_WAKEUPTIME_2              (0x4U << MR_SUBG_GLOB_RETAINED_CPU_WAKEUPTIME_CPU_WAKEUPTIME_Pos)
#define MR_SUBG_GLOB_RETAINED_CPU_WAKEUPTIME_CPU_WAKEUPTIME_3              (0x8U << MR_SUBG_GLOB_RETAINED_CPU_WAKEUPTIME_CPU_WAKEUPTIME_Pos)
#define MR_SUBG_GLOB_RETAINED_CPU_WAKEUPTIME_CPU_WAKEUPTIME_4              (0x10U << MR_SUBG_GLOB_RETAINED_CPU_WAKEUPTIME_CPU_WAKEUPTIME_Pos)
#define MR_SUBG_GLOB_RETAINED_CPU_WAKEUPTIME_CPU_WAKEUPTIME_5              (0x20U << MR_SUBG_GLOB_RETAINED_CPU_WAKEUPTIME_CPU_WAKEUPTIME_Pos)
#define MR_SUBG_GLOB_RETAINED_CPU_WAKEUPTIME_CPU_WAKEUPTIME_6              (0x40U << MR_SUBG_GLOB_RETAINED_CPU_WAKEUPTIME_CPU_WAKEUPTIME_Pos)
#define MR_SUBG_GLOB_RETAINED_CPU_WAKEUPTIME_CPU_WAKEUPTIME_7              (0x80U << MR_SUBG_GLOB_RETAINED_CPU_WAKEUPTIME_CPU_WAKEUPTIME_Pos)
#define MR_SUBG_GLOB_RETAINED_CPU_WAKEUPTIME_CPU_WAKEUPTIME_8              (0x100U << MR_SUBG_GLOB_RETAINED_CPU_WAKEUPTIME_CPU_WAKEUPTIME_Pos)
#define MR_SUBG_GLOB_RETAINED_CPU_WAKEUPTIME_CPU_WAKEUPTIME_9              (0x200U << MR_SUBG_GLOB_RETAINED_CPU_WAKEUPTIME_CPU_WAKEUPTIME_Pos)
#define MR_SUBG_GLOB_RETAINED_CPU_WAKEUPTIME_CPU_WAKEUPTIME_10             (0x400U << MR_SUBG_GLOB_RETAINED_CPU_WAKEUPTIME_CPU_WAKEUPTIME_Pos)
#define MR_SUBG_GLOB_RETAINED_CPU_WAKEUPTIME_CPU_WAKEUPTIME_11             (0x800U << MR_SUBG_GLOB_RETAINED_CPU_WAKEUPTIME_CPU_WAKEUPTIME_Pos)
#define MR_SUBG_GLOB_RETAINED_CPU_WAKEUPTIME_CPU_WAKEUPTIME_12             (0x1000U << MR_SUBG_GLOB_RETAINED_CPU_WAKEUPTIME_CPU_WAKEUPTIME_Pos)
#define MR_SUBG_GLOB_RETAINED_CPU_WAKEUPTIME_CPU_WAKEUPTIME_13             (0x2000U << MR_SUBG_GLOB_RETAINED_CPU_WAKEUPTIME_CPU_WAKEUPTIME_Pos)
#define MR_SUBG_GLOB_RETAINED_CPU_WAKEUPTIME_CPU_WAKEUPTIME_14             (0x4000U << MR_SUBG_GLOB_RETAINED_CPU_WAKEUPTIME_CPU_WAKEUPTIME_Pos)
#define MR_SUBG_GLOB_RETAINED_CPU_WAKEUPTIME_CPU_WAKEUPTIME_15             (0x8000U << MR_SUBG_GLOB_RETAINED_CPU_WAKEUPTIME_CPU_WAKEUPTIME_Pos)
#define MR_SUBG_GLOB_RETAINED_CPU_WAKEUPTIME_CPU_WAKEUPTIME_16             (0x10000U << MR_SUBG_GLOB_RETAINED_CPU_WAKEUPTIME_CPU_WAKEUPTIME_Pos)
#define MR_SUBG_GLOB_RETAINED_CPU_WAKEUPTIME_CPU_WAKEUPTIME_17             (0x20000U << MR_SUBG_GLOB_RETAINED_CPU_WAKEUPTIME_CPU_WAKEUPTIME_Pos)
#define MR_SUBG_GLOB_RETAINED_CPU_WAKEUPTIME_CPU_WAKEUPTIME_18             (0x40000U << MR_SUBG_GLOB_RETAINED_CPU_WAKEUPTIME_CPU_WAKEUPTIME_Pos)
#define MR_SUBG_GLOB_RETAINED_CPU_WAKEUPTIME_CPU_WAKEUPTIME_19             (0x80000U << MR_SUBG_GLOB_RETAINED_CPU_WAKEUPTIME_CPU_WAKEUPTIME_Pos)
#define MR_SUBG_GLOB_RETAINED_CPU_WAKEUPTIME_CPU_WAKEUPTIME_20             (0x100000U << MR_SUBG_GLOB_RETAINED_CPU_WAKEUPTIME_CPU_WAKEUPTIME_Pos)
#define MR_SUBG_GLOB_RETAINED_CPU_WAKEUPTIME_CPU_WAKEUPTIME_21             (0x200000U << MR_SUBG_GLOB_RETAINED_CPU_WAKEUPTIME_CPU_WAKEUPTIME_Pos)
#define MR_SUBG_GLOB_RETAINED_CPU_WAKEUPTIME_CPU_WAKEUPTIME_22             (0x400000U << MR_SUBG_GLOB_RETAINED_CPU_WAKEUPTIME_CPU_WAKEUPTIME_Pos)
#define MR_SUBG_GLOB_RETAINED_CPU_WAKEUPTIME_CPU_WAKEUPTIME_23             (0x800000U << MR_SUBG_GLOB_RETAINED_CPU_WAKEUPTIME_CPU_WAKEUPTIME_Pos)
#define MR_SUBG_GLOB_RETAINED_CPU_WAKEUPTIME_CPU_WAKEUPTIME_24             (0x1000000U << MR_SUBG_GLOB_RETAINED_CPU_WAKEUPTIME_CPU_WAKEUPTIME_Pos)
#define MR_SUBG_GLOB_RETAINED_CPU_WAKEUPTIME_CPU_WAKEUPTIME_25             (0x2000000U << MR_SUBG_GLOB_RETAINED_CPU_WAKEUPTIME_CPU_WAKEUPTIME_Pos)
#define MR_SUBG_GLOB_RETAINED_CPU_WAKEUPTIME_CPU_WAKEUPTIME_26             (0x4000000U << MR_SUBG_GLOB_RETAINED_CPU_WAKEUPTIME_CPU_WAKEUPTIME_Pos)
#define MR_SUBG_GLOB_RETAINED_CPU_WAKEUPTIME_CPU_WAKEUPTIME_27             (0x8000000U << MR_SUBG_GLOB_RETAINED_CPU_WAKEUPTIME_CPU_WAKEUPTIME_Pos)
#define MR_SUBG_GLOB_RETAINED_CPU_WAKEUPTIME_CPU_WAKEUPTIME_28             (0x10000000U << MR_SUBG_GLOB_RETAINED_CPU_WAKEUPTIME_CPU_WAKEUPTIME_Pos)
#define MR_SUBG_GLOB_RETAINED_CPU_WAKEUPTIME_CPU_WAKEUPTIME_29             (0x20000000U << MR_SUBG_GLOB_RETAINED_CPU_WAKEUPTIME_CPU_WAKEUPTIME_Pos)
#define MR_SUBG_GLOB_RETAINED_CPU_WAKEUPTIME_CPU_WAKEUPTIME_30             (0x40000000U << MR_SUBG_GLOB_RETAINED_CPU_WAKEUPTIME_CPU_WAKEUPTIME_Pos)

/* =====================================================    WAKEUP_CTRL    =====================================================*/ 
#define MR_SUBG_GLOB_RETAINED_WAKEUP_CTRL_RFIP_WAKEUP_EN_Pos               (31UL)		/*!<MR_SUBG_GLOB_RETAINED WAKEUP_CTRL: RFIP_WAKEUP_EN (Bit 31) */
#define MR_SUBG_GLOB_RETAINED_WAKEUP_CTRL_RFIP_WAKEUP_EN_Msk               (0x80000000UL)		/*!< MR_SUBG_GLOB_RETAINED WAKEUP_CTRL: RFIP_WAKEUP_EN (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_RETAINED_WAKEUP_CTRL_RFIP_WAKEUP_EN                   MR_SUBG_GLOB_RETAINED_WAKEUP_CTRL_RFIP_WAKEUP_EN_Msk
#define MR_SUBG_GLOB_RETAINED_WAKEUP_CTRL_CPU_WAKEUP_EN_Pos                (30UL)		/*!<MR_SUBG_GLOB_RETAINED WAKEUP_CTRL: CPU_WAKEUP_EN (Bit 30) */
#define MR_SUBG_GLOB_RETAINED_WAKEUP_CTRL_CPU_WAKEUP_EN_Msk                (0x40000000UL)		/*!< MR_SUBG_GLOB_RETAINED WAKEUP_CTRL: CPU_WAKEUP_EN (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_RETAINED_WAKEUP_CTRL_CPU_WAKEUP_EN                    MR_SUBG_GLOB_RETAINED_WAKEUP_CTRL_CPU_WAKEUP_EN_Msk
#define MR_SUBG_GLOB_RETAINED_WAKEUP_CTRL_SOC_WAKEUP_OFFSET_Pos            (0UL)		/*!<MR_SUBG_GLOB_RETAINED WAKEUP_CTRL: SOC_WAKEUP_OFFSET (Bit 0) */
#define MR_SUBG_GLOB_RETAINED_WAKEUP_CTRL_SOC_WAKEUP_OFFSET_Msk            (0xffUL)		/*!< MR_SUBG_GLOB_RETAINED WAKEUP_CTRL: SOC_WAKEUP_OFFSET (Bitfield-Mask: 0xff) */
#define MR_SUBG_GLOB_RETAINED_WAKEUP_CTRL_SOC_WAKEUP_OFFSET                MR_SUBG_GLOB_RETAINED_WAKEUP_CTRL_SOC_WAKEUP_OFFSET_Msk
#define MR_SUBG_GLOB_RETAINED_WAKEUP_CTRL_SOC_WAKEUP_OFFSET_0              (0x1U << MR_SUBG_GLOB_RETAINED_WAKEUP_CTRL_SOC_WAKEUP_OFFSET_Pos)
#define MR_SUBG_GLOB_RETAINED_WAKEUP_CTRL_SOC_WAKEUP_OFFSET_1              (0x2U << MR_SUBG_GLOB_RETAINED_WAKEUP_CTRL_SOC_WAKEUP_OFFSET_Pos)
#define MR_SUBG_GLOB_RETAINED_WAKEUP_CTRL_SOC_WAKEUP_OFFSET_2              (0x4U << MR_SUBG_GLOB_RETAINED_WAKEUP_CTRL_SOC_WAKEUP_OFFSET_Pos)
#define MR_SUBG_GLOB_RETAINED_WAKEUP_CTRL_SOC_WAKEUP_OFFSET_3              (0x8U << MR_SUBG_GLOB_RETAINED_WAKEUP_CTRL_SOC_WAKEUP_OFFSET_Pos)
#define MR_SUBG_GLOB_RETAINED_WAKEUP_CTRL_SOC_WAKEUP_OFFSET_4              (0x10U << MR_SUBG_GLOB_RETAINED_WAKEUP_CTRL_SOC_WAKEUP_OFFSET_Pos)
#define MR_SUBG_GLOB_RETAINED_WAKEUP_CTRL_SOC_WAKEUP_OFFSET_5              (0x20U << MR_SUBG_GLOB_RETAINED_WAKEUP_CTRL_SOC_WAKEUP_OFFSET_Pos)
#define MR_SUBG_GLOB_RETAINED_WAKEUP_CTRL_SOC_WAKEUP_OFFSET_6              (0x40U << MR_SUBG_GLOB_RETAINED_WAKEUP_CTRL_SOC_WAKEUP_OFFSET_Pos)
#define MR_SUBG_GLOB_RETAINED_WAKEUP_CTRL_SOC_WAKEUP_OFFSET_7              (0x80U << MR_SUBG_GLOB_RETAINED_WAKEUP_CTRL_SOC_WAKEUP_OFFSET_Pos)

/* =====================================================    RRM_CMDLIST_PTR    =====================================================*/ 
#define MR_SUBG_GLOB_RETAINED_RRM_CMDLIST_PTR_CMDLIST_PTR_VALID_Pos        (31UL)		/*!<MR_SUBG_GLOB_RETAINED RRM_CMDLIST_PTR: CMDLIST_PTR_VALID (Bit 31) */
#define MR_SUBG_GLOB_RETAINED_RRM_CMDLIST_PTR_CMDLIST_PTR_VALID_Msk        (0x80000000UL)		/*!< MR_SUBG_GLOB_RETAINED RRM_CMDLIST_PTR: CMDLIST_PTR_VALID (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_RETAINED_RRM_CMDLIST_PTR_CMDLIST_PTR_VALID            MR_SUBG_GLOB_RETAINED_RRM_CMDLIST_PTR_CMDLIST_PTR_VALID_Msk
#define MR_SUBG_GLOB_RETAINED_RRM_CMDLIST_PTR_CMDLIST_PTR_OFFSET_Pos       (0UL)		/*!<MR_SUBG_GLOB_RETAINED RRM_CMDLIST_PTR: CMDLIST_PTR_OFFSET (Bit 0) */
#define MR_SUBG_GLOB_RETAINED_RRM_CMDLIST_PTR_CMDLIST_PTR_OFFSET_Msk       (0xffffUL)		/*!< MR_SUBG_GLOB_RETAINED RRM_CMDLIST_PTR: CMDLIST_PTR_OFFSET (Bitfield-Mask: 0xffff) */
#define MR_SUBG_GLOB_RETAINED_RRM_CMDLIST_PTR_CMDLIST_PTR_OFFSET           MR_SUBG_GLOB_RETAINED_RRM_CMDLIST_PTR_CMDLIST_PTR_OFFSET_Msk
#define MR_SUBG_GLOB_RETAINED_RRM_CMDLIST_PTR_CMDLIST_PTR_OFFSET_0         (0x1U << MR_SUBG_GLOB_RETAINED_RRM_CMDLIST_PTR_CMDLIST_PTR_OFFSET_Pos)
#define MR_SUBG_GLOB_RETAINED_RRM_CMDLIST_PTR_CMDLIST_PTR_OFFSET_1         (0x2U << MR_SUBG_GLOB_RETAINED_RRM_CMDLIST_PTR_CMDLIST_PTR_OFFSET_Pos)
#define MR_SUBG_GLOB_RETAINED_RRM_CMDLIST_PTR_CMDLIST_PTR_OFFSET_2         (0x4U << MR_SUBG_GLOB_RETAINED_RRM_CMDLIST_PTR_CMDLIST_PTR_OFFSET_Pos)
#define MR_SUBG_GLOB_RETAINED_RRM_CMDLIST_PTR_CMDLIST_PTR_OFFSET_3         (0x8U << MR_SUBG_GLOB_RETAINED_RRM_CMDLIST_PTR_CMDLIST_PTR_OFFSET_Pos)
#define MR_SUBG_GLOB_RETAINED_RRM_CMDLIST_PTR_CMDLIST_PTR_OFFSET_4         (0x10U << MR_SUBG_GLOB_RETAINED_RRM_CMDLIST_PTR_CMDLIST_PTR_OFFSET_Pos)
#define MR_SUBG_GLOB_RETAINED_RRM_CMDLIST_PTR_CMDLIST_PTR_OFFSET_5         (0x20U << MR_SUBG_GLOB_RETAINED_RRM_CMDLIST_PTR_CMDLIST_PTR_OFFSET_Pos)
#define MR_SUBG_GLOB_RETAINED_RRM_CMDLIST_PTR_CMDLIST_PTR_OFFSET_6         (0x40U << MR_SUBG_GLOB_RETAINED_RRM_CMDLIST_PTR_CMDLIST_PTR_OFFSET_Pos)
#define MR_SUBG_GLOB_RETAINED_RRM_CMDLIST_PTR_CMDLIST_PTR_OFFSET_7         (0x80U << MR_SUBG_GLOB_RETAINED_RRM_CMDLIST_PTR_CMDLIST_PTR_OFFSET_Pos)
#define MR_SUBG_GLOB_RETAINED_RRM_CMDLIST_PTR_CMDLIST_PTR_OFFSET_8         (0x100U << MR_SUBG_GLOB_RETAINED_RRM_CMDLIST_PTR_CMDLIST_PTR_OFFSET_Pos)
#define MR_SUBG_GLOB_RETAINED_RRM_CMDLIST_PTR_CMDLIST_PTR_OFFSET_9         (0x200U << MR_SUBG_GLOB_RETAINED_RRM_CMDLIST_PTR_CMDLIST_PTR_OFFSET_Pos)
#define MR_SUBG_GLOB_RETAINED_RRM_CMDLIST_PTR_CMDLIST_PTR_OFFSET_10        (0x400U << MR_SUBG_GLOB_RETAINED_RRM_CMDLIST_PTR_CMDLIST_PTR_OFFSET_Pos)
#define MR_SUBG_GLOB_RETAINED_RRM_CMDLIST_PTR_CMDLIST_PTR_OFFSET_11        (0x800U << MR_SUBG_GLOB_RETAINED_RRM_CMDLIST_PTR_CMDLIST_PTR_OFFSET_Pos)
#define MR_SUBG_GLOB_RETAINED_RRM_CMDLIST_PTR_CMDLIST_PTR_OFFSET_12        (0x1000U << MR_SUBG_GLOB_RETAINED_RRM_CMDLIST_PTR_CMDLIST_PTR_OFFSET_Pos)
#define MR_SUBG_GLOB_RETAINED_RRM_CMDLIST_PTR_CMDLIST_PTR_OFFSET_13        (0x2000U << MR_SUBG_GLOB_RETAINED_RRM_CMDLIST_PTR_CMDLIST_PTR_OFFSET_Pos)
#define MR_SUBG_GLOB_RETAINED_RRM_CMDLIST_PTR_CMDLIST_PTR_OFFSET_14        (0x4000U << MR_SUBG_GLOB_RETAINED_RRM_CMDLIST_PTR_CMDLIST_PTR_OFFSET_Pos)
#define MR_SUBG_GLOB_RETAINED_RRM_CMDLIST_PTR_CMDLIST_PTR_OFFSET_15        (0x8000U << MR_SUBG_GLOB_RETAINED_RRM_CMDLIST_PTR_CMDLIST_PTR_OFFSET_Pos)

/* =====================================================    SEQ_GLOBALTABLE_PTR    =====================================================*/ 
#define MR_SUBG_GLOB_RETAINED_SEQ_GLOBALTABLE_PTR_SEQ_GLOBALTABLE_PTR_Pos  (0UL)		/*!<MR_SUBG_GLOB_RETAINED SEQ_GLOBALTABLE_PTR: SEQ_GLOBALTABLE_PTR (Bit 0) */
#define MR_SUBG_GLOB_RETAINED_SEQ_GLOBALTABLE_PTR_SEQ_GLOBALTABLE_PTR_Msk  (0xffffUL)		/*!< MR_SUBG_GLOB_RETAINED SEQ_GLOBALTABLE_PTR: SEQ_GLOBALTABLE_PTR (Bitfield-Mask: 0xffff) */
#define MR_SUBG_GLOB_RETAINED_SEQ_GLOBALTABLE_PTR_SEQ_GLOBALTABLE_PTR      MR_SUBG_GLOB_RETAINED_SEQ_GLOBALTABLE_PTR_SEQ_GLOBALTABLE_PTR_Msk
#define MR_SUBG_GLOB_RETAINED_SEQ_GLOBALTABLE_PTR_SEQ_GLOBALTABLE_PTR_0    (0x1U << MR_SUBG_GLOB_RETAINED_SEQ_GLOBALTABLE_PTR_SEQ_GLOBALTABLE_PTR_Pos)
#define MR_SUBG_GLOB_RETAINED_SEQ_GLOBALTABLE_PTR_SEQ_GLOBALTABLE_PTR_1    (0x2U << MR_SUBG_GLOB_RETAINED_SEQ_GLOBALTABLE_PTR_SEQ_GLOBALTABLE_PTR_Pos)
#define MR_SUBG_GLOB_RETAINED_SEQ_GLOBALTABLE_PTR_SEQ_GLOBALTABLE_PTR_2    (0x4U << MR_SUBG_GLOB_RETAINED_SEQ_GLOBALTABLE_PTR_SEQ_GLOBALTABLE_PTR_Pos)
#define MR_SUBG_GLOB_RETAINED_SEQ_GLOBALTABLE_PTR_SEQ_GLOBALTABLE_PTR_3    (0x8U << MR_SUBG_GLOB_RETAINED_SEQ_GLOBALTABLE_PTR_SEQ_GLOBALTABLE_PTR_Pos)
#define MR_SUBG_GLOB_RETAINED_SEQ_GLOBALTABLE_PTR_SEQ_GLOBALTABLE_PTR_4    (0x10U << MR_SUBG_GLOB_RETAINED_SEQ_GLOBALTABLE_PTR_SEQ_GLOBALTABLE_PTR_Pos)
#define MR_SUBG_GLOB_RETAINED_SEQ_GLOBALTABLE_PTR_SEQ_GLOBALTABLE_PTR_5    (0x20U << MR_SUBG_GLOB_RETAINED_SEQ_GLOBALTABLE_PTR_SEQ_GLOBALTABLE_PTR_Pos)
#define MR_SUBG_GLOB_RETAINED_SEQ_GLOBALTABLE_PTR_SEQ_GLOBALTABLE_PTR_6    (0x40U << MR_SUBG_GLOB_RETAINED_SEQ_GLOBALTABLE_PTR_SEQ_GLOBALTABLE_PTR_Pos)
#define MR_SUBG_GLOB_RETAINED_SEQ_GLOBALTABLE_PTR_SEQ_GLOBALTABLE_PTR_7    (0x80U << MR_SUBG_GLOB_RETAINED_SEQ_GLOBALTABLE_PTR_SEQ_GLOBALTABLE_PTR_Pos)
#define MR_SUBG_GLOB_RETAINED_SEQ_GLOBALTABLE_PTR_SEQ_GLOBALTABLE_PTR_8    (0x100U << MR_SUBG_GLOB_RETAINED_SEQ_GLOBALTABLE_PTR_SEQ_GLOBALTABLE_PTR_Pos)
#define MR_SUBG_GLOB_RETAINED_SEQ_GLOBALTABLE_PTR_SEQ_GLOBALTABLE_PTR_9    (0x200U << MR_SUBG_GLOB_RETAINED_SEQ_GLOBALTABLE_PTR_SEQ_GLOBALTABLE_PTR_Pos)
#define MR_SUBG_GLOB_RETAINED_SEQ_GLOBALTABLE_PTR_SEQ_GLOBALTABLE_PTR_10   (0x400U << MR_SUBG_GLOB_RETAINED_SEQ_GLOBALTABLE_PTR_SEQ_GLOBALTABLE_PTR_Pos)
#define MR_SUBG_GLOB_RETAINED_SEQ_GLOBALTABLE_PTR_SEQ_GLOBALTABLE_PTR_11   (0x800U << MR_SUBG_GLOB_RETAINED_SEQ_GLOBALTABLE_PTR_SEQ_GLOBALTABLE_PTR_Pos)
#define MR_SUBG_GLOB_RETAINED_SEQ_GLOBALTABLE_PTR_SEQ_GLOBALTABLE_PTR_12   (0x1000U << MR_SUBG_GLOB_RETAINED_SEQ_GLOBALTABLE_PTR_SEQ_GLOBALTABLE_PTR_Pos)
#define MR_SUBG_GLOB_RETAINED_SEQ_GLOBALTABLE_PTR_SEQ_GLOBALTABLE_PTR_13   (0x2000U << MR_SUBG_GLOB_RETAINED_SEQ_GLOBALTABLE_PTR_SEQ_GLOBALTABLE_PTR_Pos)
#define MR_SUBG_GLOB_RETAINED_SEQ_GLOBALTABLE_PTR_SEQ_GLOBALTABLE_PTR_14   (0x4000U << MR_SUBG_GLOB_RETAINED_SEQ_GLOBALTABLE_PTR_SEQ_GLOBALTABLE_PTR_Pos)
#define MR_SUBG_GLOB_RETAINED_SEQ_GLOBALTABLE_PTR_SEQ_GLOBALTABLE_PTR_15   (0x8000U << MR_SUBG_GLOB_RETAINED_SEQ_GLOBALTABLE_PTR_SEQ_GLOBALTABLE_PTR_Pos)


