embetech-official/embenet-demo-nucleo-wl33cc1/Drivers/CMSIS/Device/ST/STM32WL3X/Include/stm32wl33.h
/* =====================================================    DATABUFFER_SIZE    =====================================================*/ 
#define MR_SUBG_GLOB_STATIC_DATABUFFER_SIZE_DATABUFFER_SIZE_Pos            (0UL)		/*!<MR_SUBG_GLOB_STATIC DATABUFFER_SIZE: DATABUFFER_SIZE (Bit 0) */
#define MR_SUBG_GLOB_STATIC_DATABUFFER_SIZE_DATABUFFER_SIZE_Msk            (0xffffUL)		/*!< MR_SUBG_GLOB_STATIC DATABUFFER_SIZE: DATABUFFER_SIZE (Bitfield-Mask: 0xffff) */
#define MR_SUBG_GLOB_STATIC_DATABUFFER_SIZE_DATABUFFER_SIZE                MR_SUBG_GLOB_STATIC_DATABUFFER_SIZE_DATABUFFER_SIZE_Msk
#define MR_SUBG_GLOB_STATIC_DATABUFFER_SIZE_DATABUFFER_SIZE_0              (0x1U << MR_SUBG_GLOB_STATIC_DATABUFFER_SIZE_DATABUFFER_SIZE_Pos)
#define MR_SUBG_GLOB_STATIC_DATABUFFER_SIZE_DATABUFFER_SIZE_1              (0x2U << MR_SUBG_GLOB_STATIC_DATABUFFER_SIZE_DATABUFFER_SIZE_Pos)
#define MR_SUBG_GLOB_STATIC_DATABUFFER_SIZE_DATABUFFER_SIZE_2              (0x4U << MR_SUBG_GLOB_STATIC_DATABUFFER_SIZE_DATABUFFER_SIZE_Pos)
#define MR_SUBG_GLOB_STATIC_DATABUFFER_SIZE_DATABUFFER_SIZE_3              (0x8U << MR_SUBG_GLOB_STATIC_DATABUFFER_SIZE_DATABUFFER_SIZE_Pos)
#define MR_SUBG_GLOB_STATIC_DATABUFFER_SIZE_DATABUFFER_SIZE_4              (0x10U << MR_SUBG_GLOB_STATIC_DATABUFFER_SIZE_DATABUFFER_SIZE_Pos)
#define MR_SUBG_GLOB_STATIC_DATABUFFER_SIZE_DATABUFFER_SIZE_5              (0x20U << MR_SUBG_GLOB_STATIC_DATABUFFER_SIZE_DATABUFFER_SIZE_Pos)
#define MR_SUBG_GLOB_STATIC_DATABUFFER_SIZE_DATABUFFER_SIZE_6              (0x40U << MR_SUBG_GLOB_STATIC_DATABUFFER_SIZE_DATABUFFER_SIZE_Pos)
#define MR_SUBG_GLOB_STATIC_DATABUFFER_SIZE_DATABUFFER_SIZE_7              (0x80U << MR_SUBG_GLOB_STATIC_DATABUFFER_SIZE_DATABUFFER_SIZE_Pos)
#define MR_SUBG_GLOB_STATIC_DATABUFFER_SIZE_DATABUFFER_SIZE_8              (0x100U << MR_SUBG_GLOB_STATIC_DATABUFFER_SIZE_DATABUFFER_SIZE_Pos)
#define MR_SUBG_GLOB_STATIC_DATABUFFER_SIZE_DATABUFFER_SIZE_9              (0x200U << MR_SUBG_GLOB_STATIC_DATABUFFER_SIZE_DATABUFFER_SIZE_Pos)
#define MR_SUBG_GLOB_STATIC_DATABUFFER_SIZE_DATABUFFER_SIZE_10             (0x400U << MR_SUBG_GLOB_STATIC_DATABUFFER_SIZE_DATABUFFER_SIZE_Pos)
#define MR_SUBG_GLOB_STATIC_DATABUFFER_SIZE_DATABUFFER_SIZE_11             (0x800U << MR_SUBG_GLOB_STATIC_DATABUFFER_SIZE_DATABUFFER_SIZE_Pos)
#define MR_SUBG_GLOB_STATIC_DATABUFFER_SIZE_DATABUFFER_SIZE_12             (0x1000U << MR_SUBG_GLOB_STATIC_DATABUFFER_SIZE_DATABUFFER_SIZE_Pos)
#define MR_SUBG_GLOB_STATIC_DATABUFFER_SIZE_DATABUFFER_SIZE_13             (0x2000U << MR_SUBG_GLOB_STATIC_DATABUFFER_SIZE_DATABUFFER_SIZE_Pos)
#define MR_SUBG_GLOB_STATIC_DATABUFFER_SIZE_DATABUFFER_SIZE_14             (0x4000U << MR_SUBG_GLOB_STATIC_DATABUFFER_SIZE_DATABUFFER_SIZE_Pos)
#define MR_SUBG_GLOB_STATIC_DATABUFFER_SIZE_DATABUFFER_SIZE_15             (0x8000U << MR_SUBG_GLOB_STATIC_DATABUFFER_SIZE_DATABUFFER_SIZE_Pos)

/* =====================================================    PA_LEVEL_3_0    =====================================================*/ 
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL3_Pos                     (24UL)		/*!<MR_SUBG_GLOB_STATIC PA_LEVEL_3_0: PA_LEVEL3 (Bit 24) */
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL3_Msk                     (0xff000000UL)		/*!< MR_SUBG_GLOB_STATIC PA_LEVEL_3_0: PA_LEVEL3 (Bitfield-Mask: 0xff) */
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL3                         MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL3_Msk
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL3_0                       (0x1U << MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL3_Pos)
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL3_1                       (0x2U << MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL3_Pos)
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL3_2                       (0x4U << MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL3_Pos)
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL3_3                       (0x8U << MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL3_Pos)
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL3_4                       (0x10U << MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL3_Pos)
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL3_5                       (0x20U << MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL3_Pos)
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL3_6                       (0x40U << MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL3_Pos)
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL3_7                       (0x80U << MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL3_Pos)
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL2_Pos                     (16UL)		/*!<MR_SUBG_GLOB_STATIC PA_LEVEL_3_0: PA_LEVEL2 (Bit 16) */
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL2_Msk                     (0xff0000UL)		/*!< MR_SUBG_GLOB_STATIC PA_LEVEL_3_0: PA_LEVEL2 (Bitfield-Mask: 0xff) */
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL2                         MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL2_Msk
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL2_0                       (0x1U << MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL2_Pos)
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL2_1                       (0x2U << MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL2_Pos)
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL2_2                       (0x4U << MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL2_Pos)
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL2_3                       (0x8U << MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL2_Pos)
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL2_4                       (0x10U << MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL2_Pos)
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL2_5                       (0x20U << MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL2_Pos)
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL2_6                       (0x40U << MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL2_Pos)
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL2_7                       (0x80U << MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL2_Pos)
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL1_Pos                     (8UL)		/*!<MR_SUBG_GLOB_STATIC PA_LEVEL_3_0: PA_LEVEL1 (Bit 8) */
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL1_Msk                     (0xff00UL)		/*!< MR_SUBG_GLOB_STATIC PA_LEVEL_3_0: PA_LEVEL1 (Bitfield-Mask: 0xff) */
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL1                         MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL1_Msk
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL1_0                       (0x1U << MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL1_Pos)
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL1_1                       (0x2U << MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL1_Pos)
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL1_2                       (0x4U << MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL1_Pos)
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL1_3                       (0x8U << MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL1_Pos)
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL1_4                       (0x10U << MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL1_Pos)
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL1_5                       (0x20U << MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL1_Pos)
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL1_6                       (0x40U << MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL1_Pos)
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL1_7                       (0x80U << MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL1_Pos)
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL0_Pos                     (0UL)		/*!<MR_SUBG_GLOB_STATIC PA_LEVEL_3_0: PA_LEVEL0 (Bit 0) */
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL0_Msk                     (0xffUL)		/*!< MR_SUBG_GLOB_STATIC PA_LEVEL_3_0: PA_LEVEL0 (Bitfield-Mask: 0xff) */
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL0                         MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL0_Msk
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL0_0                       (0x1U << MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL0_Pos)
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL0_1                       (0x2U << MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL0_Pos)
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL0_2                       (0x4U << MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL0_Pos)
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL0_3                       (0x8U << MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL0_Pos)
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL0_4                       (0x10U << MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL0_Pos)
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL0_5                       (0x20U << MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL0_Pos)
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL0_6                       (0x40U << MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL0_Pos)
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL0_7                       (0x80U << MR_SUBG_GLOB_STATIC_PA_LEVEL_3_0_PA_LEVEL0_Pos)

/* =====================================================    PA_LEVEL_7_4    =====================================================*/ 
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL7_Pos                     (24UL)		/*!<MR_SUBG_GLOB_STATIC PA_LEVEL_7_4: PA_LEVEL7 (Bit 24) */
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL7_Msk                     (0xff000000UL)		/*!< MR_SUBG_GLOB_STATIC PA_LEVEL_7_4: PA_LEVEL7 (Bitfield-Mask: 0xff) */
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL7                         MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL7_Msk
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL7_0                       (0x1U << MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL7_Pos)
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL7_1                       (0x2U << MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL7_Pos)
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL7_2                       (0x4U << MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL7_Pos)
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL7_3                       (0x8U << MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL7_Pos)
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL7_4                       (0x10U << MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL7_Pos)
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL7_5                       (0x20U << MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL7_Pos)
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL7_6                       (0x40U << MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL7_Pos)
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL7_7                       (0x80U << MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL7_Pos)
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL6_Pos                     (16UL)		/*!<MR_SUBG_GLOB_STATIC PA_LEVEL_7_4: PA_LEVEL6 (Bit 16) */
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL6_Msk                     (0xff0000UL)		/*!< MR_SUBG_GLOB_STATIC PA_LEVEL_7_4: PA_LEVEL6 (Bitfield-Mask: 0xff) */
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL6                         MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL6_Msk
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL6_0                       (0x1U << MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL6_Pos)
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL6_1                       (0x2U << MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL6_Pos)
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL6_2                       (0x4U << MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL6_Pos)
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL6_3                       (0x8U << MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL6_Pos)
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL6_4                       (0x10U << MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL6_Pos)
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL6_5                       (0x20U << MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL6_Pos)
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL6_6                       (0x40U << MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL6_Pos)
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL6_7                       (0x80U << MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL6_Pos)
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL5_Pos                     (8UL)		/*!<MR_SUBG_GLOB_STATIC PA_LEVEL_7_4: PA_LEVEL5 (Bit 8) */
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL5_Msk                     (0xff00UL)		/*!< MR_SUBG_GLOB_STATIC PA_LEVEL_7_4: PA_LEVEL5 (Bitfield-Mask: 0xff) */
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL5                         MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL5_Msk
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL5_0                       (0x1U << MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL5_Pos)
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL5_1                       (0x2U << MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL5_Pos)
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL5_2                       (0x4U << MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL5_Pos)
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL5_3                       (0x8U << MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL5_Pos)
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL5_4                       (0x10U << MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL5_Pos)
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL5_5                       (0x20U << MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL5_Pos)
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL5_6                       (0x40U << MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL5_Pos)
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL5_7                       (0x80U << MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL5_Pos)
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL4_Pos                     (0UL)		/*!<MR_SUBG_GLOB_STATIC PA_LEVEL_7_4: PA_LEVEL4 (Bit 0) */
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL4_Msk                     (0xffUL)		/*!< MR_SUBG_GLOB_STATIC PA_LEVEL_7_4: PA_LEVEL4 (Bitfield-Mask: 0xff) */
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL4                         MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL4_Msk
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL4_0                       (0x1U << MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL4_Pos)
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL4_1                       (0x2U << MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL4_Pos)
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL4_2                       (0x4U << MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL4_Pos)
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL4_3                       (0x8U << MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL4_Pos)
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL4_4                       (0x10U << MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL4_Pos)
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL4_5                       (0x20U << MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL4_Pos)
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL4_6                       (0x40U << MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL4_Pos)
#define MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL4_7                       (0x80U << MR_SUBG_GLOB_STATIC_PA_LEVEL_7_4_PA_LEVEL4_Pos)

/* =====================================================    PA_CONFIG    =====================================================*/ 
#define MR_SUBG_GLOB_STATIC_PA_CONFIG_PA_RAMP_ENABLE_Pos                   (14UL)		/*!<MR_SUBG_GLOB_STATIC PA_CONFIG: PA_RAMP_ENABLE (Bit 14) */
#define MR_SUBG_GLOB_STATIC_PA_CONFIG_PA_RAMP_ENABLE_Msk                   (0x4000UL)		/*!< MR_SUBG_GLOB_STATIC PA_CONFIG: PA_RAMP_ENABLE (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_STATIC_PA_CONFIG_PA_RAMP_ENABLE                       MR_SUBG_GLOB_STATIC_PA_CONFIG_PA_RAMP_ENABLE_Msk
#define MR_SUBG_GLOB_STATIC_PA_CONFIG_LIN_NLOG_Pos                         (13UL)		/*!<MR_SUBG_GLOB_STATIC PA_CONFIG: LIN_NLOG (Bit 13) */
#define MR_SUBG_GLOB_STATIC_PA_CONFIG_LIN_NLOG_Msk                         (0x2000UL)		/*!< MR_SUBG_GLOB_STATIC PA_CONFIG: LIN_NLOG (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_STATIC_PA_CONFIG_LIN_NLOG                             MR_SUBG_GLOB_STATIC_PA_CONFIG_LIN_NLOG_Msk
#define MR_SUBG_GLOB_STATIC_PA_CONFIG_PA_MODE_Pos                          (10UL)		/*!<MR_SUBG_GLOB_STATIC PA_CONFIG: PA_MODE (Bit 10) */
#define MR_SUBG_GLOB_STATIC_PA_CONFIG_PA_MODE_Msk                          (0xc00UL)		/*!< MR_SUBG_GLOB_STATIC PA_CONFIG: PA_MODE (Bitfield-Mask: 0x03) */
#define MR_SUBG_GLOB_STATIC_PA_CONFIG_PA_MODE                              MR_SUBG_GLOB_STATIC_PA_CONFIG_PA_MODE_Msk
#define MR_SUBG_GLOB_STATIC_PA_CONFIG_PA_MODE_0                            (0x1U << MR_SUBG_GLOB_STATIC_PA_CONFIG_PA_MODE_Pos)
#define MR_SUBG_GLOB_STATIC_PA_CONFIG_PA_MODE_1                            (0x2U << MR_SUBG_GLOB_STATIC_PA_CONFIG_PA_MODE_Pos)
#define MR_SUBG_GLOB_STATIC_PA_CONFIG_PA_DRV_MODE_Pos                      (8UL)		/*!<MR_SUBG_GLOB_STATIC PA_CONFIG: PA_DRV_MODE (Bit 8) */
#define MR_SUBG_GLOB_STATIC_PA_CONFIG_PA_DRV_MODE_Msk                      (0x300UL)		/*!< MR_SUBG_GLOB_STATIC PA_CONFIG: PA_DRV_MODE (Bitfield-Mask: 0x03) */
#define MR_SUBG_GLOB_STATIC_PA_CONFIG_PA_DRV_MODE                          MR_SUBG_GLOB_STATIC_PA_CONFIG_PA_DRV_MODE_Msk
#define MR_SUBG_GLOB_STATIC_PA_CONFIG_PA_DRV_MODE_0                        (0x1U << MR_SUBG_GLOB_STATIC_PA_CONFIG_PA_DRV_MODE_Pos)
#define MR_SUBG_GLOB_STATIC_PA_CONFIG_PA_DRV_MODE_1                        (0x2U << MR_SUBG_GLOB_STATIC_PA_CONFIG_PA_DRV_MODE_Pos)
#define MR_SUBG_GLOB_STATIC_PA_CONFIG_ASK_OOK_EN_Pos                       (7UL)		/*!<MR_SUBG_GLOB_STATIC PA_CONFIG: ASK_OOK_EN (Bit 7) */
#define MR_SUBG_GLOB_STATIC_PA_CONFIG_ASK_OOK_EN_Msk                       (0x80UL)		/*!< MR_SUBG_GLOB_STATIC PA_CONFIG: ASK_OOK_EN (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_STATIC_PA_CONFIG_ASK_OOK_EN                           MR_SUBG_GLOB_STATIC_PA_CONFIG_ASK_OOK_EN_Msk
#define MR_SUBG_GLOB_STATIC_PA_CONFIG_PA_INTERP_EN_Pos                     (6UL)		/*!<MR_SUBG_GLOB_STATIC PA_CONFIG: PA_INTERP_EN (Bit 6) */
#define MR_SUBG_GLOB_STATIC_PA_CONFIG_PA_INTERP_EN_Msk                     (0x40UL)		/*!< MR_SUBG_GLOB_STATIC PA_CONFIG: PA_INTERP_EN (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_STATIC_PA_CONFIG_PA_INTERP_EN                         MR_SUBG_GLOB_STATIC_PA_CONFIG_PA_INTERP_EN_Msk
#define MR_SUBG_GLOB_STATIC_PA_CONFIG_PA_LEVEL_MAX_INDEX_Pos               (2UL)		/*!<MR_SUBG_GLOB_STATIC PA_CONFIG: PA_LEVEL_MAX_INDEX (Bit 2) */
#define MR_SUBG_GLOB_STATIC_PA_CONFIG_PA_LEVEL_MAX_INDEX_Msk               (0x1cUL)		/*!< MR_SUBG_GLOB_STATIC PA_CONFIG: PA_LEVEL_MAX_INDEX (Bitfield-Mask: 0x07) */
#define MR_SUBG_GLOB_STATIC_PA_CONFIG_PA_LEVEL_MAX_INDEX                   MR_SUBG_GLOB_STATIC_PA_CONFIG_PA_LEVEL_MAX_INDEX_Msk
#define MR_SUBG_GLOB_STATIC_PA_CONFIG_PA_LEVEL_MAX_INDEX_0                 (0x1U << MR_SUBG_GLOB_STATIC_PA_CONFIG_PA_LEVEL_MAX_INDEX_Pos)
#define MR_SUBG_GLOB_STATIC_PA_CONFIG_PA_LEVEL_MAX_INDEX_1                 (0x2U << MR_SUBG_GLOB_STATIC_PA_CONFIG_PA_LEVEL_MAX_INDEX_Pos)
#define MR_SUBG_GLOB_STATIC_PA_CONFIG_PA_LEVEL_MAX_INDEX_2                 (0x4U << MR_SUBG_GLOB_STATIC_PA_CONFIG_PA_LEVEL_MAX_INDEX_Pos)
#define MR_SUBG_GLOB_STATIC_PA_CONFIG_PA_RAMP_STEP_WIDTH_Pos               (0UL)		/*!<MR_SUBG_GLOB_STATIC PA_CONFIG: PA_RAMP_STEP_WIDTH (Bit 0) */
#define MR_SUBG_GLOB_STATIC_PA_CONFIG_PA_RAMP_STEP_WIDTH_Msk               (0x3UL)		/*!< MR_SUBG_GLOB_STATIC PA_CONFIG: PA_RAMP_STEP_WIDTH (Bitfield-Mask: 0x03) */
#define MR_SUBG_GLOB_STATIC_PA_CONFIG_PA_RAMP_STEP_WIDTH                   MR_SUBG_GLOB_STATIC_PA_CONFIG_PA_RAMP_STEP_WIDTH_Msk
#define MR_SUBG_GLOB_STATIC_PA_CONFIG_PA_RAMP_STEP_WIDTH_0                 (0x1U << MR_SUBG_GLOB_STATIC_PA_CONFIG_PA_RAMP_STEP_WIDTH_Pos)
#define MR_SUBG_GLOB_STATIC_PA_CONFIG_PA_RAMP_STEP_WIDTH_1                 (0x2U << MR_SUBG_GLOB_STATIC_PA_CONFIG_PA_RAMP_STEP_WIDTH_Pos)

