embetech-official/embenet-demo-nucleo-wl33cc1/Drivers/CMSIS/Device/ST/STM32WL3X/Include/stm32wl33.h
/* =====================================================    DATABUFFER_INFO    =====================================================*/ 
#define MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_CURRENT_DATABUFFER_Pos         (31UL)		/*!<MR_SUBG_GLOB_STATUS DATABUFFER_INFO: CURRENT_DATABUFFER (Bit 31) */
#define MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_CURRENT_DATABUFFER_Msk         (0x80000000UL)		/*!< MR_SUBG_GLOB_STATUS DATABUFFER_INFO: CURRENT_DATABUFFER (Bitfield-Mask: 0x01) */
#define MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_CURRENT_DATABUFFER             MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_CURRENT_DATABUFFER_Msk
#define MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_NB_DATABUFFER_USED_Pos         (16UL)		/*!<MR_SUBG_GLOB_STATUS DATABUFFER_INFO: NB_DATABUFFER_USED (Bit 16) */
#define MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_NB_DATABUFFER_USED_Msk         (0x7fff0000UL)		/*!< MR_SUBG_GLOB_STATUS DATABUFFER_INFO: NB_DATABUFFER_USED (Bitfield-Mask: 0x7fff) */
#define MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_NB_DATABUFFER_USED             MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_NB_DATABUFFER_USED_Msk
#define MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_NB_DATABUFFER_USED_0           (0x1U << MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_NB_DATABUFFER_USED_Pos)
#define MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_NB_DATABUFFER_USED_1           (0x2U << MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_NB_DATABUFFER_USED_Pos)
#define MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_NB_DATABUFFER_USED_2           (0x4U << MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_NB_DATABUFFER_USED_Pos)
#define MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_NB_DATABUFFER_USED_3           (0x8U << MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_NB_DATABUFFER_USED_Pos)
#define MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_NB_DATABUFFER_USED_4           (0x10U << MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_NB_DATABUFFER_USED_Pos)
#define MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_NB_DATABUFFER_USED_5           (0x20U << MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_NB_DATABUFFER_USED_Pos)
#define MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_NB_DATABUFFER_USED_6           (0x40U << MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_NB_DATABUFFER_USED_Pos)
#define MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_NB_DATABUFFER_USED_7           (0x80U << MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_NB_DATABUFFER_USED_Pos)
#define MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_NB_DATABUFFER_USED_8           (0x100U << MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_NB_DATABUFFER_USED_Pos)
#define MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_NB_DATABUFFER_USED_9           (0x200U << MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_NB_DATABUFFER_USED_Pos)
#define MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_NB_DATABUFFER_USED_10          (0x400U << MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_NB_DATABUFFER_USED_Pos)
#define MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_NB_DATABUFFER_USED_11          (0x800U << MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_NB_DATABUFFER_USED_Pos)
#define MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_NB_DATABUFFER_USED_12          (0x1000U << MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_NB_DATABUFFER_USED_Pos)
#define MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_NB_DATABUFFER_USED_13          (0x2000U << MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_NB_DATABUFFER_USED_Pos)
#define MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_NB_DATABUFFER_USED_14          (0x4000U << MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_NB_DATABUFFER_USED_Pos)
#define MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_CURRENT_DATABUFFER_COUNT_Pos   (0UL)		/*!<MR_SUBG_GLOB_STATUS DATABUFFER_INFO: CURRENT_DATABUFFER_COUNT (Bit 0) */
#define MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_CURRENT_DATABUFFER_COUNT_Msk   (0xffffUL)		/*!< MR_SUBG_GLOB_STATUS DATABUFFER_INFO: CURRENT_DATABUFFER_COUNT (Bitfield-Mask: 0xffff) */
#define MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_CURRENT_DATABUFFER_COUNT       MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_CURRENT_DATABUFFER_COUNT_Msk
#define MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_CURRENT_DATABUFFER_COUNT_0     (0x1U << MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_CURRENT_DATABUFFER_COUNT_Pos)
#define MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_CURRENT_DATABUFFER_COUNT_1     (0x2U << MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_CURRENT_DATABUFFER_COUNT_Pos)
#define MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_CURRENT_DATABUFFER_COUNT_2     (0x4U << MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_CURRENT_DATABUFFER_COUNT_Pos)
#define MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_CURRENT_DATABUFFER_COUNT_3     (0x8U << MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_CURRENT_DATABUFFER_COUNT_Pos)
#define MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_CURRENT_DATABUFFER_COUNT_4     (0x10U << MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_CURRENT_DATABUFFER_COUNT_Pos)
#define MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_CURRENT_DATABUFFER_COUNT_5     (0x20U << MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_CURRENT_DATABUFFER_COUNT_Pos)
#define MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_CURRENT_DATABUFFER_COUNT_6     (0x40U << MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_CURRENT_DATABUFFER_COUNT_Pos)
#define MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_CURRENT_DATABUFFER_COUNT_7     (0x80U << MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_CURRENT_DATABUFFER_COUNT_Pos)
#define MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_CURRENT_DATABUFFER_COUNT_8     (0x100U << MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_CURRENT_DATABUFFER_COUNT_Pos)
#define MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_CURRENT_DATABUFFER_COUNT_9     (0x200U << MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_CURRENT_DATABUFFER_COUNT_Pos)
#define MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_CURRENT_DATABUFFER_COUNT_10    (0x400U << MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_CURRENT_DATABUFFER_COUNT_Pos)
#define MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_CURRENT_DATABUFFER_COUNT_11    (0x800U << MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_CURRENT_DATABUFFER_COUNT_Pos)
#define MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_CURRENT_DATABUFFER_COUNT_12    (0x1000U << MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_CURRENT_DATABUFFER_COUNT_Pos)
#define MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_CURRENT_DATABUFFER_COUNT_13    (0x2000U << MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_CURRENT_DATABUFFER_COUNT_Pos)
#define MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_CURRENT_DATABUFFER_COUNT_14    (0x4000U << MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_CURRENT_DATABUFFER_COUNT_Pos)
#define MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_CURRENT_DATABUFFER_COUNT_15    (0x8000U << MR_SUBG_GLOB_STATUS_DATABUFFER_INFO_CURRENT_DATABUFFER_COUNT_Pos)

/* =====================================================    TIME_CAPTURE    =====================================================*/ 
#define MR_SUBG_GLOB_STATUS_TIME_CAPTURE_TIME_CAPTURE_Pos                  (0UL)		/*!<MR_SUBG_GLOB_STATUS TIME_CAPTURE: TIME_CAPTURE (Bit 0) */
#define MR_SUBG_GLOB_STATUS_TIME_CAPTURE_TIME_CAPTURE_Msk                  (0xffffffffUL)		/*!< MR_SUBG_GLOB_STATUS TIME_CAPTURE: TIME_CAPTURE (Bitfield-Mask: 0xffffffff) */
#define MR_SUBG_GLOB_STATUS_TIME_CAPTURE_TIME_CAPTURE                      MR_SUBG_GLOB_STATUS_TIME_CAPTURE_TIME_CAPTURE_Msk
#define MR_SUBG_GLOB_STATUS_TIME_CAPTURE_TIME_CAPTURE_0                    (0x1U << MR_SUBG_GLOB_STATUS_TIME_CAPTURE_TIME_CAPTURE_Pos)
#define MR_SUBG_GLOB_STATUS_TIME_CAPTURE_TIME_CAPTURE_1                    (0x2U << MR_SUBG_GLOB_STATUS_TIME_CAPTURE_TIME_CAPTURE_Pos)
#define MR_SUBG_GLOB_STATUS_TIME_CAPTURE_TIME_CAPTURE_2                    (0x4U << MR_SUBG_GLOB_STATUS_TIME_CAPTURE_TIME_CAPTURE_Pos)
#define MR_SUBG_GLOB_STATUS_TIME_CAPTURE_TIME_CAPTURE_3                    (0x8U << MR_SUBG_GLOB_STATUS_TIME_CAPTURE_TIME_CAPTURE_Pos)
#define MR_SUBG_GLOB_STATUS_TIME_CAPTURE_TIME_CAPTURE_4                    (0x10U << MR_SUBG_GLOB_STATUS_TIME_CAPTURE_TIME_CAPTURE_Pos)
#define MR_SUBG_GLOB_STATUS_TIME_CAPTURE_TIME_CAPTURE_5                    (0x20U << MR_SUBG_GLOB_STATUS_TIME_CAPTURE_TIME_CAPTURE_Pos)
#define MR_SUBG_GLOB_STATUS_TIME_CAPTURE_TIME_CAPTURE_6                    (0x40U << MR_SUBG_GLOB_STATUS_TIME_CAPTURE_TIME_CAPTURE_Pos)
#define MR_SUBG_GLOB_STATUS_TIME_CAPTURE_TIME_CAPTURE_7                    (0x80U << MR_SUBG_GLOB_STATUS_TIME_CAPTURE_TIME_CAPTURE_Pos)
#define MR_SUBG_GLOB_STATUS_TIME_CAPTURE_TIME_CAPTURE_8                    (0x100U << MR_SUBG_GLOB_STATUS_TIME_CAPTURE_TIME_CAPTURE_Pos)
#define MR_SUBG_GLOB_STATUS_TIME_CAPTURE_TIME_CAPTURE_9                    (0x200U << MR_SUBG_GLOB_STATUS_TIME_CAPTURE_TIME_CAPTURE_Pos)
#define MR_SUBG_GLOB_STATUS_TIME_CAPTURE_TIME_CAPTURE_10                   (0x400U << MR_SUBG_GLOB_STATUS_TIME_CAPTURE_TIME_CAPTURE_Pos)
#define MR_SUBG_GLOB_STATUS_TIME_CAPTURE_TIME_CAPTURE_11                   (0x800U << MR_SUBG_GLOB_STATUS_TIME_CAPTURE_TIME_CAPTURE_Pos)
#define MR_SUBG_GLOB_STATUS_TIME_CAPTURE_TIME_CAPTURE_12                   (0x1000U << MR_SUBG_GLOB_STATUS_TIME_CAPTURE_TIME_CAPTURE_Pos)
#define MR_SUBG_GLOB_STATUS_TIME_CAPTURE_TIME_CAPTURE_13                   (0x2000U << MR_SUBG_GLOB_STATUS_TIME_CAPTURE_TIME_CAPTURE_Pos)
#define MR_SUBG_GLOB_STATUS_TIME_CAPTURE_TIME_CAPTURE_14                   (0x4000U << MR_SUBG_GLOB_STATUS_TIME_CAPTURE_TIME_CAPTURE_Pos)
#define MR_SUBG_GLOB_STATUS_TIME_CAPTURE_TIME_CAPTURE_15                   (0x8000U << MR_SUBG_GLOB_STATUS_TIME_CAPTURE_TIME_CAPTURE_Pos)
#define MR_SUBG_GLOB_STATUS_TIME_CAPTURE_TIME_CAPTURE_16                   (0x10000U << MR_SUBG_GLOB_STATUS_TIME_CAPTURE_TIME_CAPTURE_Pos)
#define MR_SUBG_GLOB_STATUS_TIME_CAPTURE_TIME_CAPTURE_17                   (0x20000U << MR_SUBG_GLOB_STATUS_TIME_CAPTURE_TIME_CAPTURE_Pos)
#define MR_SUBG_GLOB_STATUS_TIME_CAPTURE_TIME_CAPTURE_18                   (0x40000U << MR_SUBG_GLOB_STATUS_TIME_CAPTURE_TIME_CAPTURE_Pos)
#define MR_SUBG_GLOB_STATUS_TIME_CAPTURE_TIME_CAPTURE_19                   (0x80000U << MR_SUBG_GLOB_STATUS_TIME_CAPTURE_TIME_CAPTURE_Pos)
#define MR_SUBG_GLOB_STATUS_TIME_CAPTURE_TIME_CAPTURE_20                   (0x100000U << MR_SUBG_GLOB_STATUS_TIME_CAPTURE_TIME_CAPTURE_Pos)
#define MR_SUBG_GLOB_STATUS_TIME_CAPTURE_TIME_CAPTURE_21                   (0x200000U << MR_SUBG_GLOB_STATUS_TIME_CAPTURE_TIME_CAPTURE_Pos)
#define MR_SUBG_GLOB_STATUS_TIME_CAPTURE_TIME_CAPTURE_22                   (0x400000U << MR_SUBG_GLOB_STATUS_TIME_CAPTURE_TIME_CAPTURE_Pos)
#define MR_SUBG_GLOB_STATUS_TIME_CAPTURE_TIME_CAPTURE_23                   (0x800000U << MR_SUBG_GLOB_STATUS_TIME_CAPTURE_TIME_CAPTURE_Pos)
#define MR_SUBG_GLOB_STATUS_TIME_CAPTURE_TIME_CAPTURE_24                   (0x1000000U << MR_SUBG_GLOB_STATUS_TIME_CAPTURE_TIME_CAPTURE_Pos)
#define MR_SUBG_GLOB_STATUS_TIME_CAPTURE_TIME_CAPTURE_25                   (0x2000000U << MR_SUBG_GLOB_STATUS_TIME_CAPTURE_TIME_CAPTURE_Pos)
#define MR_SUBG_GLOB_STATUS_TIME_CAPTURE_TIME_CAPTURE_26                   (0x4000000U << MR_SUBG_GLOB_STATUS_TIME_CAPTURE_TIME_CAPTURE_Pos)
#define MR_SUBG_GLOB_STATUS_TIME_CAPTURE_TIME_CAPTURE_27                   (0x8000000U << MR_SUBG_GLOB_STATUS_TIME_CAPTURE_TIME_CAPTURE_Pos)
#define MR_SUBG_GLOB_STATUS_TIME_CAPTURE_TIME_CAPTURE_28                   (0x10000000U << MR_SUBG_GLOB_STATUS_TIME_CAPTURE_TIME_CAPTURE_Pos)
#define MR_SUBG_GLOB_STATUS_TIME_CAPTURE_TIME_CAPTURE_29                   (0x20000000U << MR_SUBG_GLOB_STATUS_TIME_CAPTURE_TIME_CAPTURE_Pos)
#define MR_SUBG_GLOB_STATUS_TIME_CAPTURE_TIME_CAPTURE_30                   (0x40000000U << MR_SUBG_GLOB_STATUS_TIME_CAPTURE_TIME_CAPTURE_Pos)
#define MR_SUBG_GLOB_STATUS_TIME_CAPTURE_TIME_CAPTURE_31                   (0x80000000UL << MR_SUBG_GLOB_STATUS_TIME_CAPTURE_TIME_CAPTURE_Pos)

/* =====================================================    IQC_CORRECTION_OUT    =====================================================*/ 
#define MR_SUBG_GLOB_STATUS_IQC_CORRECTION_OUT_IQC_CORRECT_OUT_Pos         (0UL)		/*!<MR_SUBG_GLOB_STATUS IQC_CORRECTION_OUT: IQC_CORRECT_OUT (Bit 0) */
#define MR_SUBG_GLOB_STATUS_IQC_CORRECTION_OUT_IQC_CORRECT_OUT_Msk         (0xffffffUL)		/*!< MR_SUBG_GLOB_STATUS IQC_CORRECTION_OUT: IQC_CORRECT_OUT (Bitfield-Mask: 0xffffff) */
#define MR_SUBG_GLOB_STATUS_IQC_CORRECTION_OUT_IQC_CORRECT_OUT             MR_SUBG_GLOB_STATUS_IQC_CORRECTION_OUT_IQC_CORRECT_OUT_Msk
#define MR_SUBG_GLOB_STATUS_IQC_CORRECTION_OUT_IQC_CORRECT_OUT_0           (0x1U << MR_SUBG_GLOB_STATUS_IQC_CORRECTION_OUT_IQC_CORRECT_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_IQC_CORRECTION_OUT_IQC_CORRECT_OUT_1           (0x2U << MR_SUBG_GLOB_STATUS_IQC_CORRECTION_OUT_IQC_CORRECT_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_IQC_CORRECTION_OUT_IQC_CORRECT_OUT_2           (0x4U << MR_SUBG_GLOB_STATUS_IQC_CORRECTION_OUT_IQC_CORRECT_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_IQC_CORRECTION_OUT_IQC_CORRECT_OUT_3           (0x8U << MR_SUBG_GLOB_STATUS_IQC_CORRECTION_OUT_IQC_CORRECT_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_IQC_CORRECTION_OUT_IQC_CORRECT_OUT_4           (0x10U << MR_SUBG_GLOB_STATUS_IQC_CORRECTION_OUT_IQC_CORRECT_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_IQC_CORRECTION_OUT_IQC_CORRECT_OUT_5           (0x20U << MR_SUBG_GLOB_STATUS_IQC_CORRECTION_OUT_IQC_CORRECT_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_IQC_CORRECTION_OUT_IQC_CORRECT_OUT_6           (0x40U << MR_SUBG_GLOB_STATUS_IQC_CORRECTION_OUT_IQC_CORRECT_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_IQC_CORRECTION_OUT_IQC_CORRECT_OUT_7           (0x80U << MR_SUBG_GLOB_STATUS_IQC_CORRECTION_OUT_IQC_CORRECT_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_IQC_CORRECTION_OUT_IQC_CORRECT_OUT_8           (0x100U << MR_SUBG_GLOB_STATUS_IQC_CORRECTION_OUT_IQC_CORRECT_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_IQC_CORRECTION_OUT_IQC_CORRECT_OUT_9           (0x200U << MR_SUBG_GLOB_STATUS_IQC_CORRECTION_OUT_IQC_CORRECT_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_IQC_CORRECTION_OUT_IQC_CORRECT_OUT_10          (0x400U << MR_SUBG_GLOB_STATUS_IQC_CORRECTION_OUT_IQC_CORRECT_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_IQC_CORRECTION_OUT_IQC_CORRECT_OUT_11          (0x800U << MR_SUBG_GLOB_STATUS_IQC_CORRECTION_OUT_IQC_CORRECT_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_IQC_CORRECTION_OUT_IQC_CORRECT_OUT_12          (0x1000U << MR_SUBG_GLOB_STATUS_IQC_CORRECTION_OUT_IQC_CORRECT_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_IQC_CORRECTION_OUT_IQC_CORRECT_OUT_13          (0x2000U << MR_SUBG_GLOB_STATUS_IQC_CORRECTION_OUT_IQC_CORRECT_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_IQC_CORRECTION_OUT_IQC_CORRECT_OUT_14          (0x4000U << MR_SUBG_GLOB_STATUS_IQC_CORRECTION_OUT_IQC_CORRECT_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_IQC_CORRECTION_OUT_IQC_CORRECT_OUT_15          (0x8000U << MR_SUBG_GLOB_STATUS_IQC_CORRECTION_OUT_IQC_CORRECT_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_IQC_CORRECTION_OUT_IQC_CORRECT_OUT_16          (0x10000U << MR_SUBG_GLOB_STATUS_IQC_CORRECTION_OUT_IQC_CORRECT_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_IQC_CORRECTION_OUT_IQC_CORRECT_OUT_17          (0x20000U << MR_SUBG_GLOB_STATUS_IQC_CORRECTION_OUT_IQC_CORRECT_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_IQC_CORRECTION_OUT_IQC_CORRECT_OUT_18          (0x40000U << MR_SUBG_GLOB_STATUS_IQC_CORRECTION_OUT_IQC_CORRECT_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_IQC_CORRECTION_OUT_IQC_CORRECT_OUT_19          (0x80000U << MR_SUBG_GLOB_STATUS_IQC_CORRECTION_OUT_IQC_CORRECT_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_IQC_CORRECTION_OUT_IQC_CORRECT_OUT_20          (0x100000U << MR_SUBG_GLOB_STATUS_IQC_CORRECTION_OUT_IQC_CORRECT_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_IQC_CORRECTION_OUT_IQC_CORRECT_OUT_21          (0x200000U << MR_SUBG_GLOB_STATUS_IQC_CORRECTION_OUT_IQC_CORRECT_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_IQC_CORRECTION_OUT_IQC_CORRECT_OUT_22          (0x400000U << MR_SUBG_GLOB_STATUS_IQC_CORRECTION_OUT_IQC_CORRECT_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_IQC_CORRECTION_OUT_IQC_CORRECT_OUT_23          (0x800000U << MR_SUBG_GLOB_STATUS_IQC_CORRECTION_OUT_IQC_CORRECT_OUT_Pos)

/* =====================================================    PA_SAFEASK_OUT    =====================================================*/ 
#define MR_SUBG_GLOB_STATUS_PA_SAFEASK_OUT_PA_CODEMAX_Pos                  (0UL)		/*!<MR_SUBG_GLOB_STATUS PA_SAFEASK_OUT: PA_CODEMAX (Bit 0) */
#define MR_SUBG_GLOB_STATUS_PA_SAFEASK_OUT_PA_CODEMAX_Msk                  (0xffUL)		/*!< MR_SUBG_GLOB_STATUS PA_SAFEASK_OUT: PA_CODEMAX (Bitfield-Mask: 0xff) */
#define MR_SUBG_GLOB_STATUS_PA_SAFEASK_OUT_PA_CODEMAX                      MR_SUBG_GLOB_STATUS_PA_SAFEASK_OUT_PA_CODEMAX_Msk
#define MR_SUBG_GLOB_STATUS_PA_SAFEASK_OUT_PA_CODEMAX_0                    (0x1U << MR_SUBG_GLOB_STATUS_PA_SAFEASK_OUT_PA_CODEMAX_Pos)
#define MR_SUBG_GLOB_STATUS_PA_SAFEASK_OUT_PA_CODEMAX_1                    (0x2U << MR_SUBG_GLOB_STATUS_PA_SAFEASK_OUT_PA_CODEMAX_Pos)
#define MR_SUBG_GLOB_STATUS_PA_SAFEASK_OUT_PA_CODEMAX_2                    (0x4U << MR_SUBG_GLOB_STATUS_PA_SAFEASK_OUT_PA_CODEMAX_Pos)
#define MR_SUBG_GLOB_STATUS_PA_SAFEASK_OUT_PA_CODEMAX_3                    (0x8U << MR_SUBG_GLOB_STATUS_PA_SAFEASK_OUT_PA_CODEMAX_Pos)
#define MR_SUBG_GLOB_STATUS_PA_SAFEASK_OUT_PA_CODEMAX_4                    (0x10U << MR_SUBG_GLOB_STATUS_PA_SAFEASK_OUT_PA_CODEMAX_Pos)
#define MR_SUBG_GLOB_STATUS_PA_SAFEASK_OUT_PA_CODEMAX_5                    (0x20U << MR_SUBG_GLOB_STATUS_PA_SAFEASK_OUT_PA_CODEMAX_Pos)
#define MR_SUBG_GLOB_STATUS_PA_SAFEASK_OUT_PA_CODEMAX_6                    (0x40U << MR_SUBG_GLOB_STATUS_PA_SAFEASK_OUT_PA_CODEMAX_Pos)
#define MR_SUBG_GLOB_STATUS_PA_SAFEASK_OUT_PA_CODEMAX_7                    (0x80U << MR_SUBG_GLOB_STATUS_PA_SAFEASK_OUT_PA_CODEMAX_Pos)

/* =====================================================    VCO_CALIB_OUT    =====================================================*/ 
#define MR_SUBG_GLOB_STATUS_VCO_CALIB_OUT_VCO_CALAMP_OUT_Pos               (8UL)		/*!<MR_SUBG_GLOB_STATUS VCO_CALIB_OUT: VCO_CALAMP_OUT (Bit 8) */
#define MR_SUBG_GLOB_STATUS_VCO_CALIB_OUT_VCO_CALAMP_OUT_Msk               (0x3fff00UL)		/*!< MR_SUBG_GLOB_STATUS VCO_CALIB_OUT: VCO_CALAMP_OUT (Bitfield-Mask: 0x3fff) */
#define MR_SUBG_GLOB_STATUS_VCO_CALIB_OUT_VCO_CALAMP_OUT                   MR_SUBG_GLOB_STATUS_VCO_CALIB_OUT_VCO_CALAMP_OUT_Msk
#define MR_SUBG_GLOB_STATUS_VCO_CALIB_OUT_VCO_CALAMP_OUT_0                 (0x1U << MR_SUBG_GLOB_STATUS_VCO_CALIB_OUT_VCO_CALAMP_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_VCO_CALIB_OUT_VCO_CALAMP_OUT_1                 (0x2U << MR_SUBG_GLOB_STATUS_VCO_CALIB_OUT_VCO_CALAMP_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_VCO_CALIB_OUT_VCO_CALAMP_OUT_2                 (0x4U << MR_SUBG_GLOB_STATUS_VCO_CALIB_OUT_VCO_CALAMP_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_VCO_CALIB_OUT_VCO_CALAMP_OUT_3                 (0x8U << MR_SUBG_GLOB_STATUS_VCO_CALIB_OUT_VCO_CALAMP_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_VCO_CALIB_OUT_VCO_CALAMP_OUT_4                 (0x10U << MR_SUBG_GLOB_STATUS_VCO_CALIB_OUT_VCO_CALAMP_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_VCO_CALIB_OUT_VCO_CALAMP_OUT_5                 (0x20U << MR_SUBG_GLOB_STATUS_VCO_CALIB_OUT_VCO_CALAMP_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_VCO_CALIB_OUT_VCO_CALAMP_OUT_6                 (0x40U << MR_SUBG_GLOB_STATUS_VCO_CALIB_OUT_VCO_CALAMP_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_VCO_CALIB_OUT_VCO_CALAMP_OUT_7                 (0x80U << MR_SUBG_GLOB_STATUS_VCO_CALIB_OUT_VCO_CALAMP_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_VCO_CALIB_OUT_VCO_CALAMP_OUT_8                 (0x100U << MR_SUBG_GLOB_STATUS_VCO_CALIB_OUT_VCO_CALAMP_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_VCO_CALIB_OUT_VCO_CALAMP_OUT_9                 (0x200U << MR_SUBG_GLOB_STATUS_VCO_CALIB_OUT_VCO_CALAMP_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_VCO_CALIB_OUT_VCO_CALAMP_OUT_10                (0x400U << MR_SUBG_GLOB_STATUS_VCO_CALIB_OUT_VCO_CALAMP_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_VCO_CALIB_OUT_VCO_CALAMP_OUT_11                (0x800U << MR_SUBG_GLOB_STATUS_VCO_CALIB_OUT_VCO_CALAMP_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_VCO_CALIB_OUT_VCO_CALAMP_OUT_12                (0x1000U << MR_SUBG_GLOB_STATUS_VCO_CALIB_OUT_VCO_CALAMP_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_VCO_CALIB_OUT_VCO_CALAMP_OUT_13                (0x2000U << MR_SUBG_GLOB_STATUS_VCO_CALIB_OUT_VCO_CALAMP_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_VCO_CALIB_OUT_VCO_CALFREQ_OUT_Pos              (0UL)		/*!<MR_SUBG_GLOB_STATUS VCO_CALIB_OUT: VCO_CALFREQ_OUT (Bit 0) */
#define MR_SUBG_GLOB_STATUS_VCO_CALIB_OUT_VCO_CALFREQ_OUT_Msk              (0x7fUL)		/*!< MR_SUBG_GLOB_STATUS VCO_CALIB_OUT: VCO_CALFREQ_OUT (Bitfield-Mask: 0x7f) */
#define MR_SUBG_GLOB_STATUS_VCO_CALIB_OUT_VCO_CALFREQ_OUT                  MR_SUBG_GLOB_STATUS_VCO_CALIB_OUT_VCO_CALFREQ_OUT_Msk
#define MR_SUBG_GLOB_STATUS_VCO_CALIB_OUT_VCO_CALFREQ_OUT_0                (0x1U << MR_SUBG_GLOB_STATUS_VCO_CALIB_OUT_VCO_CALFREQ_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_VCO_CALIB_OUT_VCO_CALFREQ_OUT_1                (0x2U << MR_SUBG_GLOB_STATUS_VCO_CALIB_OUT_VCO_CALFREQ_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_VCO_CALIB_OUT_VCO_CALFREQ_OUT_2                (0x4U << MR_SUBG_GLOB_STATUS_VCO_CALIB_OUT_VCO_CALFREQ_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_VCO_CALIB_OUT_VCO_CALFREQ_OUT_3                (0x8U << MR_SUBG_GLOB_STATUS_VCO_CALIB_OUT_VCO_CALFREQ_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_VCO_CALIB_OUT_VCO_CALFREQ_OUT_4                (0x10U << MR_SUBG_GLOB_STATUS_VCO_CALIB_OUT_VCO_CALFREQ_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_VCO_CALIB_OUT_VCO_CALFREQ_OUT_5                (0x20U << MR_SUBG_GLOB_STATUS_VCO_CALIB_OUT_VCO_CALFREQ_OUT_Pos)
#define MR_SUBG_GLOB_STATUS_VCO_CALIB_OUT_VCO_CALFREQ_OUT_6                (0x40U << MR_SUBG_GLOB_STATUS_VCO_CALIB_OUT_VCO_CALFREQ_OUT_Pos)

/* =====================================================    SEQ_INFO    =====================================================*/ 
#define MR_SUBG_GLOB_STATUS_SEQ_INFO_SEQ_FSM_STATE_Pos                     (0UL)		/*!<MR_SUBG_GLOB_STATUS SEQ_INFO: SEQ_FSM_STATE (Bit 0) */
#define MR_SUBG_GLOB_STATUS_SEQ_INFO_SEQ_FSM_STATE_Msk                     (0x1fUL)		/*!< MR_SUBG_GLOB_STATUS SEQ_INFO: SEQ_FSM_STATE (Bitfield-Mask: 0x1f) */
#define MR_SUBG_GLOB_STATUS_SEQ_INFO_SEQ_FSM_STATE                         MR_SUBG_GLOB_STATUS_SEQ_INFO_SEQ_FSM_STATE_Msk
#define MR_SUBG_GLOB_STATUS_SEQ_INFO_SEQ_FSM_STATE_0                       (0x1U << MR_SUBG_GLOB_STATUS_SEQ_INFO_SEQ_FSM_STATE_Pos)
#define MR_SUBG_GLOB_STATUS_SEQ_INFO_SEQ_FSM_STATE_1                       (0x2U << MR_SUBG_GLOB_STATUS_SEQ_INFO_SEQ_FSM_STATE_Pos)
#define MR_SUBG_GLOB_STATUS_SEQ_INFO_SEQ_FSM_STATE_2                       (0x4U << MR_SUBG_GLOB_STATUS_SEQ_INFO_SEQ_FSM_STATE_Pos)
#define MR_SUBG_GLOB_STATUS_SEQ_INFO_SEQ_FSM_STATE_3                       (0x8U << MR_SUBG_GLOB_STATUS_SEQ_INFO_SEQ_FSM_STATE_Pos)
#define MR_SUBG_GLOB_STATUS_SEQ_INFO_SEQ_FSM_STATE_4                       (0x10U << MR_SUBG_GLOB_STATUS_SEQ_INFO_SEQ_FSM_STATE_Pos)

